export const tta2018 = `탈중앙화 웹,Decentralized web,,,"웹상에서 특정 기업이나 기관이 사용자의 데이터를 독점하는 현상에 대응하여 데이터의 분산 저장과 사용자의 데이터 접근 이용 정책을 개방하는 현상을 일컫는 말.

웹이 처음 보급될 당시, 웹은 언제 어디서나 접근 가능하고 개방하는 것을 기본 개념으로 하였다. 하지만, 최근 글로벌 웹 서비스 업체들이 대다수 사용자 데이터를 수집하여 특정 서버에 저장, 독점하고, 소유권자의 접근, 삭제, 이동 권한을 제한하고 있다. 또 서비스가 중단될 경우 데이터로의 접근 자체가 불가능해진다. 데이터를 백업받았다고 하더라도 다른 서비스 제공 업체에 데이터를 다시 게재하는 것이 불가능한 경우도 발생한다. 이렇게 일부 기업들이 데이터를 독점하는 ‘중앙화 웹(centralized web)’ 현상에 대해 월드와이드 웹 컨소시엄(W3C)을 중심으로 비판이 제기되었다. 데이터를 단순히 특정 중앙 서버에 저장하는 것뿐만 아니라 특정 기업이나 기관에 정책적으로 종속되는 환경을 극복하고, 초기 웹의 정신을 되살리자는 의미에서 ‘탈중앙화 웹’의 개념이 2010년 무렵부터 본격적으로 등장하였다.
탈중앙화 웹은 사용자의 데이터를 분산 보관하거나 사용자의 단말에 직접 보관할 수 있도록 한다. 서비스 제공자 간의 데이터 연동을 위한 표준화 활동으로도 이어졌다. W3C의 소셜 웹(social web) 표준이 대표적인 사례이다."
중앙화 웹,Centralized web,,,"웹상의 데이터를 특정 중앙 서버에 저장하여 처리하거나 특정 기업이나 기관이 사용자의 데이터를 독점하는 현상을 일컫는 말.

웹이 처음 개발되었을 당시, 웹의 자원은 언제 어디서나 접근이 가능하다는 것이 기본 개념이었다. 하지만 일부 글로벌 웹 서비스 업체나 국가 기관의 정책이나 환경에 의해 데이터 소유권자인 사용자가 자신의 데이터에 마음대로 접근하지 못하고 데이터를 삭제할 수 없으며 다른 서비스로도 이동할 수 없다. 이와 같이 데이터가 특정 서버, 기업, 기관 등에 의해 독점되어 데이터 소유자의 권한이 제한되는 상황에 대해 월드와이드 웹 컨소시엄(W3C)을 중심으로 거센 비판이 나오기 시작하였고, 이와 함께 등장한 용어가 ‘중앙화 웹’이다."
감정 그림 문자,Emoji,,이모지,"감정을 표현하는 유니코드의 그림 문자 처리 기술.
일본어 ‘그림(絵, 에[え])’과 ‘문자(文字, 모지[もじ])’의 합성어이다. 이모티콘(emoticon)은 텍스트(아스키 문자)의 조합으로 감정을 나타내지만, 감정 그림 문자(이모지)는 이미지로 감정을 표현한다.

1999년 일본의 이동통신사 NTT 도코모(NTT DoCoMo)가 이미지로 된 문자인 이모지를 처음 도입하였다. 초기에는 통신사 간 호환이 되지 않았으나, 이동통신과 스마트폰 발전으로 이모지가 인기를 끌면서 모든 통신사에서 이모지를 지원하게 되었다. 모바일 운영 체제를 개발하던 구글(Google)과 애플(Apple)의 제안으로 2007년 유니코드 기술 위원회(Unicode Technical Committee)에서 유니코드 이모지 기술 표준이 제정되었다. 이로써 일본뿐만 아니라 전 세계적으로 인기를 얻게 되었다. 이모지는 누리 소통망 서비스(SNS) 활성화로 빠르게 확산되었다.
광대역 이동통신으로 데이터 전송 속도가 빨라져 애니메이션 형태의 이모지인 스티커(sticker)도 등장하였다."
감정 스티커,Emoticon sticker,,,"캐릭터의 다양한 애니메이션 동작을 이용하여 감정을 표현하는 그림 문자 처리 기술 또는 그 캐릭터.
정적인 감정 그림 문자(이모지)에 비해 스마트폰 사용자의 감정을 보다 풍부하게 전달할 수 있다. 광대역 이동통신의 발전과 함께 이모티콘과 감정 그림 문자가 진화한 형태이다.

애니메이션 방식은 상대방에게 발송자의 감정을 더욱 풍부하게 표현하고, 대화를 좀 더 즐겁게 해준다. 스토리나 콘셉트를 적용한 캐릭터부터 시리즈 형식을 가진 스티커까지 다양한 형태로 제작되고 있다.
스마트폰에서 본인 사진을 촬영하여 증강 현실(AR) 기술로 3D 캐릭터를 만드는 서비스도 스티커에 해당된다. 본인 얼굴을 닮은 스티커는 수신자에게 좀 더 친밀감을 전해준다. 네이버 라인이나 카카오 프렌즈 등 동물 기반의 스티커도 대표적인 사례이다."
지능형 사물,Intelligent things,,,"주변 환경에 스스로 대응하는 사물.
빛, 열, 음, 전파 등 다양한 센서로 주변 상황을 인지하여 획득한 정보를 통신망을 통해 컴퓨터에 전달하고, 지능 정보 처리된 결과를 다시 받아 컨트롤러를 통해 스스로 주변 환경에 대응한다. 지능형 사물은 사람들이 일상적으로 사용하는 기기로 구현된다.

지능형 사물의 대표적인 예로 자율 주행 자동차, 지능형 로봇, 무인 비행기(드론) 등이 있다. 자율 주행 자동차는 GPS, 관성 항법 장치(INS: Inertial Navigation System)를 이용하여 자율 주행을 하고, 카메라, 레이더(Radar), 라이더(Lidar), 소나(sonar) 등 탑재된 센서로 장애물, 앞차와의 간격, 신호 등에 적절히 대응하여 충돌을 예방한다. 지능형 로봇은 인공 지능 및 시각, 청각, 촉각 등 감각을 통해 외부 환경을 인식하고, 스스로 상황을 판단, 자율적으로 동작한다. 산업, 국방, 재난, 서비스 등에 활용된다. 드론은 지상에서 원격 조종하거나, 미리 프로그래밍된 경로에 따라 자동 또는 반자동으로 자율 비행, 또는 인공 지능을 탑재하여 자체적인 환경 판단에 따라 임무를 수행한다. 드론은 국방, 통신, 촬영, 배송 등에 활용된다.
지능형 사물은 2017년과 2018년에 가트너(Gartner)의 10대 전략 기술 중 하나로 선정되었다."
에지 컴퓨팅,Edge computing,,,"다양한 단말 기기에서 발생하는 데이터를 클라우드와 같은 중앙 집중식 데이터센터로 보내지 않고 데이터가 발생한 현장 혹은 근거리에서 실시간 처리하는 방식으로 데이터 흐름 가속화를 지원하는 컴퓨팅 방식.
처리 가능한 대용량 데이터를 발생지(소스) 주변에서 효율적으로 처리함으로써 데이터 처리 시간이 큰 폭으로 단축되고 인터넷 대역폭 사용량이 감소하는 장점이 있다.

에지 컴퓨팅은 기존 클라우드 컴퓨팅(cloud computing)과는 다른 컴퓨팅 접근 방법으로, 서로를 대체하는 것이 아닌 각각의 문제점을 보완하는 공생 관계에 가깝다. 에지 컴퓨팅을 클라우드(중앙 구름) 환경의 일부 작은 규모의 플랫폼으로 보아 클라우드렛(cloudlet, 작은 구름) 용어로 쓰기도 하고, 단말 기기 주변(에지)에서 처리되는 것을 가리켜 포그 컴퓨팅(fog computing)이라고도 한다.
에지 컴퓨팅은 네트워크 연결과 대기 시간, 대역폭 제약, 단말 기기에 내장된 다양한 기능 등을 고려하여 설계되기 때문에 분산 컴퓨팅 모델에 유리하다.
에지 컴퓨팅의 대표적인 사례는 자율 주행 자동차이다. 자율 주행 자동차는 차량에 부착된 각 센서들로 주변 지형이나 도로 상황, 차량 흐름 현황 등을 파악해 데이터를 수집하고, 주행 중 일어날 수 있는 다양한 상황에 신속하게 대처해야 한다. 즉, 방대한 데이터의 수집ㆍ처리와 실시간 대응을 위한 빠른 데이터 분석의 필요로 에지 컴퓨팅이 활용된다. 에지 컴퓨팅은 2017년과 2018년에 가트너(Gartner)의 10대 전략 기술 중 하나로 선정되었다."
전파사용료,Spectrum Use Fees,,"spectrum usage fees, spectrum user fees","국가가 무선국 시설자에게 해당 무선국이 사용하는 전파에 대하여 부과하는 사용료.
전파 관리에 필요한 경비의 충당과 전파 관련 분야 진흥을 위하여 부과한다.

전파사용료 부가 기준은 무선국별로 대통령령으로 정하는 바에 따라 해당 무선국이 사용하는 주파수 대역, 전파의 폭 및 안테나 공급 전력 등을 기준으로 산정한다.
전파사용료 부과 대상에서 국가나 지방자치단체가 개설한 무선국, 방송국 중 영리가 목적이 아닌 방송국과 수신 전용의 무선국 등을 개설한 자는 제외한다. 전파사용료의 전부나 일부 감면 대상은 전파법 시행령으로 정하고 있다.
여기에서 무선국 시설자는 개설허가 및 개설신고를 하고 무선국을 개설한 자를 말한다.
※ 전파사용료(Spectrum Use Fees)는 전파법으로 정의되어 있다."
하이브리드 앱,Hybrid mobile application,Hybrid app,,"기본 기능은 HTML 등의 웹 문서로 구현하고, 패키징은 아이폰, 안드로이드 등 모바일 운영 체제(OS)별로 구현하는 앱.
모바일 웹과 기존 네이티브 앱의 장점을 모두 가진다.

먼저 HTML, 종속 스타일 시트(CSS: Cascading Style Sheets), 자바스크립트(JavaScript) 등 웹 표준 기술을 사용하여 웹 페이지를 구현하고, 안드로이드(Android)나 아이폰(iOS) 개발 환경에서 웹 브라우저로 해당 웹 페이지들을 로딩하여 OS 환경에 맞게 빌드(build)하여 만든다.
스마트폰이 활성화되면서 사용자 모바일 기기에 동작되는 앱 서비스의 필요성이 대두되었다. 모바일 OS별로 제작해야 하는 앱(native app)은 제작 기간이 길고 개발 및 유지보수 비용 등의 부담이 크다. 반면 모바일 웹은 OS별로 코드를 개발할 필요가 없고, HTML5 같은 언어로도 고급 표현이 가능하다. 이에 모바일 웹과 앱의 장점을 통합하여 개발하는 하이브리드 앱 방식이 관심을 받게 되었다. 제한은 있지만 기존 앱(native app)의 기능을 대부분 탑재할 수 있다. 예를 들어 모바일 웹에서는 지원되지 않는 푸시 알림 기능이 하이브리드 앱에서는 지원된다.
하이브리드 앱은 웹 문서들을 서버 내에 두고 서비스하는 방식과 기본적인 웹 문서들을 사용자 기기에 다운로드하여 저장한 뒤 오프라인 상태에서도 이용하는 방식이 있다."
확장성 스타일 시트 언어 변환,eXtensible Stylesheet Language Transformations,"XSLT, XSL Transformation",,"확장성 마크업 언어(XML) 문서를 다른 스타일의 XML 문서로 변경하거나 다른 문서 형식으로 변환하기 위해 개발된 언어.
XSLT 기반으로 문서 변환 시 원본 문서는 변경되지 않고 변환 결과로 새로운 문서가 생성된다. HTML, 텍스트(txt), 피디에프(PDF), 포스트스크립트(PostScript), 이미지(PNG 등), 한글(HWP) 등의 형식으로 변환할 수 있다.

웹 표준화 단체인 월드 와이드 웹 컨소시엄(W3C)에서 1999년에 XSLT1.0 표준을 제정하였다. 2017년 최신 버전인 XSLT 3.0 표준이 제정되었다.

다음은 XSLT를 활용한 변환 예시이다.
< ?xml version=""1.0"" ? >
< ?xml-stylesheet type=""text/xsl"" href=""example.xsl""? >
< Article >
< Title > What is XSLT < /Title >
< sub-title> XSLT 변환 방법 < /sub-title >
< /Article >

위 XML 문서를 text 문서로 변환한다.
< ?xml version=""1.0"" ? >
< xsl:stylesheet version=""1.0"" xmlns:xsl=""http://www.w3.org/1999/XSL/Transform"">http://www.w3.org/1999/XSL/Transform"" >
< xsl:output method=""text""/ >
< xsl:template match=""/"" >
제목: < xsl:value-of select=""/Article/Title"" >
< /xsl:template >
부제목: < xsl:value-of select=""/Article/sub-title"" >
< /xsl:template >
< /xsl:stylesheet >

변환하면 ‘제목: What is XSLT, 부제목: XSLT 변환 방법’으로 출력된다."
확장성 마크업 경로 언어,eXtensible Markup Language Path Language,XPath,,"확장성 마크업 언어(XML) 문서에서 계층적 구조의 경로를 탐색하고 원하는 내용을 선택하기 위해 사용되는 질의 언어.
문서 양식을 기술하는 데 사용되는 XML 스키마(Schema), XForms 등 W3C의 다양한 표준에서 활용된다. 일반적으로 XPath(엑스패스)로 부른다.
XPath는 웹 표준화 단체인 W3C에서 1999년에 XPath 1.0 표준이 제정된 이후 2017년에 XPath 3.1이 제정되었다.

다음 예는 서적의 제목, 저자, 연도 정보를 표현한다. 모든 서적의 제목 정보를 추출하기 위한 XPath 질의는 ""/bookstore/book/title""로 표현할 수 있으며, 첫 번째 서적 제목 질의는 ""/bookstore/book[1]/title""로 표현할 수 있다.

< ?xml version=""1.0"" encoding=""UTF-8""? >
< bookstore >
< book category=""travel"" >
< title lang=""kr"" > 유럽여행 < /title >
< author > Namwoo Lee < /author >
< year > 2010 < /year >
< /book >

< book category=""children"" >
< title lang=""kr"" > 어린 왕자 < /title >
< author > Antoine de Saint-Exupery < /author >
< year > 1943 < /year >
< /book >
< /bookstore >"
웹 사이트,Web site,,웹사이트,"웹 브라우저를 통해 볼 수 있는 웹 콘텐츠(텍스트, 이미지, 오디오, 비디오 등)와 링크나 동적 기능으로 호출되는 내외부 리소스를 포함한 관련 웹 페이지들의 집합체.
일반적으로 ‘www’로 시작하는 도메인 이름으로 식별되고, 하나 이상의 웹 서버에서 호스팅된다.

웹 사이트는 기본적으로 HTML, XHTML 등의 언어를 사용하여 제작되며, 이미지, 오디오, 비디오 등의 멀티미디어 콘텐츠를 포함할 수 있다. 또 웹 서버의 동적 기능을 통해 데이터베이스, 파일, 응용 프로그램 등의 외부 리소스를 호출해 보여 준다.기본적으로 HTTP 프로토콜을 통해 접속 가능하며, HTTPS를 이용하면 암호화를 통해 웹 콘텐츠의 보안과 개인 정보 보호가 가능하다.
최초의 웹 사이트는 1990년 팀 버너스 리(Tim Berners-Lee)가 유럽입자물리학연구소(CERN)에서 만든 ‘info.cern.ch’이다. 이후 인터넷 기술의 발전과 함께 수많은 웹 사이트가 생겨났고, 2016년 기준으로 전 세계 10억 개 이상의 웹 사이트가 존재하고 있다. 웹 사이트는 PC뿐만 아니라, TV, 스마트폰 등 인터넷에 연결된 다양한 디바이스를 통해 이용할 수 있다."
웹 서비스,Web service,,,"웹 표준을 통해 하나의 전자기기가 다른 전자기기에 제공하는 기능 혹은 서비스.
일반적으로 인터넷 환경에서 특정 전자기기가 자신이 제공하는 다양한 서비스를 다른 전자기기에서 활용할 수 있도록 웹 표준 기반으로 제공하는 것을 의미한다.

월드와이드 웹 컨소시엄(W3C: World Wide Web Consortium)은 웹 서비스를 ‘네트워크 기반으로 기계 간 상호작용에 대한 상호 호환성을 지원하기 위해 설계된 소프트웨어 시스템’으로 정의한다.
웹 기술은 원래 사람과 기계 간의 소통을 위해 설계되었으나, XML과 제이슨(JSON: Javascript Object Notation) 같이 기계가 이해할 수 있는 파일 포맷으로 전달이 가능해지면서 기계 간의 상호작용에도 활용할 수 있게 되었다.
웹 서비스는 초기에 확장성 마크업 언어(XML), SOAP(Simple Object Access Protocol), WSDL(Web Services Description Language)과 UDDI(Universal Description, Discovery, and Integration)를 기반으로 웹 기반 응용을 통합하는 표준 방법으로 기술되었다. 그러나 XML 기반의 표준들은 처리하기가 무겁고 복잡하여, 상대적으로 가볍게 처리가 가능한 레스트풀 응용 프로그래밍 인터페이스(RESTFul API)와 제이슨(JSON: JavaScript Object Notion) 기반으로 웹 서비스 기술이 발전하고 있다."
웹 서버,Web server,,,"웹 콘텐츠를 저장하거나 처리하는 컴퓨터 또는 소프트웨어. 일반적으로 웹 서버가 되는 컴퓨터에 설치되는 소프트웨어를 말한다.

웹 서버 소프트웨어는 HTTP 프로토콜을 통해 클라이언트(웹 브라우저)의 요청 정보를 받아 처리하고 그 결과를 다시 클라이언트에 보낸다. 클라이언트가 요청하는 자원(리소스)을 URL(Uniform Resource Locator) 형태로 받아 내부 파일 시스템과 매핑하여 처리하거나, URL과 입력 값(예: 로그인 화면의 아이디, 패스워드 등)을 함께 받으면 사전에 약속된 처리를 한 후 그 결과를 클라이언트에 전달한다.
대표적인 웹 서버로는 아파치(Apache), 엔진엑스(nginx), 마이크로소프트사의 IIS(Internet Information Services) 등이 있다."
자바스크립트,JavaScript,,,"웹 페이지에서 사용자로부터 특정 이벤트나 입력 값을 받아 동적인 처리를 목적으로 고안된 객체 기반의 스크립트 프로그래밍 언어.
사용자 경험을 향상시키기 위한 방법으로 주로 사용된다. 일반적으로 HTML 문서에 내재되며, 브라우저에서 실행된다.

예를 들면, 마우스를 HTML 문서의 특정 이미지나 텍스트 위로 가져갔을 때 이미지 크기가 커지거나 텍스트의 색이 바뀌는 기능이다. 또 검색창 입력 박스에 ‘자’를 입력하면 현재 기준으로 사용자 검색이 많은 ‘자’로 시작하는 검색어 목록을 보여주는 기능도 자바스크립트로 구현한 것이다.
자바스크립트는 1995년 미국의 넷스케이프 커뮤니케이션즈(Netscape Communications)에서 처음 개발되었다. 자바스크립트 표준은 1996년 11월부터 유럽 컴퓨터 제조업자 협회(ECMA: European Computer Manufacturers Association) 기술위원회 39(TC-39)에서 에크마스크립트(ECMAScript, ECMA-262)라는 이름으로 개발되었다. 최신 표준은 2017년 6월에 제정된 ECMAScript 2017이며, 2015년부터 1년에 한 번씩 새로운 버전의 ECMAScript를 공개하고 있다.
자바스크립트는 주로 웹 브라우저 내에서 사용되는 언어였으나, 자바스크립트 기반의 런타임 플랫폼(예: Node.js)들이 개발되면서 서버측 프로그램 개발에도 사용이 크게 확대되었다.

다음은 자바스크립트가 내재된 HTML 문서의 예로, 브라우저에서 ‘자바스크립트 실행’ 버튼을 클릭하면 < script > 태그 내에서 정의된 함수가 호출되어 실행된다.
< !DOCTYPE html >
< html >
< script> < !-- HTML 문서 내 자바스크립트 마크업 script 사용 -->
function Javascript_testFunc() { document.getElementById(""test"").innerHTML = ""자바스크립트로 추가한 내용입니다!""; } < /script>
< /head>

< body>
< h1> 자바스크립트 시험< /h1>
< p id=""test""> HTML에서 자바스크립트 사용하기< /p>
< button type=""button"" onclick=""Javascript_testFunc()""> 자바스크립트 실행< /button>
< /body>
< /html>"
하이퍼텍스트 프리프로세서,Hypertext Preprocessor,PHP,,"웹 서버에서 사용되는 대표적인 스크립트 언어.
웹 개발 시 서버의 기능을 활용하기 위해 별도의 실행 파일을 만들 필요없이 PHP로 작성된 문서를 HTML 문서 안에 삽입하거나 별도의 문서로 만든다. 일반적으로 약어 피에이치피(PHP)로 사용한다.

웹 서비스를 개발하는 경우 HTML과 CSS, 자바스크립트만으로도 가능하지만, 서버 내에서 실행되어야 하는 서버 관련 기능은 구현하기가 어렵다. 예를 들어 서버와 클라이언트 간의 세션 관리, 사용자가 요청하는 정보를 데이터베이스에서 추출 및 전달하는 등의 기능은 구현하는 데 한계가 있다. PHP는 이러한 한계를 극복하기 위해 개발되었다.
PHP 문서는 HTML 문서 내에 삽입되거나 별도의 문서로 구성되어 서버 내 일반적으로 모듈 형태로 탑재된 PHP 인터프리터에 의해 실행된다. 실행된 결과 값은 웹 서버 소프트웨어를 거쳐 클라이언트에 전달된다.
PHP는 펄(Perl), C 언어 등을 기반으로 하며, 대체적으로 아파치(Apache) 모듈과 함께 사용되고, 데이터베이스 저장을 위해서는 통상적으로 마이에스큐엘(MySQL)이 함께 사용된다.
PHP는 1995년 라스무스 러도프(Rasmus Lerdorf) 프로그래머가 처음 고안하였다. 초기에는 ‘개인 홈페이지 만드는 도구(Personal Home Page tools)’를 의미했으나 현재는 ‘하이퍼텍스트 전처리기(Hypertext Preprocessor)’를 의미한다. PHP 그룹에서 관리하며, 2017년 11월 최신 버전인 PHP 7.2가 공개되었다.
☞ http://php.net/"
하이퍼텍스트 마크업 언어 버전 5,HyperText Markup Language version 5,HTML5,,"2014년 국제 웹 표준화 단체인 W3C(World Wide Web Consortium)에서 개발한 하이퍼텍스트 마크업 언어(HyperText Markup Language) 5 버전.

기존의 액티브엑스(ActiveX)나 플래시(Flash) 같은 플러그인(plug-in) 소프트웨어와 유사한 기능을 웹 응용 프로그램으로 개발할 수 있도록 지원한다. 또한 HTML5는 표준 기술로 이식성이 뛰어나 플랫폼(예: 리눅스, 윈도우, iOS, 안드로이드 등) 대부분에서 실행된다. 즉, HTML5로 웹 응용 프로그램을 만들면 거의 모든 디바이스나 플랫폼에서 사용할 수 있다.
HTML5는 브라우저 개발 업체 주축으로 결성된 왓더블유지(WHATWG: Web Hypertext Application Technology Working Group)에서 초안을 개발하였고, W3C에서 표준화를 추진하여 2014년 말 표준으로 제정하였다.
초기 HTML 버전은 인터넷 환경에서 그래픽스 사용자 인터페이스(GUI) 기반으로 정보 공유를 효과적으로 하기 위한 하이퍼텍스트 표준을 개발하는 것이 목적이었다. 인터넷이 발전하면서 HTML5는 인터넷 기반 웹 응용 프로그램 개발에 필요한 오디오, 비디오 등의 멀티미디어 기능, 2D 그래픽스 기능, 웹 저장소(web storage), 웹소켓(WebSocket) 등 플랫폼 기술들을 표준으로 추가하였다."
하이퍼텍스트 마크업 언어,HyperText Markup Language,HTML,,"인터넷 웹 페이지를 만들 때 사용하는 표준 마크업 언어.
제목(headings), 단락(paragraphs), 목록(lists), 링크(links) 등으로 텍스트의 구조적 의미를 나타내는 마크업 언어로, 구조화된 문서를 만든다. 또 하이퍼텍스트 기능을 이용하여 외부 웹 페이지나 파일 등 다른 리소스에 연결하는 방법을 제공한다. 일반적으로 약어 에이치티엠엘(HTML)로 사용한다.

HTML은 1989년 영국의 컴퓨터 과학자인 팀 버너스 리(Tim Berners-Lee)에 의해 고안되어 1991년 말에 최초로 공개되었다. HTML은 웹을 통한 정보 교환을 목적으로 탄생되었으며, 문법 체계가 비교적 간단하고 배우기 쉬워 빠르게 웹 표준으로 자리 잡았다. 문자뿐만 아니라 이미지, 오디오, 비디오 등을 포함하는 것이 가능하며, 사용자들은 웹 브라우저를 통해 HTML 문서를 볼 수 있다.
HTML 문서는 텍스트 에디터(예: 메모장)로 작성할 수 있다. 작성 후 파일 확장자를 ‘*.htm’이나 ‘*.html’로 저장하며, 웹 브라우저에서 파일을 로딩하여 볼 수 있다.
HTML 표준은 웹 표준화 단체인 월드와이드웹 컨소시엄(W3C: World Wide Web Consortium)과 왓더블유지(WHATWG: Web Hypertext Application Technology Working Group)를 중심으로 지속적으로 개발되고 있다. 2017년 12월 최신 버전인 HTML 5.2가 발표되었다.
※ WHATWG: 웹 발전을 위해 2004년에 모질라(Mozilla), 애플(Apple) 등 브라우저 개발 업체 주축으로 결성된 웹 HTML 응용 기술 작업 그룹. ‘왓더블유지’로 읽는다. 2014년에 국제표준으로 제정된 HTML5 표준은 WHATWG에서 시작되었다.

아래는 HTML 문서에 대한 간단한 예이다.

< !DOCTYPE html >
< html >
< head >
< meta charset=""utf-8"" >
< title>간단한 HTML 예제 < /title >
< /head >
< body >
< h1>메인 타이틀 < /h1 >
< p > HTML은 웹에서 사용하는 표준 마크업 언어이다 < /p >
< img src=""images/html-icon.png"" alt=""HTML 아이콘 이미지"" >
< /body >
< /html >"
확장성 마크업 언어,eXtensible Markup Language,XML,,"인간과 기계가 모두 이해할 수 있는 텍스트 형태로 마크업 포맷을 정의하기 위한 메타 언어.
인터넷 환경에 적합하도록 간결성, 보편성, 활용성에 중점을 두고 설계되었다. 유니코드(Unicode) 기반으로 다국어를 지원하고, 텍스트 형식의 데이터 포맷으로 플랫폼에 상관없이 다양한 시스템에서 활용 가능한 특징이 있다. 일반적으로 약어 엑스엠엘(XML)로 부른다.

XHTML, XML 스키마(Schema), RDF, RSS, EPUB, SMIL 등 다양한 표준 및 응용 프로그램에서 마크업 기반의 구조적 의미를 표현하기 위해 활용된다.
XML은 월드와이드웹 컨소시엄(W3C: World Wide Web Consortium)에서 1996년 웹상에서 구조화된 문서를 전송하기 위한 목적으로 제안되었고, 1998년 2월에 제정되었다.
W3C에서 XML 표준 개발을 리드했던 존 보삭(Jon Bosak)은 XML을 다음과 같이 설명하고 있다. “향후 XML은 웹 기술상에서 가장 핵심적인 진보를 가져올 것이며, 웹의 근본을 송두리째 바꿀 것이다. XML은 안전한 전자상거래 구축을 가능하게 하고, 새로운 분산 애플리케이션 시대를 이끌어 나갈 것이다. 또한 XML은 소프트웨어 개발자와 고객의 관계를 새롭게 변화시킬 것이다. 다시 말해서 XML은 어떤 플랫폼에서나 읽을 수 있는 포맷을 제공하기 때문에 특정 회사의 제품과 관련된 특정 환경에 얽매이지 않아도 된다.”"
확장성 하이퍼텍스트 마크업 언어,eXtensible HyperText Markup Language,XHTML,,"하이퍼텍스트 마크업 언어(HTML)를 확장성 마크업 언어(XML: Extensible Markup Language) 기반으로 재정의한 마크업 언어 표준.
HTML 문서와 달리 정확한 문법으로 작성되어 재사용이 용이하다. 일반적으로 약어 엑스에이치티엠엘(XHTML)로 부른다.

월드와이드 웹 컨소시엄(W3C: World Wide Web Consortium)은 메타 언어 표준인 표준 범용 마크업 언어(SGML: Standard Generalized Markup Language) 기반의 인터넷 환경에서 HTML 마크업에 대한 문법적인 규제를 강화하고 질적인 수준을 높이기 위해 HTML 표준을 XML 기반으로 재정의한 XHTML 표준을 개발하였다. 2000년 XHTML 1.0이 제정되었다.
기존 SGML 기반의 HTML 문법에서는 ' < h1 > HTML 정의’처럼 종료 태그 ' < /h1 > ’을 붙이지 않아도 브라우저에서 오류가 발생하지 않고 정상 동작된다. 그러나 재사용이 어려운 문제가 있다. 이를 보완한 XHTML에서는 종료 태그(end tag)를 생략하면 오류가 발생하여 동작이 되지 않는다.
HTML과 XHTML로 작성된 문서는 브라우저상에서 동일하게 보인다."
에크마스크립트,ECMAScript,,,"유럽 컴퓨터 제조업자 협회(ECMA)에서 제정된 자바스크립트(JavaScript) 언어 표준.
웹 페이지에서 사용자가 입력한 이벤트를 받아 동적 처리를 하는 데 사용된다.

1996년 미국 넷스케이프 커뮤니케이션즈사(Netscape Communications)는 자사의 웹 브라우저 넷스케이프를 지원하는 자바스크립트를 개발, 공개하였다. 이에 마이크로소프트사(Microsoft)는 익스플로러(Explorer)용 스크립트 언어인 제이스크립트(JScript)를 발표하였고, 이로 인해 상호호환성이 떨어지자 자바스크립트의 표준화가 추진되었다. 1996년 11월부터 ECMA(European Computer Manufacturers Association) 인터내셔널의 기술위원회 39(TC39)에서 표준화가 추진되었고, 1998년 10월 ECMAScript(ECMA-262)라는 이름으로 표준 기술이 공개되었다. ECMAscript는 한마디로 표준 자바스크립트라고 할 수 있다.
2015년부터 1년에 한 번씩 새로운 버전의 ECMAScript를 공개하고 있으며, 최신 표준은 2017년 6월에 제정된 ECMAScript 2017이다."
문서 객체 모델,Document Object Model,DOM,,"프로그램이나 스크립트가 웹 페이지 내의 구성 요소들에 접근하여 내용이나 스타일 등을 변경할 수 있게 해 주는 인터페이스.
특정 플랫폼이나 언어에 종속되지 않는다.

브라우저에서 HTML, XML 등의 웹 페이지가 로딩되면 문서 객체 모델(DOM)은 브라우저 내에 트리(tree) 형태로 문서 내 요소들을 구성한다. 이렇게 생성된 트리 구조의 각 요소들을 ‘노드(node)’라고 한다. HTML, CSS 등으로 구성된 웹 페이지의 DOM이 형성되면 개발자들은 자바스크립트(JavaScript), 파이선(python) 등 언어로 해당 트리 구조 내의 노드에 접근하여 노드의 속성 값을 변경하거나 추가, 삭제 등을 실행할 수 있다.
브라우저상에서는 사용자의 버튼 클릭과 같은 이벤트를 통해 DOM 트리 내의 특정 노드 속성이 변경된다. 예를 들어, 아래와 같이 텍스트 노드와 버튼 노드를 DOM에 형성하였을 경우, 버튼 클릭의 이벤트가 발생하면 change_name 함수가 실행되고 change_name 함수는 id가 name인 노드에 접근하여 ‘홍길동’이라는 이름을 원하는 다른 이름으로 바꿀 수 있다.

< div id=""name"" > 홍길동 < /div >
< button id=""change_name"" onclick=""change_name()"" >

DOM 표준은 1998년 W3C에서 처음 제정되었다. 최신 버전인 DOM 4는 2015년 11월 제정되었다. 
 "
종속 스타일 시트,Cascading Style Sheets,CSS,"종속형 시트, 종속 서식 파일","HTML, XML 등 마크업 언어로 작성된 웹 문서에서 레이아웃이나 구성 요소들의 스타일을 담당하는 언어.
웹 페이지의 개발과 수정을 용이하게 한다. 일반적으로 약어 시에스에스(CSS)로 사용한다.

HTML, XHTML 등의 문서에서 내용과 스타일을 분리할 수 있으며, 문서 내의 마크업 언어를 변경하지 않고도 해당 문서를 사용자의 환경이나 기기에 따라 다르게 보이도록 할 수 있다. 예를 들어, 웹 문서 내 반복되는 제목이나 목록이 있을 경우, 해당 부분을 일일이 지정하지 않고 CSS에서 일괄적으로 원하는 스타일을 적용할 수 있다. 일반적으로 CSS 문서와 HTML 문서를 별도로 구성하여 HTML 문서에서 CSS 문서를 링크하여 사용한다.
아래의 예제와 같이, CSS 문서에서 sector_a 영역의 위아래 여백 2cm, 좌우측 여백 1.5cm 값을 정의해 놓으면, HTML 문서의 sector_a 클래스로 지정된 영역은 모두 같은 여백 값으로 적용된다.

CSS 문서 ‘example_A.css’:
.sector_a { margin: 2 cm 1.5 cm; }

HTML 문서 ‘example_B.html’:
< link href=""example_A.css"" rel=""stylesheet"" type=""text/css"" >
< div class=""sector_a"" > 스타일이 적용되는 부분 < /div >

CSS는 1994년 하콤 비움 리(Håkon Wium Lie)가 처음 제안하였으며, 1996년 W3C에서 CSS 1 표준이 개발되었다. 1998년 CSS 2 버전 표준이 제정된 이후 발표된 모듈 형태의 CSS 3 버전 표준은 2005년부터 개발 중이다."
유전 알고리즘,Genetic Algorithm,GA,,"진화의 핵심 원리인 자연 선택과 유전자의 개념을 이용한 최적화 기법.
주어진 문제에 대한 해답(solution)을 무작위로 생성한 뒤 이 해답 집단을 진화시켜 좋은 해답을 찾는다.
유전 알고리즘은 집단 기반의 최적화 기법인 진화 알고리즘의 한 종류로, 집적 회로 설계, 리보핵산(RNA: Ribonucleic acid) 구조 예측, 인공 신경망 학습 등 매우 다양한 분야의 최적화 및 탐색(search) 문제에 적용되고 있다.

유전 알고리즘에서 문제의 해답(solution)은 고정된 길이의 문자열로 표현되며, 이는 다음 세대를 생성할 때 교차 및 돌연변이 과정의 적용을 용이하게 한다. 해답의 좋고 나쁨의 정도는 최적화 문제의 목적(objective) 함수에 의해 평가되는데, 이를 적합도(fitness) 함수라고 한다.
유전 알고리즘을 구성하는 주요 연산은 ‘선택(selection)’, ‘교차(crossover)’, ‘돌연변이(mutation)’이다. 선택은 현재 세대에서 다음 세대를 생성할 때 사용하는 해답들을 결정하는 연산으로, 적합도에 따라 확률적으로 결정된다. 교차는 두 해답을 결합해 새로운 해답을 만드는 과정으로, 생물의 염색체 교차를 모사한 것이다. 서로 다른 두 해답의 좋은 점을 모두 취하는 새로운 해답을 만들 수 있다. 돌연변이는 해답의 일부분을 무작위로 변형하는 것으로, 지역 최적 해답(local optimum solution)에 빠질 가능성을 줄여 준다.
유전 알고리즘은 1931년 시월 라이트(Sewall Wright)가 제안한 적합도 경관(fitness landscape)의 개념에 영향을 받았고, 1965년 잉고 레켄베르크(Ingo Rechenberg)가 비행기 익형(airfoil)의 최적화에 진화 전략을 적용하면서 유명해졌다.

* 지역 최적 해답(local optimal solution): 어떤 문제에 대한 최적의 해답이 존재하는 공간을 지형-혹은 경관(landscape)-에 비유할 때, 주위의 해답들 보다는 좋지만 가장 좋은 해답(전역 최적 해답, global optimal solution) 보다는 나쁜 해답."
6세대 컴퓨터,Sixth Generation Computer System,"6GCS, SGCS",,"인간 두뇌 능력과 가장 유사한 정보 처리 능력을 가진 지능형 컴퓨터.
인간처럼 논리적인 추론을 할 수 있는 인공 지능형의 5세대 컴퓨터를 뛰어 넘어, 인간과 유사한 지능 지수(IQ: Intelligence Quotient)를 가진다.
인공 신경망(ANN: Artificial Neural Network)과 인공 두뇌 (Artificial brain) 기술이 사용되어 스스로 생각하고 감정을 표현할 수 있다.
일부에서는 인공 신경망(ANN) 컴퓨터, 양자 컴퓨터(quantum computer) 등을 대표적인 6세대 컴퓨터로 본다."
파이선,Python,,,"다양한 플랫폼에서 사용이 가능한 객체 지향 기반 인터프리터 방식의 고급 프로그래밍 언어 중 하나.
문법이 배우기 쉽고 결과를 바로 확인할 수 있어서 프로그래밍 초보자에게 추천되는 언어이다.

1991년에 귀도 반 로섬(Guido van Rossum)이 발표하였고, 좋아하는 코미디 프로인 에서 파이선이라는 이름을 가져온 것으로 알려져 있다. 공동체 기반의 개방적 개발 모델을 가지고 있으며, 파이선 소프트웨어 재단(Python Software Foundation)에서 관리한다.
문법 구조가 간단, 명확하고, 많은 시스템 호출과 풍부한 라이브러리(모듈), 다양한 윈도우 시스템용 인터페이스 등을 포함하고 있어 생산성이 높은 강력한 언어이기도 하다. 반면 실행 속도가 상대적으로 느리다는 단점이 있다. 다른 프로그래밍 언어와의 호환성이 높아, 빠른 속도가 필요한 부분은 C, C++ 등의 언어로 개발하여 융합할 수 있다.

개발자 팀 피터스(Tim Peters)는 파이선의 철학으로 ‘추한 것보다는 아름다운 것이, 암시적인 것보다는 명확한 것이, 복잡한 것보다는 단순한 것이, 난해한 것보다는 복잡한 것이 낫고 가독성이 중요하다’ 등을 명시하였다(※The Zen of Python, 2004)."
술어 논리,Predicate logic,,"1차 논리, 1차 술어 논리, Predicate Calculus, First-order Logic, First-order Calculus, First-order Predicate Logic, First-order Predicate Calculus","객체 사이의 관계를 나타내는 논리 또는 형식 체계.
명제 논리의 모든 요소를 포함하고 보다 효율적인 지식 표현이 가능하다. 명제 논리와 마찬가지로 지식 표현 및 추론에 사용된다.

술어 논리에서 객체는 상수나 변수 혹은 함수로, 관계는 술어로 표현된다. 객체의 집합이 가지는 특성은 변수와 한정 기호(quantifier)로 표시된다. 하나의 술어로 구성되는 원자(atomic) 문장은 참 혹은 거짓 중 하나의 값을 가지고, 연산자로 연결되어 복합 문장을 구성한다.
다음은 술어 논리에서 지식 표현 예시이다.

변수: x
상수: Socrates
술어: Human(·), Mortal(·)

소크라테스는 사람이다: Human(Socrates)
모든 사람은 (언젠가) 죽는다: ∀Human(x) → Mortal(x)
소크라테스는 죽는다: Mortal(Socrates)

술어 논리의 기원은 고대 그리스의 아리스토텔레스까지 거슬러 올라간다. 19세기 말부터 20세기 초반까지 프리드리히 루트비히 고틀로프 프레게(Friedrich Ludwig Gottlob Frege), 버트런드 러셀(Bertrand A. W. Russell), 쿠르트 괴델(Kurt Goedel) 및 알프레트 타르스키(Alfred Tarski) 등에 의해 구체화되었다.
술어 논리는 기호 기반 인공 지능에서 사용하는 지식 표현 및 추론의 모체가 되었다. 그 대표적인 예로 존 로빈슨(John A. Robinson)이 1965년 제안한 해결법(resolution method) 및 이에 기반한 프로그래밍 언어인 프롤로그(PROLOG) 등을 들 수 있다. 프롤로그(PROLOG)는 IBM에서 개발한 인공 지능 기반 질의응답 시스템인 왓슨(Watson)의 자연어 처리에 활용되었다."
5세대 컴퓨터,Fifth Generation Computer System,"5GCS, FGCS",,"인공 지능(AI)형 컴퓨터.
전기 저항이 없는 초전도체의 초대규모 집적 회로, 병렬 처리 방식의 하드웨어, 인공 지능 소프트웨어를 사용하여 실현한다.
현재 기술로는 한정된 음성 인식과 인간의 추리를 모방할 수 있는 정도이지만, 향후 목표는 자연어 인식과 인간 지능 정도의 컴퓨팅 성능을 갖추는 것이다. 5세대 컴퓨터 실현은 진행중으로 앞으로 나노 기술과 양자 계산 기술의 발전으로 가능해질 전망이다.

일반적으로 컴퓨터 세대를 기술 발전에 따라, 진공관 기반의 메인프레임 컴퓨터를 1세대, 트랜지스터 기반의 메인프레임 컴퓨터를 2세대, 집적 회로(IC) 기반의 소형 컴퓨터를 3세대, 대규모 집적 회로(LSI)와 초대규모 집적 회로(VLSI)인 마이크로프로세서를 4세대 컴퓨터로 분류한다. 1세대부터 4세대까지는 폰노이만(von Neumann) 이론에 기초한 순차(직렬) 처리 기반 컴퓨터이다. 이에 반해, 5세대는 비 폰노이만(non von Neumann) 방식의 병렬 처리 기반의 컴퓨터이다.
1982년 일본의 국제무역산업성(Ministry of International Trade and Industry, 현 경제산업성)의 FGCS(Fifth Generation Computer Systems) 프로젝트에서 5세대 컴퓨터 용어를 사용하였다. FGCS 프로젝트는 논리 기반의 프로그래밍 언어인 프롤로그(PROLOG)를 사용하여 새롭게 데이터를 정의하고 접근하는 대규모 병렬 추론 시스템(PIM: Parallel Inference Machine) 개발을 목적으로 하였다. 그 결과로 PIM/m(256 프로세서), PIM/p(512 프로세서) 등의 시스템이 개발되었다."
의사 결정 지원 시스템,Decision Support System,DSS,Decision-making Support System,"사업체를 비롯한 조직의 의사 결정을 지원하는 컴퓨터 기반 정보 시스템.
대량의 데이터를 처리 및 분석하여 의사 결정에 필요한 지식을 추출하고 사용자에게 제공하는 역할을 한다. 제품 판매에 관한 자료 및 문서, 조직 구성원의 지식 등 다양한 형태의 정형/비정형 데이터를 다룬다. 병원의 진단, 은행의 신용 대출 가능성 판단, 기업의 엔지니어링 프로젝트 입찰 평가 등 다양한 분야에 활용된다.

의사 결정 지원 시스템(DSS)에 대한 연구는 주로 경영학 및 전산학 분야에서 이루어진다. 의사 결정 지원이라는 개념은 1950년대 후반에 시작된 카네기 공과대학(현 카네기 멜런 대학교)의 조직 의사 결정에 대한 연구에서 선구적으로 다루어졌고, 의사 결정 지원 시스템(DSS)이라는 용어는 마이클 스콧 모튼(Michael S. Morton)이 1964년 2월 하버드 경영대학에서 최초로 언급하였다. 1970년대부터 컴퓨터를 이용한 DSS 연구가 활발히 이루어졌고, 1990년대 이후에는 데이터 창고(Data Warehouse), 올랩(OLAP: Online Analytical Processing), 데이터 채굴(Data mining) 및 웹 기술 등이 DSS 연구 및 개발에 큰 영향을 주었다.
DSS는 기반 및 지원 형태에 따라 통신 기반, 데이터 기반, 문서 기반, 지식 기반, 모델 기반 시스템으로 분류될 수 있다. 지식 기반 DSS의 핵심은 인공 지능(AI)의 전문가 시스템(expert system) 혹은 추천 시스템(recommendation system)으로 간주된다."
데이터 창고,Data Warehouse,DW,"데이터 웨어하우스, 자료 창고","조직 내에서 분산 운영되는 각각의 데이터베이스 관리 시스템에 축적된 데이터들을 공통의 형식으로 변환하여 통합하고 조정·관리하는 데이터베이스 기술.
데이터(data)와 창고(warehouse)란 의미가 합성된 용어이다. 데이터 이외의 분석 방법도 포함하여 조직 내 의사 결정을 지원하는 정보 관리 시스템을 의미하기도 한다.

1980년대 중반 IBM은 자사 하드웨어를 판매할 목적으로 ‘정보 창고(information warehouse)’라는 용어를 처음 사용하였다. 이후 이 개념은 여러 업체들에 의해 이론적으로 성장하였고, 1980년대 후반 컴퓨터 과학자인 빌 인몬(Bill Inmon)이 기업 데이터 모델의 연구에서 데이터 창고(DW) 개념을 정의하면서 구체화되었다.
데이터 창고(DW)는 크게 관리 하드웨어, 관리 소프트웨어, 추출·변환·정렬 툴, 데이터베이스 마케팅 시스템, 메타데이터, 최종 사용자 접근과 활용 도구 등으로 구성된다. 원시 데이터 계층, 데이터 창고(DW) 계층, 클라이언트 계층으로 특화된 데이터뿐만이 아니라 기업 활동에 필요한 모든 정보를 전사 규모의 데이터베이스로 일원화하여 데이터 추출, 저장, 조회 등의 기능을 수행하기 때문에 대용량의 저장 공간이 필요하다. 이에 병렬 처리 컴퓨터가 주로 사용된다.
데이터 창고(DW)는 주제별 데이터 구성(subject-orientation), 시계열적(time-variancy) 데이터 축적, 일관된 형태로 데이터 통합(integration), 변경·삭제 등이 어려운 비휘발성(nonvolatilization) 저장 등의 특성이 있다. 기업의 분산된 대규모 정보 자산을 통합하여 효율적인 의사 결정을 지원하는 구조적 환경을 제공한다."
데이터 채굴,Data mining,,데이터 마이닝,"인공 지능 기법을 이용하여 대용량의 데이터에서 의미 있는 통계적 패턴이나 규칙, 관계를 찾아내 분석함으로써 유용하고 활용 가능한 정보를 추출하는 기술.

지하에 묻힌 광물을 찾아낸다는 뜻의 채굴(mining)을 데이터 분석의 용어로 사용하게 된 이유는 탄광에서 석탄을 캐거나 대륙붕에서 원유를 채굴하는 작업처럼 데이터에서 숨겨진 가치를 찾아낸다는 동일한 특징 때문이다.
학문적으로는 통계, 전산, 경영 등 다양한 데이터 분석 관련 학문의 융합으로 탄생한 융합 학문이며, 기술적으로는 대용량 데이터를 효율적으로 저장 및 관리하는 기법인 데이터베이스, 데이터 창고(DW: Data Warehouse), 데이터 마트(data mart) 등과, 방대한 규모의 데이터를 분석하는 분산 처리 기술 등이 사용된다. 분석 방법으로는 목표 변수에 따라 진행되는 정형 데이터 채굴 기법과 비정형 데이터 채굴 기법이 있다.
데이터 채굴은 데이터 처리를 위한 다양한 분야에 적용할 수 있으며, 마케팅, 생산, 금융, 미디어, 순수 과학 등 다양한 산업 분야에 활용할 수 있다.

※ 1) 데이터 창고(DW): 조직의 의사 결정 지원을 위해 방대한 데이터를 체계적으로 통합·관리하는 데이터베이스 기술
※ 2) 데이터 마트: 특정 사용자를 대상으로 하는 작은 규모의 데이터 창고(DW)"
군집 분석,Cluster analysis,,"군집화, Clustering","서로 유사한 정도에 따라 다수의 객체를 군집으로 나누는 작업 또는 이에 기반한 분석.
동일한 군집에 속하는 객체 간의 유사도가 그렇지 않은 객체 간의 유사도보다 평균적으로 높도록 군집을 구성한다. 대표적인 비지도 기계 학습(unsupervised machine learning) 방법으로, 데이터의 분할 및 요약에 널리 이용되며 데이터에서 유용한 지식을 추출하는 데 활용된다.

객체의 종류에 따라 다양한 유사도 기준이 적용된다. 대표적으로 유클리드 거리(Euclidean distance, 두 객체 사이의 직관적인 거리)와 코사인 유사도(두 객체 사이의 각도) 등이 있다.
데이터 군집 분석을 위한 다양한 방법과 알고리즘이 개발되어 있다. 최적의 군집 개수를 정하거나 군집 분석 결과의 정확도를 평가하는 객관적인 기준은 없으며, 배경 지식에 근거한, 사람의 주관적인 평가가 필요하다. 대표적인 군집 분석 방법으로 ‘계층적 군집화’와 ‘k-평균 군집화’를 들 수 있다. 계층적 군집화는 모든 객체가 하나의 군집에 포함되는 경우부터 객체 하나하나가 각각의 군집을 구성하는 경우까지 단계적으로 군집을 구성하는 방법이다. 상향식 방법과 하향식 방법이 있다. k-평균 군집화는 사용자가 군집의 개수 ‘k’를 미리 결정하는 방법으로, 초기화 상태에 따라 다양한 결과를 얻게 된다.
군집 분석은 마케팅 분야에서 고객 데이터를 활용하여 고객 군집을 구성한 뒤 각 군집별로 맞춤형 마케팅 전략을 고안하는 데 적용되고 있고, 생의학 분야에서는 유전자 군집을 분석하여 유전자의 기능을 예측하거나 암환자 군집을 분석하여 암의 새로운 아형(subtype)을 발견하는 데 활용되고 있다.
군집 분석은 1932년 헤럴드 드라이버(Harold E. Driver)와 앨프리드 크로버(Alfred L. Kroeber)가 처음 시도한 것으로 알려져 있다."
응용 프로그래밍 인터페이스,Application Programming Interface,API,응용 프로그램 인터페이스,"운영 체제, 프로그래밍 언어 등에 있는 라이브러리를 응용 프로그램 개발 시 이용할 수 있도록 규칙들을 정의해 놓은 인터페이스.

파일 관리, 화면 표시, 프로그램 간 통신 등과 같이 자주 사용되는 다양한 공통 기능들을 OS나 프로그래밍 언어 등에서 라이브러리(library) 형태로 제공하는데, API는 라이브러리를 이용하는 방법과 형식을 규정한다. 즉, 라이브러리는 기능을 구현한 함수들을 모아 놓은 것이고, API는 라이브러리를 이용할 수 있는 도구이다.
API를 이용하면 개발자는 동작되는 기능의 세부 사항을 알 필요 없어 개발 시간과 비용, 노력을 절감할 수 있다. 또한 OS 간 공통된 API 사용으로 다른 기종의 컴퓨터 사이에 응용 프로그램의 이식성(portability)이 확보된다."
추상화,Abstraction,,,"컴퓨터 과학 분야에서 주어진 문제나 시스템의 복잡도를 단순화하여 인식하기 쉽게 만드는 개념화 작업.
핵심 요소를 잘 파악하여 필요 이상으로 상세, 복잡한 요소들을 결합하거나 단순화하고, 속성의 일부분만으로 주어진 대상을 간결하고 명확하게 표현한다. 복잡도를 관리하는 핵심 기술이라고 할 수 있다.

방식에 따라 데이터 추상화(data abstraction)와 절차 추상화(procedural abstraction)로 나뉜다. 데이터 추상화는 하나의 데이터와 관련된 조작 및 표현 유형을 결합하는 방식이다. 예를 들어, 학번, 이름, 생일, 연락처, 주소, 성적 등 모든 항목을 언급하기보다 ‘학생’이라는 항목(개체)으로 결합하여 추상화한다. 절차 추상화는 세부적인 실행 절차를 단순화하는 방식이다. 예를 들어, 라면 조리를 설명할 때마다 가스레인지 켜기, 냄비에 물 넣기, 물 끓이기, 라면과 스프 넣기 등 세부 절차를 모두 언급하면 너무 복잡하다. 따라서 이를 ‘라면 조리’라고 추상화하여 간단하게 표현하는 것이다."
분기,branch,,,"기본적인 프로그램 실행 흐름을 다른 곳으로 변경하는 프로그램 명령.
컴퓨터 프로그램에서 순차적 제어 흐름을 조건에 따라 다른 흐름으로 변경하거나, 기계어 명령어 체계에서 지시된 주소로 명령 순서를 이동하는 것을 말한다.

컴퓨터 프로그램에서 분기는 ‘무조건 분기(unconditional branch)’와 ‘조건 분기(conditional branch)’로 분류된다. 무조건 분기는 조건에 상관없이 프로그램의 실행 흐름을 정해진 위치로 변경하는 것을 말하며, 대표적인 명령어로 goto 문이 있다. 조건 분기는 특정 조건이 충족되면 프로그램의 실행 흐름을 다른 곳으로 이동하는 것으로, 대표적인 예로 포트란(FORTRAN)과 베이직(BASIC)의 if, else 문 등이 있다.
마이크로프로세서가 인식하는 기계어 명령어 체계에서 무조건 분기에 해당하는 명령어로 jump(건너뛰기) 등이 있고, 조건 분기에 해당하는 명령어로는 beq(조건이 같은 경우, branch if equal), bne(조건이 같지 않은 경우, branch if not equal) 등이 있다."
엘티이,Long Term Evolution,LTE,,"3GPP 이동 통신 표준화 단체에서 직교 주파수 분할 다중 접속(OFDMA)과 다중 입력 다중 출력(MIMO) 기술 기반으로 제정한 표준. 3세대(3G) 이동 통신 기술보다 데이터 전송 효율, 서비스 품질 등의 성능이 향상되어 서비스 이용자에게 초당 최대 300 메가비트(Mbps)의 데이터 전송 속도를 제공한다.
3GPP에서 2008년 말에 LTE 표준을 제정하였다(3GPP Release 8). 한국은 2011년 7월 LTE 이동 통신 서비스를 상용화하였다.
LTE는 4G에 못미치는 이동 통신 기술이지만 마케팅 측면에서는 ‘4G LTE'로 사용한다.

광대역 부호 분할 다중 접속(W-CDMA: Wideband Code Division Multiple Access), 고속 패킷 접속(HSPA: High Speed Packet Access), CDMA2000 등이 주도하는 3세대(3G) 이동 통신보다 데이터 전송 효율, 주파수 자원 이용, 이동성, 지연 시간, 패킷 데이터 전송 기술, 서비스 품질 등의 성능이 크게 향상되었다. LTE를 4세대(4G) 이동 통신으로 보기도 하지만 IMT-Advanced 기술 요구 사항(예: 최고 데이터 속도 1Gbps)을 만족하지 못하여 3.9세대(3.9G) 또는 프리-4G(Pre-4G) 이동 통신이라고 한다. 하지만 일반적으로 이동 통신 시장에서는 마케팅 측면에서 4G LTE 용어로 많이 사용한다.

LTE는 다음과 같은 주요 기술적인 특징이 있다.
기존의 고속 패킷 접속(HSPA)이 음성 서비스는 회선 교환(circuit switching)을 사용하고 데이터 서비스는 패킷 교환(packet switching)을 사용한 데 반해 LTE는 음성과 데이터 모두 패킷 교환(packet switching)을 사용하여 서비스한다.
채널 대역폭(channel bandwidth)은 1.4 MHz부터 3, 5, 10, 15, 20 MHz로 다수 지원한다. 하향 링크 전송 속도는 최대 300 Mbps로 최대 채널 대역폭인 20 MHz와 변조 방식인 64 QAM, 공간 다중화(spatial multiplexing)인 4X4 다중 입력 다중 출력(MIMO: Multiple Input Multiple Output) 기술이 사용된다. 상향 링크 전송 속도는 최대 75 Mbps로 채널 대역폭 20 MHz, 64 QAM, 1x2 또는 1x4 단일 입력 다중 출력(SIMO: Single Input Multiple Output) 안테나 형상을 사용한다. ※ 상향 링크에서의 SU-MIMO(Single User MIMO)는 LTE 표준화 초기에는 고려되었으나 단말기 구현의 어려움을 고려하여 LTE-Advanced 표준부터 반영하였다.
다중 접속 방식은 하향 링크에서는 직교 주파수 분할 다중 접속(OFDMA: Orthogonal Frequency Division Multiple Access), 상향 링크에서는 단일 반송 주파수 분할 다중 접속(SC-FDMA: Single Carrier FDMA)을 사용한다. 인접한 셀 간의 간섭을 최소화하는 기술 ICIC(InterCell Interference Coordination)을 지원하고, 다중 대역 안테나(multiband antenna) 기술로 송신 및 수신 다이버시티(diversity), 빔 형성(beamforming), 공간 다중화(Spatial Multiplexing)를 지원한다. 또한, 통화 채널 전환(handoff) 시 CDMA나 W-CDMA와는 달리 소프트 핸드오프(soft handoff)는 지원하지 않고, 하드 핸드오프(hard handoff)만 지원한다.

한국은 2011년 7월 LTE 이동 통신 서비스를 상용화하였다(SK텔레콤과 LG유플러스).
3GPP는 LTE를 LTE-Advanced로 진화시켜 ITU-R로부터 2012년 1월에 4G 이동 통신 기술로 공식적으로 승인을 받았다."
밀리미터파,millimeter wave,mmWave,,"주파수가 30~300 기가헤르츠(㎓)이고, 파장이 1~10 밀리미터(mm)인 전파. 극고주파(EHF: Extremely High Frequency)를 파장으로 구분하여 부르는 명칭이다.
밀리미터파는 광대역 전송이 가능하여 위성 통신, 이동 통신, 무선 항행, 지구 탐사, 전파 천문 등 다양하게 사용된다.

밀리미터파 대역으로 광대역 전송과 안테나와 송수신 장치의 소형화를 할 수 있다. 반면 안테나의 개구 면적이 작아 단일 안테나 간의 전송에서 낮은 주파수 대역에 비해 상대적으로 경로 손실이 높다. 그리고 빛의 성질에 가까운 강한 직진성으로 고체 물질을 잘 통과하지 못하는 특성이 있으며 대기 손실과 강우 감쇠의 영향을 많이 받는다.

※ 밀리미터파의 높은 경로 손실과 직진성 등으로 인해 이동 통신 분야에서는 본격적으로 활용되지 않았으나 넓은 대역폭을 확보할 수 있다는 이점으로 인해 5세대 이동 통신(5G)의 초광대역 서비스에 사용될 후보 대역으로 선정되었다. 주로 100 GHz 이하의 대역을 5G 밀리미터파 대역으로 고려한다."
토큰,token,,,"①일련의 문자열을 구분할 수 있는 단위.
②시스템에서 보안 객체의 접근 관리에 사용되는 객체 또는 장치.
토큰은 크게 접근(access) 토큰, 보안(security) 토큰, 세션(session) 토큰 등으로 분류할 수 있다. 접근 토큰(access token)이 가장 많이 사용되는 토큰 형식으로 시스템이나 소프트웨어에서 어떤 특정한 기능이나 데이터에 접근하는 대상에게 권한을 부여하는 데 사용된다. 통상 난수 형태의 문자열로 구성된다. 예를 들어, 웹 서비스 제공자는 사용자의 아이디, 패스워드 또는 신용카드 등의 정보를 사용해 만든 접근 허가 토큰을 사용자에게 발행하고 접속 시 사용하게 하여 개인정보 누출을 방지하고 안전한 서비스를 제공할 수 있다. 보안 토큰(security token)은 하드웨어 저장 장치로 특정 전자기기의 제한된 자원(리소스)의 사용 권한을 제어한다. 예로 유에스비(USB) 보안 토큰이 있다. 세션 토큰(session token)은 통신망에서 서버와 클라이언트 간 세션(논리적 연결) 후 사용된다. 인터넷 서버가 하이퍼텍스트 전송 규약(HTTP: Hypertext Transfer Protocol)을 통해 클라이언트와 연결된 후 상호 간 데이터 교환을 위해 클라이언트에 부여하는 객체이다. 세션 식별자(Session ID)로 표현하기도 한다.③링 또는 버스 형태의 네트워크에서 장비 간 전송되는 신호의 순서.
④특정 블록체인 플랫폼에서 동작하는 응용 서비스에서만 사용하는 암호화폐.
일반적으로 블록체인 플랫폼은 거래 수수료, 채굴 인센티브 등을 위한 자체 지불 수단을 가진다. 이를 코인이라 부른다. 이와 같은 블록체인 시스템에서 동작하는 응용 서비스는 지속적으로 성장하고 안정적으로 유지될 수 있도록 네트워크 참여자들을 새롭게 확보해야 한다. 이 응용 서비스만을 위한 별도의 지불 수단을 토큰이라 한다. 따라서 이 토큰은 기존 코인보다 더 많은 수수료와 인센티브를 제공하여 네트워크 참여자들을 더 많이 유도할 수 있다. 다시 말해, 토큰은 인센티브 형태로 제공되는 지불 수단으로 특정 커뮤니티 내에서 디지털 화폐로 사용할 수도 있다. 이후에 충분한 응용 서비스 사용자가 확보되면 이 응용 서비스를 위해 독립된 블록체인 플랫폼으로 발전하게 된다.
따라서 토큰은 독립적인 블록체인 플랫폼으로 성장할 수 있을지를 시험하는 테스트넷(testnet)에서의 지불 수단이라 할 수 있다. 일반적으로 토큰에서 코인(coin)으로 발전하며 테스트넷에서 토큰을, 메인넷(mainnet)에서 코인을 지불 수단으로 사용한다. 대표적인 토큰으로 이오스(EOS), 트론(TRX), 비체인(VeChain) 등이 있다.

* 메인넷: 독립적으로 운영되는 블록체인 플랫폼.* 테스트넷: 메인넷에 종속된 임시 블록체인 플랫폼. 실제 블록체인 네트워크에 적용하기 전 기술 검증과 토큰 배포를 통해 고객을 확보하고 기업을 홍보하는 수단으로 사용한다."
웹 2.0,Web 2.0,,,"일방적 서비스 형태의 초기 웹과 비교하여 기술적인 진보보다는 웹 서비스의 사용성을 대폭 개선하여 누구나 웹에 쉽고 편리하게 참여 및 정보를 공유하고 협력할 수 있도록 진화한 웹 환경.
웹 2.0의 출현으로 산업 전 분야의 응용 및 서비스에서 웹이 표준적인 사용자 인터페이스로 빠르게 확대 적용되었다.

월드 와이드 웹(WWW: World Wide Web) 기술이 개발된 초기 웹 1.0은 신문이나 방송처럼 기업들이 웹 페이지에 제공하는 정보를 사용자가 단순히 보고 활용하는 일방적 형태의 서비스였지만, 웹 2.0은 블로그와 같은 웹 플랫폼에 사용자가 직접 정보를 만들어 공유하며 소비·협력할 수 있는 상호 작용(interaction) 환경을 제공한다. 웹 2.0 용어는 1999년 다시 디누치(Darcy DiNucci)가 ‘파편화된 미래(Fragmented Future, Print 매거진)’에 처음으로 소개하였고, 2004년 말 오라일리 미디어(O'Reilly Media) 웹 2.0(Web 2.0) 컨퍼런스를 계기로 업계에 빠르게 확산되었다. 웹 1.0과 웹 2.0 시대를 명확하게 구분하기 어려우나 1990년부터 1998년까지를 웹 1.0, 1999년 이후부터 현재까지를 웹 2.0으로 보는 견해가 있다.
기술적인 관점에서 웹 2.0은 주로 리치 인터넷 애플리케이션(RIA), 블로그에서 주로 사용되던 초간편 배급(RSS), 트랙백(Trackback, 댓글자국), 에이잭스(AJAX: Asynchronous JavaScript and XML) 등의 기술을 활용한다. 특히 에이잭스는 브라우저와 서버 간 비동기 통신 방법을 지원하여 구글 지도(Google Maps)와 같은 인터넷 서비스에서 사용자 경험을 크게 개선시키는 핵심적인 기능으로 활용되었다. 대표적인 예로 네이버(Naver)/다음(Daum) 블로그, 위키백과(Wikipedia), 유튜브(YouTube), 트위터(twitter), 페이스북(Facebook) 등이 있다.
웹 2.0 이후 진화된 차세대 웹을 웹 3.0이라 하기도 하지만 아직 정의나 기술에 대해 명확한 정의가 없다. 일부에서는 웹 사용자에게 모든 것을 맞추는 인공 지능형의 웹 환경을 웹 3.0으로 보고 시맨틱 웹(semantic web)을 웹 3.0 핵심 기술로 혼동하여 사용하고 있다. 국제 웹 표준화 기구 월드 와이드 웹 컨소시엄(W3C: World Wide Web Consortium)은 웹 3.0 용어를 사용하고 있지 않으며, 웹 기반의 증강 현실, 가상 현실, 사물 인터넷, 커넥티드 카, 블록체인 등을 차세대 웹 기술로 논의 중이다."
확장성 마크업 스키마 정의 언어,XML Schema Definition language,XSD,XML 스키마 정의,"확장성 마크업 언어(XML) 기반으로 문서 구조와 각 구성 요소의 마크업을 원하는 대로 정의할 수 있어 데이터 검증과 재사용이 용이한 스키마 언어.
기존 XML 문서형 정의(DTD: Document Type Definition) 언어의 단점을 보완한 스키마 언어로 국제 웹 표준화 단체인 월드 와이드 웹 컨소시엄(W3C: World Wide Web Consortium)에서 개발하였다.

기존 XML 문서 구조(structure)를 정의할 때 사용된 XML DTD(XML Document Type Definition)는 XML 문법과 다르기 때문에 DTD 문법에 대한 별도의 지식이 필요하고 텍스트 형태의 데이터 유형(data type)만을 사용해야 한다는 제한이 있다. 또한 예를 들어, 나이 속성값으로 숫자가 들어가야 맞는데 ‘< age > abc < /age >’와 같이 문자열이 잘못 입력된 경우나 ‘< age > 0 < /age >’과 같이 최소 또는 최대 값 범위를 벗어난 경우, 그리고 카드 번호 정보와 같이 정해진 규칙에 맞도록 값을 입력해야 하는 경우 등에 대한 데이터 유효성 검증이 어렵고, 새로운 데이터 타입을 추가로 정의하고 재사용하기도 어려운 단점이 있다. 이러한 단점을 보완하기 위하여 W3C에서 공표한 스키마 언어가 XSD이다.
XSD는 XML 문법을 기반으로 하고 있어서 재사용과 확장이 쉽고, 문자열(string), 정수(integer), 날짜(Date) 유형 등뿐만 아니라 새로운 데이터 유형 정의를 제공한다. 이에 개발자는 원하는 문서 구조와 마크업을 보다 쉽게 정의하고 다양하게 활용할 수 있다.
W3C는 2001년 처음 XSD 1.0 표준을 제정하였다. 이후 여러 오류를 수정한 두 번째 버전 XSD 1.0을 2004년에 공개하였고, XSD 1.1 표준을 2012년 4월에 제정하였다.

※ XML 스키마: XML 객체의 속성과 요소 간 상호 관계의 추상적 표현"
액티브엑스,ActiveX,,액티브X,"마이크로소프트 윈도우(Microsoft Windows) 환경에서 응용 프로그램이나 웹 브라우저가 인터넷을 통해 추가 기능을 다운로드 및 실행할 수 있도록 지원하는 소프트웨어 프레임워크.
대표적인 예로 공인인증서가 있다.
마이크로소프트사에서 1996년 응용 프로그램과 웹 페이지 개발에 재사용할 수 있는 소프트웨어 컴포넌트를 정의하기 위해 만들었다.

1996년 출시된 인터넷 익스플로러(Internet Explorer) 브라우저 3.0 버전부터 HTML 콘텐츠 내에 액티브엑스(ActiveX) 기능을 지원하였다.
액티브엑스는 일반적인 윈도우 응용 프로그램 형태로 개발하여 웹 브라우저 내에서 실행하는 방식으로 웹 브라우저의 기본 기능 외에 원하는 기능을 제한 없이 구현하여 웹 페이지에서 활용할 수 있다는 장점이 있다. 대표적인 예로 은행을 포함한 금융권 서비스나 결제 서비스 등에서 활용되고 있는 공인인증서이다.
액티브엑스는 인터넷 익스플로러 브라우저상에서 실행되지만 브라우저와는 별개의 독립적인 응용 프로그램이기 때문에 보안상의 잠재적 위험이 있어 사용 시 많은 주의를 필요로 한다. 또한 비표준 기술로 크롬(chrome), 사파리(Safari), 파이어폭스(Firefox) 등 타사 웹 브라우저에서 지원하지 않는다. 안드로이드, 아이폰(iOS) 등 모든 모바일 환경에서도 액티브엑스를 지원하지 않아 스마트폰에서 사용할 수 없다. 이러한 보안상 위험, 호환성 문제 등으로 액티브엑스 퇴출 논란이 야기되고 있다.
현재 윈도우 10(Windows 10) 환경에서 인터넷 익스플로러 11은 액티브엑스를 지원하지만 최신 마이크로소프트 에지(Microsoft Edge) 브라우저는 지원하지 않는다."
인공 신경망,Artificial Neural Network,ANN,신경망(Neural Network),"사람 또는 동물 두뇌의 신경망에 착안하여 구현된 컴퓨팅 시스템의 총칭.
기계 학습(machine learning)의 세부 방법론 중 하나로, 신경 세포인 뉴런(neuron)이 여러 개 연결된 망의 형태이다. 구조 및 기능에 따라 여러 종류로 구분되며, 가장 일반적인 인공 신경망은 한 개의 입력층과 출력층 사이에 다수의 은닉층(hidden layer)이 있는 다층 퍼셉트론(multi-layer perceptron)이다.

인공 신경망은 하드웨어로 구현될 수도 있으나, 주로 컴퓨터 소프트웨어로 구현된다. 인공 신경망은 기초 컴퓨팅 단위인 뉴런 여러 개가 가중된 링크(weighted link)로 연결된 형태이다. 가중된 링크(weighted link)는 주어진 환경에 적응할 수 있도록 가중치를 조정할 수 있다.
인공 신경망은 자기 조직화 지도(SOM: Self-Organizing Map), 순환 신경망(RNN: Recurrent Neural Network), 콘볼루션 신경망(CNN: Convolutional Neural Network)과 같은 다양한 모델에 대한 총칭으로, 그 종류는 수십 가지에 이른다.

최초의 인공 신경망 모델은 1943년 워렌 맥컬로치(Warren McCulloch)와 월터 피츠(Walter Pitts)에 의해 제안되었으며, 1958년 프랑크 로젠블라트(Frank Rosenblatt)는 지도 학습(supervised learning)이 가능한 퍼셉트론(perceptron) 모델을 개발하였다. 당시 컴퓨터의 낮은 성능과 단층 퍼셉트론(single-layer perceptron)의 한계 등으로 인해 쇠퇴했던 인공 신경망에 대한 연구는 1970년대 군집 분석을 위한 자기 조직화 지도 등의 모델이 연구되며 그 명맥을 이었고, 1986년 다층 퍼셉트론(multi-layer perceptron)의 지도 학습을 위한 역전파 알고리즘(backpropagation algorithm)이 재발견되며, 다시 활성화되었다.
2010년대에는 컴퓨터 하드웨어 및 학습 알고리즘의 발달로 수십 개의 은닉층(hidden layer)이 있는 심층 신경망(DNN: Deep Neural Network)이 널리 사용되게 되었다. 바둑을 비롯해 이미지 및 자연어 처리, 음성 인식 등의 분야에서 기존의 기계 학습 방법의 성능을 뛰어 넘는 결과를 보이고 있다."
백홀,Backhaul,,,"다수의 통신망을 통해 데이터를 전송하는 계층적 구조로 된 통신망에서 주변부 망(edge network)을 기간 망(backbone network)이나 인터넷에 연결시키는 링크.

백홀은 물리적으로 광케이블, 구리선, 무선 등으로 연결된다. 무선(wireless)을 사용하는 백홀인 경우, 음성 트래픽 위주 서비스에서는 T1/E1 급의 백홀 링크가 사용되었으나 멀티미디어와 같은 수백 Mbps 이상을 전송하는 무선망에서는 마이크로파(microwave) 또는 그보다 높은 주파수 대역의 밀리미터파(millimeter wave)를 활용하여 백홀 연결을 제공한다."
웹 기반 그래픽스 라이브러리,Web-based Graphics Library,WebGL,웹지엘,"웹의 삼차원(3D) 컴퓨터 그래픽스 표현 기능을 제공하는 내장형 자바스크립트 라이브러리.
구글 크롬(Google Chrome), 애플 사파리(Apple Safari), 모질라 파이어폭스(Mozilla Firefox) 등 모든 웹 브라우저 환경에서 사용될 수 있고 저작권이 없는 웹 표준이다. 약어 ‘웹지엘(WebGL)'로 주로 사용하며 크로노스 그룹(Khronos Group)에서 WebGL 표준을 관리한다.

WebGL은 3D 컴퓨터 그래픽스 응용 프로그래밍 인터페이스(API: Application Programming Interface)인 '임베디드 시스템용 오픈지엘(OpenGLES:OpenGL for Embedded Systems)'의 주요 기능을 웹 브라우저에 내장하고 일대일로 제어할 수 있는 API를 자바스크립트(JavaScript) 라이브러리 표준으로 구성한 것이다.
웹 문서 내에서 WebGL로 그래픽스를 구성하기 위해
<canvas>
태그를 반드시 사용하고, WebGL 함수를 이용해
<canvas>
객체 이미지를 제어한다.

※ 예제
<body onload=""start()"">

<canvas id=""canvas01"" width=""640"" height=""480"">

</canvas>

</body>


※ 크로노스 그룹(Khronos Group): 컴퓨터 그래픽스와 미디어 관련 오픈 응용 프로그래밍 인터페이스(open API)의 표준화를 수행하는 비영리 국제 단체"
자원 기술 프레임워크 속성,Resource Description Framework in attributes,RDFa,,"HTML, XHTML, XML 기반의 웹 문서에서 태그가 감싸고 있는 데이터의 의미 정보를 추가로 나타내기 위해 태그 내 속성을 확장한 웹 표준.
국제 웹 표준화 기구인 월드 와이드 웹 컨소시엄(W3C: World Wide Web Consortium)에서 제정하였다.

기존 웹 문서에서는 특정 태그 안에 삽입된 데이터가 어떤 뜻을 담고 있는지를 표현할 방법이 없어, 검색 엔진이 수많은 웹 페이지들을 검색해도 해당 페이지들을 효과적으로 색인하여 보관할 수도 없었고, 다른 서비스 간에도 효율적인 정보 교환이 불가능했다.
RDFa 표준은 태그 안에 프로퍼티(property), 타입오브(typeof), 렐(rel) 등의 속성을 추가하여 태그가 지칭하는 데이터 의미, 형태, 관계 등을 파악할 수 있게 한다. 아래 예제는 RDFa 속성을 사용한 예로, 문단 < p > 태그 안에 스팬 < span property > 태그를 사용하여 존(John D)의 별명 닉(nick)을 추가하고 하이퍼링크 < a > 태그 내 관계 < rel >을 사용하여 관심 대상의 정보를 표현한다.

[기존 웹페이지]
< h1 > John's Home Page < / h1 >
< p > My name is John D and I am studying < ahref= ""http://www.tta.or.kr/"" > ICT standards < /a >.
< /p >
▷[RDFa 를 추가한 웹페이지]
< h1 > John's Home Page < /h1 >
< p > My name is < span property=""foaf:nick"" > John D < /span > and I am studying < a href=""http://www.tta.or.kr/"" rel=""foaf:interest"" xml:lang=""kor"" > ICT standards < /a >.
< /p >

이와 같이 데이터에 지정된 속성을 통해 해당 데이터가 어떤 뜻을 갖는지를 확인할 수 있다. 따라서 수많은 웹 페이지를 속성에 따라 효율적으로 색인할 수 있고 서로 다른 서비스 간에도 데이터 연동을 할 수 있다."
운반파 묶음,Carrier Aggregation,CA,"반송파 묶음, 반송파 집성, 주파수 집성",참고사항 : '반송파' 및 '집성'은 일본식 표현으로 '운반파 묶음'으로 순화(2018.7.27)
진화된 패킷 시스템,Evolved Packet System,EPS,,"엘티이(LTE) 이동 통신에서 무선 접속망과 핵심망을 합한 전체 시스템. 국제 표준화 단체 3GPP에서 정의한 공식 명칭이다.
EPS는 LTE 서비스와 CDMA2000, 와이맥스(WiMAX) 등 이종망과의 호환성 등을 제공한다.

일반적으로 하나의 이동 통신 서비스 사업자가 제공하는 이동 통신망은 무선 접속 망(RAN: Radio Access Network)과 핵심망(CN: Core Network)으로 구성된다. 핵심망의 인터넷 연결로 사용자는 인터넷의 다양한 서비스와 콘텐츠를 단말에서 사용할 수 있다.
3GPP는 LTE 이동 통신 시스템 EPS(Evolved Packet System)를 구성하는 무선 접속망과 핵심망 이름을 각각 E-UTRAN(Evolved UTRAN)과 EPC(Evolved Packet Cor)로 정하였다.


☞ LTE 서비스 전송 경로(EPS) 설정 절차
 "
엘티이 어드밴스트,Long Term Evolution-Advanced,LTE?Advanced,,"3GPP 이동 통신 표준화 단체에서 제정한 4세대 이동 통신 표준.
엘티이(LTE) 이동 통신 기술의 데이터 전송 속도, 주파수 이용 효율, 전송 지연 시간, 서비스 품질 등의 성능을 대폭 개선하여 서비스 이용자에게 최대 초당 3 기가비트(Gbps) 전송 속도를 제공한다.

2011년 처음 제정된 3GPP 릴리즈(Release) 10 표준은 2012년 국제 전기 통신 연합 전파 통신국(ITU-R: International Telecommunication Union Radiocommunication)의 아이엠티 어드밴스트(IMT-Advanced) 요구 사항을 만족하는 표준으로 인정받아 4세대(4G) 이동 통신 국제 표준으로 채택되었다.
3GPP는 릴리즈 10 표준에 LTE-Advanced 초기 기술을 포함하고, 릴리즈 11과 릴리즈 12에 LTE-Advanced의 다양한 기술을 추가하였다.

LTE-Advanced는 다음과 같은 주요 기술적인 특징이 있다.
하향 링크 1 Gbps, 상향 링크 500 Mbps의 최대 전송 속도를 목표로 표준화를 추진하였으나, 실제 완성된 표준은 최대 채널 대역폭인 100 MHz를 사용하는 경우 하향 링크 3 Gbps(8x8 MIMO 사용), 상향 링크 1.5 Gbps(4x4 MIMO 사용)를 지원한다.
LTE-Advanced 표준은 최고 전송 속도를 향상시키기 위해서 채널 대역폭을 증가시키는 것이 중요하므로 운반파 묶음(CA: Carrier Aggregation) 기술을 사용한다. 동일 주파수 대역 사용 여부에 따라 대역 내 운반파 묶음(intraband CA)과 대역 간 운반파 묶음(interband CA), 인접 대역 사용 여부에 따라 각각 인접 운반파 묶음(Contiguous CA)과 비인접 운반파 묶음(Non-contiguous CA)으로 분류된다. 또한, 매크로 셀(macro cell)과 스몰 셀(small cell)이 공존하는 이종망(HetNet: Heterogeneous Network) 환경에서 셀 간 간섭 조정(ICIC: Inter Cell Interference Coordination)을 수행하기 위해 향상된 인접 셀 간 간섭 조정(eICIC: enhanced ICIC), 셀 가장자리(edge)에서의 전송 품질을 향상시키기 위한 다지점 협력 전송(CoMP: Coordinated Multi-Point Transmission and Reception), 중계(Relay) 기술 등이 LTE-Advanced에 포함되었다.

한국은 2013년 LTE-Advanced 이동 통신 서비스를 상용화하였다.
3GPP는 LTE와 LTE-Advanced 기반으로 하는 재난 안전, 사물 통신 등 다양한 응용 분야를 위한 기술 표준도 개발하고 있다. 
 일반 마케팅 명칭
3GPP 명칭
ITU-R 명칭
4G
LTE-Advanced
IMT-Advanced
4G LTE
LTE
  3G
WCDMA
IMT-2000
 "
튜링 시험,Turing test,,,"컴퓨터가 지능이 있는지를 판별할 수 있는 시험.
조사관이 블라인드 상태에서 컴퓨터와 글로 대화를 나눈 후, 대화 상대가 사람인지 컴퓨터인지 판단할 수 없게 되면 컴퓨터는 지능이 있는 것으로 튜링 시험에 합격 판정을 받는다.

앨런 튜링(Alan Turing)이 1950년 컴퓨터 지능의 운영 정의(operational definition)를 위해 튜링 시험을 고안하여 논문에서 제안하였다(※논문: Turing, A.M., Computing machinery and intelligence, Mind, 59(236):433-460, 1950).
튜링은 컴퓨터가 사람처럼 신체 동작하는 것은 지능과 관련이 없다는 전제하에, 사람이 사용하는 언어, 즉 자연어를 이용한 시험을 택하였다. 최초의 튜링 시험에서는 사람인 조사관이 블라인드 상태에서 컴퓨터와 5분간 채팅하여 상대가 컴퓨터인지 사람인지 판단한다. 여러 조사관들 중 상대가 사람일 것이라고 판단하는 조사관이 30% 이상이면 컴퓨터는 튜링 시험 합격이다. 기본 과정에 영상과 작은 연결 통로로 물건을 주고받는 동작 시험을 포함시킨 전체 튜링 시험(total Turing test)도 있다.
튜링은 시험을 통과하는 컴퓨터가 2000년이 되기 전에 개발될 것이라고 예상하였으나 아직 튜링 시험을 완전히 통과한 컴퓨터는 개발되지 못하였다. 튜링 시험이 제안된 이래 컴퓨터가 실제로 지능을 가질 수 있는지에 대해서는 다양한 논란이 있다.

※1) 앨런 튜링(Alan Mathison Turing): 영국의 수학자, 논리학자, 암호학자 및 전산학자(1912~1954). 전산학 분야의 선구적 인물 중 하나로 컴퓨터의 이론적 모델인 튜링 기계(Turing machine)를 제안하였다. 제2차 세계 대전에서 사용된 독일군 암호 체계인 에니그마(Enigma)를 해독하는 데 큰 공을 세웠으며, 초창기 프로그램 내장식 컴퓨터(stored-program computer) 개발, 튜링 시험 제안 등 전산학 분야뿐 아니라 수리 생물학(mathematical biology)을 포함한 다양한 분야에서 큰 업적을 남겼다. 전산학 분야에서 가장 권위 있는 튜링상(Turing award)은 이 사람의 이름을 딴 것이다.
※2) 운영 정의(operational definition): 특정 개념을 정의하기 위해 그 개념을 반영하는 무언가를 측정하는 절차"
심층 기계 학습,Deep learning,,딥 러닝,"일반적인 기계 학습 모델보다 더 깊은 신경망 계층 구조를 이용하는 기계 학습.
주로 여러 개의 은닉층(hidden layer)으로 구성된 인공 신경망을 활용한다. 은닉층 수가 많아질수록 ‘깊다(deep)’라고 표현하며, 깊은 계층 구조는 얕은 구조에 비해 복잡한 함수를 효율적으로 표현할 수 있다. 심층 기계 학습(deep learning)은 문제를 해결하기 위해 스스로 필요한 특징을 찾아 적절하게 표현(feature representation)하는 학습 능력이 뛰어나, 사진에서의 개체 인식, 기계 번역, 바둑 등의 분야에서 기존의 기계 학습 모델을 뛰어 넘는 성능을 보이고 있다.

대부분의 기계 학습 모델은 세 개 이하의 계층 구조로 되어 있는 반면, 심층 기계 학습 모델은 더 많은(깊은) 계층 구조로 되어 있다. 이러한 구조는 동물의 시각 피질(visual cortex)을 모사한 것이다.
다양한 심층 기계 학습 모델이 존재하나 인공 신경망의 한 종류인 심층 신경망(DNN: Deep Neural Network)이 널리 활용되고 있다. 심층 신경망 중에서도 콘볼루션 신경망(CNN: Convolutional Neural Network), 심층 순환 신경망(deep recurrent neural network), 심층 오토인코더(deep autoencoder) 등이 대표적으로 활용된다.
심층 기계 학습은 1980년대 인공 신경망의 연구가 다시 활성화되면서 시도되었으나, 1990년대에 제안된 심층 콘볼루션 신경망을 제외하고는 성공을 거두지 못하였다. 2006년 제프리 힌튼(Geoffrey Hinton)은 심층 신념망(deep belief network)의 학습 알고리즘을 제안하였으며, 이후 컴퓨터 하드웨어의 발달, 효율적인 학습 방법의 개발, 빅 데이터를 바탕으로 다양한 심층 기계 학습 모델들이 개발·사용되고 있다.
현재 심층 기계 학습은 컴퓨터 비전 및 패턴 인식, 자연어 처리를 비롯한 다양한 분야에서 기존의 기계 학습 모델에 비해 혁신적으로 성능이 개선되었다."
아이엠티 어드밴스트,International Mobile Telecommunications-Advanced,IMT-Advanced,4세대 이동 통신,"국제 전기 통신 연합의 전파 통신국(ITU-R)에서 제정한 4세대 이동 통신 표준.
이용자에게 이동 중 초당 100 메가비트(Mbps), 정지 중 초당 1 기가비트(Gbps)의 최고 데이터 전송 속도를 서비스하는 것을 목표로 한다.
일반적으로 이동 통신 시장에서 마케팅용으로 3G, 4G란 용어를 사용하지만, ITU에서는 세대 구분 용어를 사용하지 않고 IMT-2000, IMT-Advanced의 용어를 사용한다.

ITU-R M.2134 표준은 IMT-Advanced의 주요 기술 성능인, 셀 스펙트럼 효율(cell spectral efficiency), 최대 스펙트럼 효율(peak spectral efficiency), 셀 가장자리 사용자 주파수 효율(cell edge user spectral efficiency), 채널 대역폭, 지연 시간(latency), 이동성(mobility) 지원, 핸드오버(handover), 인터넷 전화(VoIP) 용량 등의 기준을 규정하고 있다(※ ITU-R M.2134 Requirements related to technical performance for IMT-Advanced radio interface(s), 2008).

IMT-Advanced 기술로 공인된 표준으로는 이동 통신 국제 표준화 단체인 3GPP에서 표준화한 엘티이 어드밴스트(LTE-Advanced)와 국제 전기 전자 학회(IEEE)에서 표준화한 와이브로(WiBro, 또는 mobile WiMAX) 진화 기술인 와이어리스맨 어드밴스트(Wireless MAN-Advanced)의 두 가지가 있다. 하지만, 전 세계적으로 실제 이동 통신망에 상용화된 것은 LTE-Advanced가 유일하다.  
  일반 마케팅 명칭
3GPP 명칭
ITU-R 명칭
4G
LTE-Advanced
IMT-Advanced
4G LTE
LTE
  3G
WCDMA
IMT-2000
 "
아이엠티 2020,International Mobile Telecommunications-2020,IMT-2020,5세대 이동통신,"국제 전기 통신 연합의 전파 통신국(ITU-R)에서 제정한 5세대 이동 통신 표준.
IMT-2020 표준은 주요 서비스로 이용자에게 초당 최고 20 기가비트(Gbps)의 데이터 전송 속도를 제공할 것을 규정한다.
2015년 ITU-R 전파통신총회(RA-15)에서 2020년경 상용화를 목표로 하여 IMT-2020을 공식 용어로 채택하였다. 일반적으로 이동 통신 시장에서 마케팅용으로 5G란 용어를 많이 사용한다.

ITU-R 표준은 IMT-2020 핵심 기술의 성능 요구 사항으로 다음과 같이 8가지를 선정하였다. 최고 전송 속도(peak data rate) 20 Gbps, 사용자 체감 전송 속도(user experienced data rate) 100 Mbps, 주파수 효율(spectrum efficiency)은 기존 IMT-Advanced 대비 3배, 이동 속도(Mobility) 500 km/h, 전송 지연 시간(latency) 1ms, 1 평방킬로미터(1km2)당 단말 연결 밀도(connection density) 100만 개, 네트워크 에너지 효율(network energy efficiency)은 IMT-Advanced 대비 100배, 1 평방미터(1m2)당 트래픽 용량(area traffic capacity)은 10 Mbps 이다.

IMT-2020 기반의 다양한 응용 서비스를 크게 세 개의 사용 시나리오로 분류한다. 좀 더 빠른 속도의 데이터 전송 서비스를 제공하는 초광대역 이동 통신(eMBB: enhanced Mobile BroadBand), 데이터 오류와 지연이 거의 없는 초고신뢰 저지연 통신(URLLC: Ultra-Reliable and Low Latency Communications), 그리고 단위 면적당 대량의 기기를 연결하는 대규모 사물 통신(mMTC: massive Machine Type Communications)이다. 사용 시나리오에 따라 IMT-2020의 기술 성능 요구 사항은 달라진다.
※ ITU-R 표준: Rec. ITU-R M.2083-0"
엔알,New Radio,NR,,"5세대(5G) 이동 통신에서 단말과 기지국 사이의 무선 접속(Radio Access 또는 무선 인터페이스) 기술.
이동 통신 국제 표준화 단체 3GPP에서 만든 공식 명칭이다.

2016년 12월 비엔나에서 개최된 3GPP 제74차 기술 총회(TSG: Technical Specification Group)는 5G 무선 접속 기술의 이름으로 엔알(NR: New Radio)을 채택하였다.
LTE 계열(LTE, LTE-Advanced, LTE-Advanced Pro)의 무선 접속 기술 이름은 '진화된 범용 지상 무선 접속 기술(E-UTRA: evolved UMTS Terrestrial Radio Access)'이다.

5G NR은 기본적인 파형(waveform)으로 기존 LTE의 E-UTRA와 같이 직교 주파수 분할 다중화(OFDM: Orthogonal Frequency Division Multiplexing) 방식을 계속하여 사용한다는 점에서 매우 중요한 의미를 가진다. 또한, E-UTRA에서 사용되었던 다양한 무선 통신 기술들 대부분이 NR에서도 동일하거나 좀 더 개선된 형태로 사용된다.

3GPP는 IMT-2020 핵심 기술의 성능 요구 사항과 세 가지 사용 시나리오인 초광대역 이동 통신(eMBB: enhanced Mobile Broadband), 종단 간 데이터 전송에 대한 초신뢰 및 저지연 통신(URLLC: Ultra Reliable and Low Latency Communications), 대규모 사물 통신(mMTC: massive Machine Type Communications)을 하나로 통합하여 무선 접속 기술을 제공하는 것을 목표로 하여NR 표준을 제정하고 있다. 이 표준에는 기존의 E-UTRA에 적용되지 않았던 새로운 무선 통신 기술들과 다양한 주파수 대역이 NR에 추가 적용되고 있다.
3GPP는 2020년경 ITU-R에 표준 기술로 최종 승인을 받을 목표로 ITU의 IMT-2020 표준의 요구 사항을 만족할 수 있는 NR 기반의 5G 이동 통신 표준을 제정하고 있다. NR은 3GPP 표준 릴리즈 15와 16에 포함되어 표준화가 진행 중이다."
기계 학습,Machine Learning,ML,머신 러닝,"컴퓨터 프로그램이 데이터와 처리 경험을 이용한 학습을 통해 정보 처리 능력을 향상시키는 것 또는 이와 관련된 연구 분야.
기계 학습은 자율 주행 자동차, 필기체 문자 인식 등과 같이 알고리즘 개발이 어려운 문제의 해결에 유용하다.

대부분의 기계 학습은 다수의 파라미터로 구성된 모델을 이용하며, 주어진 데이터로 파라미터를 최적화하는 것을 학습이라고 한다. 기계 학습은 학습 문제의 형태에 따라 지도 학습(supervised learning), 비지도 학습(unsupervised learning) 및 강화 학습(reinforcement learning)으로 구분한다.
지도 학습(supervised learning)은 입력과 출력 사이의 매핑을 학습하는 것이며, 입력과 출력 쌍이 데이터로 주어지는 경우에 적용한다. 예를 들어 컴퓨터가 주차장 입구에서 자동차 번호판을 인식할 때 번호판이 오염된 경우 제대로 인식하지 못할 수 있다. 이 경우 다양하게 오염된 번호판 사례와 정상 번호판을 각각 입력과 출력 쌍으로 학습시켜 번호판 인식률을 높일 수 있다.
비지도 학습(unsupervised learning)은 입력만 있고 출력은 없는 경우에 적용하며, 입력 사이의 규칙성 등을 찾아내는 게 목표이다. 비지도 학습 결과는 지도 학습의 입력으로 사용되거나, 인간 전문가에 의해 해석된다.
강화 학습(reinforcement learning)은 주어진 입력에 대응하는 행동을 취하는 시스템에 대해 적용하며, 이러한 시스템의 예로 로봇이나 게임의 플레이어 등을 들 수 있다. 강화 학습에서는 지도 학습과 달리 주어진 입력에 대한 출력, 즉 정답 행동이 주어지지 않는다. 대신 일련의 행동의 결과에 대해 보상(reward)이 주어지게 되며, 시스템은 이러한 보상을 이용해 학습을 행한다.
현재 기계 학습은 검색 엔진, 기계 번역, 음성 인식, 바둑, 과학 연구와 같은 다양한 분야에 적용되고 있다."
인공 지능,Artificial Intelligence,AI,,"컴퓨터로 구현한 지능 또는 이와 관련한 전산학의 연구 분야.
인공 지능은 사람 또는 동물의 지능이 컴퓨터로 모사될 정도로 세밀하고 정확하게 표현될 수 있다는 생각에 기반을 둔다. 지능에 대한 정의와 마찬가지로 인공 지능에 대해서도 다양한 정의가 존재한다. 인공 지능의 방법과 관련된 탐색, 논리 및 추론, 지식 표현, 계획, 학습 등 세부 분야에 대한 연구가 진행되고 있고, 자연어 처리, 컴퓨터 비전 및 패턴 인식, 로보틱스 등의 분야에서 응용된다.

최초의 인공 지능 연구로 1943년 워렌 맥컬로치(Warren McCulloch)와 월터 피츠(Walter Pitts)가 제안한 인공 뉴런(neuron) 모델을 들 수 있다. 인공 지능이라는 용어는 1956년 미국 다트머스 대학(Dartmouth College)에서 열린 워크숍 제안서에서 존 매카시(John McCarthy)가 처음 공식적으로 사용하였다.
1950-60년대 초창기의 인공 지능 연구는 정리(theorem) 증명과 게임 등의 분야에서 놀라운 성과를 거두었으나, 이후 과도한 기대에 따른 실망과 쇠퇴, 그리고 새로운 모델 및 이론의 개발 등이 반복되었다. 1970-80년대에는 전문가 시스템(expert system)에 대한 연구가 활발하였으며, 1980년대 중반 역전파 알고리즘(backpropagation algorithm)의 재발견 이후 인공 신경망(ANN: Artificial Neural Network) 모델에 대한 연구가 활발해졌다. 1990년대의 인공 지능 연구는 통계학, 정보 이론, 최적화 등 다양한 분야의 방법들을 활용하게 되었으며, 학습 이론 등 굳건한 이론적 토대를 갖추게 되었다. 2000년대 들어 대규모 데이터를 이용한 기계 학습이 활발히 연구되었으며, 체스, TV 퀴즈 쇼 참가 및 운전 등의 작업에 적용한 인공 지능 기술이 사람과 대등하거나 더 우수할 수 있음을 입증하였다. 2010년대 이후 컴퓨터 하드웨어와 학습 알고리즘의 발달은 심층 기계 학습(deep learning) 모델의 구축을 가능케 하였으며, 이에 기반해 바둑 및 사진상의 객체 인식(object recognition) 등에서 사람보다 뛰어난 컴퓨터 프로그램이 개발되었다.
현재 인공 지능 연구는 음성 인식, 바둑 등 특정한 분야에서 좋은 성과를 보이고 있으나, 아직 사람과 같은 지능을 갖추지는 못하고 있다. 예를 들어, 사람과 대화하며 동시에 바둑도 둘 수 있는 인공 지능 에이전트는 아직 개발되지 못하였다. 한편, 특정한 작업에만 적용될 수 있는 인공 지능 시스템이 아니라, 생각하고, 학습하고, 창조할 수 있는 범용 기계를 만드는 것을 목표로 하는 사람 수준(human-level) 인공 지능 또는 범용 인공 지능(AGI: Artificial General Intelligence)에 대한 연구도 이루어지고 있다.

* 참고: OECD 에서 정의한 AI system (2019, Recommendation of the Council on Artificial Intelligence)
- An AI system is a machine-based system that can, for a given set of human-defined objectives, make predictions, recommendations, or decisions influencing real or virtual environments. AI systems are designed to operate with varying levels of autonomy. 

   "
모바일 백홀망,Mobile backhaul network,,,"이동 통신망에서 기지국과 핵심망을 연결하는 망.
엘티이(LTE: Long Term Evolution)와 5세대(5G) 엔알(NR: New Radio) 등에서 사용자 단말(UE: User Equipment)의 데이터를 기지국(LTE의 eNodeB, 5G NR의 gNodeB)과 핵심망(LTE의 EPC 또는 5G NR의 5GC) 사이에 전달한다.

이동 통신망에서 백홀은 물리적으로 광케이블, 구리선, 또는 무선 등으로 연결된다. 전송 기술은 종래의 시분할 다중화(TDM: Time-Division Multiplexing)에서 MPLS-TP(Multi-Protocol Label Switching Transport Profile), IP/MPLS, 이더넷(Ethernet) 등 패킷 교환(packet switching) 기술로 진화하고 있다."
프론트홀,Fronthaul,,,"이동 통신의 무선 접속망에서 디지털 데이터 처리 장치(DU: Digital Unit)와 원격 무선 신호 처리 장치(RU: Radio Unit) 사이를 연결하는 링크.
프론트홀 링크는 디지털 데이터 처리 장치(DU)와 핵심망(core network)을 연결하는 백홀(backhaul) 링크와 상반되는 의미로 이동 통신에서 새로 사용하는 용어이다.

기지국의 디지털 데이터 처리 장치(DU)를 분리시켜 여러 DU를 한 장소에 모아 관리하고, 기지국에는 무선 신호 처리 장치(RU)만 설치하여 분산시킨 무선 접속망을 클라우드 무선 접속망(C-RAN: Cloud Radio Access Network)이라 한다. 이러한 C-RAN 구조에서 프론트홀은 DU 사이트와 RU를 연결하는 데이터 링크이다.
※ DU(Digital Unit)는 베이스밴드 장치(BBU: BaseBand Unit) 등으로도 불리고, RU(Radio Unit)는 원격 무선 장비(RRH: Remote Radio Head) 등으로도 불린다.

프론트홀(fronthaul) 링크는 주로 고속의 광케이블 등으로 구성되며 동위상/직교 데이터(I/Q data: In-phase and Quadrature data)를 전달한다. 프론트홀 인터페이스 표준으로 일반 공용 무선 인터페이스(CPRI: Common Public Radio Interface), 오픈 무선 장치 인터페이스(ORI: Open Radio Equipment Interface), 오픈 기지국 구조 이니셔티브(OBSAI: Open Base Station Architecture Initiative) 등이 있다.

※ 기존 LTE와 LTE-Advanced 망에서 프론트홀은 주로 CPRI 인터페이스를 통해 물리 계층과 RF 사이의 I/Q 데이터를 전송하였다. 그러나 5G 망에서 I/Q 데이터를 전송하는 경우 대규모 미모(massive MIMO)와 넓은 대역폭으로 인해 프론트홀에서 데이터 속도가 과도하게 증가할 수 있다. 이를 해결하는 방안으로 DU와 RU의 기능이 분리되는 위치를 이전의 3G나 4G 시스템의 경우보다 상위 계층에 두는 기능 분리(functional split)가 있다(3GPP TR 38.801 참고). 이 기술은 5G 상용화를 준비하고 있는 이동 통신 사업자들과 기지국 개발 회사들이 많은 관심을 가지고 있고, 5G 상용화 시 적용될 전망이다."
고정 무선 접속,Fixed Wireless Access,FWA,,"고정된 가입자의 단말과 망 접속점인 기지국을 무선으로 연결하여 초고속 인터넷 서비스를 제공하는 무선 통신 기술.
주로 건물 외부에 설치되는 가입자 단말과 기지국 사이는 광케이블 같은 유선으로 연결되는 것이 일반적인데, 유선 구간 일부를 광대역 무선 통신으로 대체하여 초고속 인터넷 환경을 제공한다.

최근 이동 통신 기술 발전으로 5G 이동 통신과 비슷한 성능을 제공할 수 있는 고정 무선 접속(FWA) 기술이 대두되었다. 5G에서 사용하는 밀리미터파(mmWave, 28/39/73 GHz 등)로 넓은 대역폭을 확보할 수 있어 초고속 인터넷 서비스를 효율적으로 제공할 수 있다. 밀리미터파 대역의 전파(EHF)는 직진성이 높아 고체 물질을 통과하기 어렵고 경로 손실이 많아 이동성을 확보하기 어려운 특징이 있다. FWA는 고정 단말을 대상으로 하기 때문에 밀리미터파 대역에서 상대적으로 구현이 용이하다.
고정 무선 접속(FWA) 기술은 통신 서비스 기반이 구축이 어려운 지역이나 국가에 고속의 인터넷 서비스를 제공하는 데 활용할 수 있다."
5세대 이동 통신,5th Generation,5G,,"4세대 이동 통신에서 진화된 이동 통신이라는 의미로 사용되는 마케팅 명칭.
국제 전기 통신 연합(ITU)에서 정한 공식 명칭은 아이엠티 2020(IMT-2020)이지만, 이동 통신 시장에서는 세대로 구분하여 5세대(5G) 용어를 사용한다.

5G는 이동 통신 국제 표준화 단체인 3GPP의 기술 상표명(brand name)이기도 하다. 과거 4세대 이동 통신 기술에 대한 3GPP의 상표명은 엘티이(LTE), 엘티이 어드밴스트(LTE-Advanced), 엘티이 어드밴스트 프로(LTE-Advanced Pro)이다.
3GPP 표준 릴리즈(Release) 15부터는 LTE-Advanced Pro에 해당하는 표준과 새로운 무선 접속 기술인 엔알(NR: New Radio)에 해당하는 표준 모두에 대해 ‘5G’라는 로고와 상표명을 적용한다. 즉, LTE-Advance Pro를 포함하는 기술 표준 TS(Technical Specification) 36 계열과 NR을 포함하는 기술 표준 TS 38 계열 모두의 릴리즈 15 표준부터는 ‘5G’ 로고와 상표명을 사용한다."
컴퓨팅 사고,Computational Thinking,CT,,"컴퓨터로 처리할 수 있는 형태로 문제와 해결책을 표현하는 사고 과정.
컴퓨터에게 뭘 해야 할지를 사람이 설명해 주는 것이라고 볼 수 있다.
복잡한 문제를 컴퓨터가 효과적으로 처리할 수 있는 단위로 분해(decomposition), 문제 간 유사성을 찾는 패턴 인식(pattern recognition), 문제의 핵심만 추려 복잡한 문제를 단순화하는 추상화(abstraction), 일련의 규칙과 절차에 따라 문제를 해결하는 알고리즘 기법 등을 사용하여 사람과 컴퓨터 모두가 문제를 처리할 수 있는 형태로 표현한다.

1980년에 MIT의 시모어 페퍼트(Seymour Papert) 교수가 처음 사용한 용어이며, 2006년 당시 카네기 멜런 대학교(Carnegie Mellon University)의 교수였던 지넷 윙(Jeannette Wing)이 컴퓨팅 사고를 아동 교육의 필수 요소로 제시하면서 CT 보급의 결정적인 역할을 하였다.
세계 여러 나라의 학교에서 창의력을 위해 컴퓨팅 사고(CT) 교육을 하고 있으며 정의는 국가 또는 학자마다 약간의 차이를 보인다. 미국 컴퓨터 과학 교사 협회(CSTA: Computer Science Teachers Association)는 컴퓨터 사고를 데이터 수집, 데이터 분석, 데이터 표현, 분해, 추상화, 알고리즘 및 프로시저, 자동화, 시뮬레이션 및 병렬화 등을 포함하는 문제 해결 과정으로 설명한다. 즉, 데이터를 모으고 조작하는 ‘데이터 수집/데이터 분석/데이터 표현’, 큰 문제를 작은 문제로 쪼개는 ‘분해’, 문제를 해결하는 데 불필요하거나 너무 상세한 것을 생략하는 ‘추상화’, 문제를 해결하거나 어떤 목표를 달성하기 위해 수행되는 일련의 동작인 ‘알고리즘 및 프로시저’, 컴퓨팅 시스템으로 수행할 수 있는 형태로 해결책을 나타내는 ‘자동화’, 자동화의 결과로써 문제 해결을 위한 모델을 실행시켜 결과를 파악하는 ‘시뮬레이션’, 목표 달성을 위한 작업을 동시에 수행하도록 자원을 구성하는 ‘병렬화’ 등을 주요 특성으로 본다.
영국 컴퓨팅 앳 스쿨(CAS: Computing At School)에서는 컴퓨팅 사고의 주요 특성으로 명확하고 정밀한 사고로 사실을 분석, 검사함으로써 사물을 이해하는 ‘논리적 추론’, 불필요하고 상세한 것을 제거하여 대상물을 좀 더 이해하기 쉽게 만드는 ‘추상화’, 알고리즘이나 프로세스에 대한 해결책이 좋고 목적에 맞는 것임을 보장하는 과정인 ‘평가’, 해결책을 단계적으로 명확하게 정의하는 방법인 ‘알고리즘적 사고’, 대상물을 부품 또는 요소의 관점에서 생각하는 ‘분해’, 비슷한 유형의 문제를 해결하는 데 적용할 수 있는 ‘일반화’ 등을 포함한다."
마이크로비트,micro:bit,,,"영국 방송 공사(BBC)에서 쉽고 재미있는 컴퓨터 교육을 위해 만든 암(ARM) 기반의 소형 싱글 보드 컴퓨터.
‘micro:bit’를 상표명으로 사용한다. 개별 프로그래밍이 가능한 LED와 버튼, 센서, 유에스비(USB), 무선 통신 등으로 구성되어 간단한 게임부터 로봇, 전자 악기까지 다양한 기기를 만들 수 있다.

2012년 영국 BBC에서 컴퓨터 소양 교육의 일환으로 시작하여, 2015년 암 홀딩스(ARM Holdings), 마이크로소프트(Microsoft), 삼성(Samsung), 노르딕 반도체(Nordic Semiconductor), 파이선(Python) 소프트웨어 재단 등 협력사들과 공동으로 개발하였다.
마이크로비트 보드는 4㎝×5㎝ 크기이며, ARM 기반 프로세서와 LED 25개, 버튼 2개, 외부 장치 연결용 핀, 빛·온도·가속도·나침반 센서, 무선(radio), 블루투스, 마이크로 유에스비(micro USB)로 구성되어 있다. 유에스비에 배터리를 연결하여 독립적으로 사용할 수 있다.
컴퓨터, 태블릿PC, 스마트폰 등에서 자바스크립트 블록(JavaScript Blocks), 파이선(Python) 등 언어를 사용하여 마이크로비트 프로그램을 개발할 수 있고, 마이크로비트 보드에 USB 또는 블루투스 통신으로 연결하여 개발한 프로그램을 넣을 수 있다.
마이크로비트는 직접 프로그램을 만들고 하드웨어가 어떻게 정보를 입력받고 동작하는지를 체험하는 물리 컴퓨팅(physical computing)의 대표적인 교구재로 활용되고 있다.
마이크로비트재단(www.microbit.org)에서 마이크로비트를 관리한다."
범용 인공 지능,Artificial General Intelligence,AGI,,"특정 문제뿐 아니라 주어진 모든 상황에서 생각과 학습을 하고 창작할 수 있는 능력이 있는 인공 지능 또는 이에 대한 연구.
인공 지능 연구의 궁극적 목표 중 하나이다.

현재 인공 지능 연구는 음성 인식, 바둑 등 특정한 문제에 대해서는 좋은 성과를 보이고 있으나, 아직 사람과 같은 지능을 갖추지는 못하고 있다. 예를 들어, 사람과 대화하며 동시에 바둑도 둘 수 있는 인공 지능 에이전트는 아직 개발되지 못하였다. 이와 같이 특정 문제만을 해결할 수 있는 인공 지능을 좁은 인공 지능(ANI: Artificial Narrow Intelligence)이라 한다.

AI에 대한 철학 가설로 약 인공 지능(weak AI)과 강 인공 지능(strong AI) 가설이 있다. 약 인공 지능은 인공 지능 컴퓨터가 실제 지능이 있는 것이 아니라 지능이 있는 것처럼 보일 뿐이라는 가설이며, 강 인공 지능은 인공 지능 컴퓨터가 실제로 지능이 있다고 보는 가설이다. 강 인공 지능 가설이 참임을 검증할 수 있는 컴퓨터를 강 인공 지능 컴퓨터라고 한다.
일부 인공 지능 연구자들은 특정한 문제를 해결하기 위한 컴퓨터 프로그램을 개발하는 것도 중요하지만, 진짜 사람 수준의 인공 지능을 연구하는 것이 더 중요하다는 주장을 하고 있다."
물리 컴퓨팅,Physical computing,,피지컬 컴퓨팅,"현실 세계의 아날로그 정보를 인지하여 그에 맞게 대응할 수 있도록 센서와 마이크로컨트롤러 등의 하드웨어 장치와 소프트웨어로 컴퓨팅 시스템을 만드는 것.
넓게는 사람이 디지털 세계를 이해하고 창의적으로 활용하기 위한 프레임워크라고 볼 수 있으며, 좁게는 소프트웨어와 하드웨어 부품 등으로 기기를 직접 제작하는 것을 의미한다. 즉, 현실을 감지하고 제어하는 컴퓨터를 만드는 것으로, 컴퓨팅 사고 교육, 미디어 아트, 로봇 등 다양한 분야에서 응용된다.

뉴욕 대학교에서 물리 컴퓨팅을 가르치는 톰 아이고(Tom Igoe) 교수는 물리 컴퓨팅을 ‘사람이 현실 세계를 물리적으로 표현하기 위해 컴퓨터와 소통하는 방법을 배우기 위한 접근(Physical Computing is an approach to learning how humans communicate through computers that starts by considering how humans express themselves physically)’으로 정의하고 있다.

초기 물리 컴퓨팅은 뉴 미디어 아트(new media art) 예술가들이 컴퓨터를 이해하여 영상물이나 빛을 이용한 작품을 만들기 위해서 사용하고 발전시켰다. 작품과 실제 환경을 연결하고, 대화형 컴퓨팅 기기와 사람 사이에 새로운 직관적 인터페이스를 만드는 과정을 통해 다양한 예술 작품을 만든다.
교육 분야에서는 창의적 컴퓨팅과 소프트웨어 교육에 많이 활용된다. 학생들은 물리적인 것을 실제로 보고 만지고 느끼면서 재미를 느끼고 컴퓨터, 알고리즘 등에 대해 쉽게 배울 수 있다. 물리 컴퓨팅의 학습 도구의 대표적 제품으로 아두이노(Arduino), 라즈베리파이(Raspberry Pi) 등 싱글 보드 컴퓨터가 활용되며, 간단한 LED 스탠드, 장난감 로봇, 디지털 온도계 등을 만들 수 있다.
예술과 교육 분야 이외에도 게임, 공장 자동화 등 다양한 분야에 적용된다. 최근에는 음파 탐지 및 음성 인식, 컴퓨터 비전, 촉각 인터페이스, 모션 캡처 등 사물 인터넷 기반 기술로도 활용되고 있다."
퍼즈 시험,Fuzzing,,"퍼징, Fuzz Testing","소프트웨어의 취약점을 찾기 위해 무작위로 데이터를 입력하여 예외 오류를 발생시킨 후 원인을 분석하는 시험.
주로 프로그램 충돌이나 소스 코드 내의 오류, 잠재적인 메모리 누수와 같은 예외적인 상황을 찾을 때 사용한다.

퍼즈 시험 개념의 기원은 1950년대 펀치 카드에 데이터를 저장할 때 임의의 수를 입력하여 예기치 않은 반응을 보이는지 검사하고 수정하는 테스트에서 출발한다.
1988년 위스콘신(Wisconsin) 대학교의 바턴 밀러(Barton Miller) 교수는 소스 코드의 오류들을 체계적으로 분석하고, 다양한 소프트웨어를 체계적으로 평가하기 위해 퍼즈 시험(퍼징)을 처음 개발하였다. 초기 퍼징 툴은 유닉스(Unix) 환경에서 명령줄(command-line) 파라미터로 무작위 데이터 파일을 입력하는 형태였다. 후에 명령줄 애플리케이션 외에 네트워크 프로토콜, 웹 애플리케이션 등 다양한 형태의 퍼징 툴이 등장하였다.
※ 위스콘신 대학교 퍼즈 테스트 웹에 소스 코드를 포함한 퍼징 툴, 시험 절차, 디버깅 툴, 원 자료 결과 등이 공개되어 있다.

퍼징은 테스트 데이터 발생 방법에 따라 변이 기반(Mutation-Based) 또는 생성 기반(Generation-Based) 퍼징 프로그램으로 구분한다. 변이 기반 방식은 기존 데이터 샘플을 변형시켜 만든 테스트 데이터로 시험하고, 생성 기반 방식은 입력 모델에 기반을 두어 새로 정의한 테스트 데이터를 실행시켜 소프트웨어의 취약점을 찾는다. 또 소프트웨어 내부 구조에 대한 지식 여부에 따라 화이트박스 시험(white-box testing), 그레이박스 시험(grey-box testing), 블랙박스 시험(black-box testing) 형태가 된다. 화이트박스 시험은 내부 구조를 아는 상태에서, 블랙박스 시험은 모르는 상태에서, 그레이박스 시험은 일부만 아는 상태에서 소프트웨어 동작을 시험한다.
보안 분야에서는 소스 코드의 취약점을 알아내기 위해 소스 코드 분석 대신 퍼징을 사용한다. 제로데이 공격(zero-day attack, 보안 취약점이 패치되기 전 이를 악용해 공격하는 해킹 기법)을 파악하는 데에도 사용하는 것으로 알려져 있다.
반면, 퍼징은 입력 가능한 변수 모두를 테스트하기에 막대한 시간과 비용이 요구되며, 소프트웨어의 오류를 완벽하게 제거하는 것이 불가능하다는 취약점이 있다."
고효율 이미지 파일 형식,High Efficiency Image File Format,HEIF,,"엠펙(MPEG)에서 고효율 비디오 부호화(HEVC) 표준 기반으로 만든 이미지 파일 형식.
기존 제이펙(JPEG) 이미지 파일 형식보다 이미지 파일 용량을 2배 가량 줄이면서도 동일 수준 이상의 품질을 제공한다. MPE-H 표준의 파트 12(ISO/IEC 23008-12, 2015년)로 제정되었다.
* HEVC: High Efficiency Video Codec, MPEG-H 파트 2, ISO/IEC 23008-2

HEVC로 압축된 각각의 이미지들을 한 파일에 저장하는 컨테이너 형식이며 자막, 오디오 등과 같은 멀티미디어 스트림 정보도 함께 저장할 수 있다.
HEIF 파일의 확장명은 .heic 또는 .heif 이다. ISO BMFF(스트리밍 멀티미디어 파일 포맷) 파일과 호환된다.
애플(Apple)사의 매킨토시 운영 체제(macOS) 하이시에라(High Sierra) 버전과 아이폰 운영 체제(iOS) 11 버전 이상에서 지원된다. 아이폰에서 라이브 포토(live photo) 기능으로 촬영하면 HEIF 파일로 저장된다. 마이크로소프트(Microsoft)사의 윈도우(MS Windows) 10 버전, 구글(Google)사의 모바일 운영 체제인 안드로이드 9 파이(Android 9 Pie) 버전 이상에서도 지원한다."
진화된 패킷 핵심망,Evolved Packet Core,EPC,,"엘티이(LTE) 이동 통신의 핵심망. 국제 표준화 단체 3GPP에서 정의한 공식 명칭이다.
EPC는 무선 접속망인 E-UTRAN(Evolved UTRAN)과 패킷 데이터 망(PDN: Packet Data Network)을 연결하며 사용자의 음성 및 데이터 패킷 처리 및 전송, 이동성 관리 기능 등을 제공한다.

일반적으로 이동 통신망은 단말에 이동 환경을 제공하는 무선 접속망(RAN: Radio Access Network)과 단말 데이터를 처리하고 다른 망과의 상호 연결 등을 제공하는 핵심망(CN: Core Network)으로 구성된다.
3GPP는 LTE 망의 RAN 이름을 진화된 범용 지상 무선 접속망(E-UTRAN: Evolved UTRAN), E-UTRAN에 연결되는 핵심망(CN)을 진화된 패킷 핵심망(EPC: Evolved Packet Core), E-UTRAN과 EPC를 합친 전체 시스템은 진화된 패킷 시스템(EPS: Evolved Packet System)이라 명명하였다.
EPC는 크게 3개의 네트워크 요소(network element)로 구성된다. 좀 더 구체적으로 이동성 관리 엔티티(MME: Mobility Management Entity), 서빙 게이트웨이(S-GW: Serving GateWay), 패킷 데이터 망 게이트웨이(P-GW: PDN GateWay)로 구성된다. MME는 제어 평면(CP: Control Plane)을 처리하고, S-GW와 P-GW는 사용자 평면(UP: User Plane)을 처리한다.

3세대(3G) 이동 통신의 핵심망과 가장 크게 다른 점은 LTE EPC는 패킷 핵심망(packet core network)만으로 구성된다는 것이다. 3G 경우 서킷 핵심망(circuit core network)에서 음성 서비스를 처리하고 패킷 핵심망에서 데이터 서비스를 처리한다."
진화된 범용 지상 무선 접속 기술,Evolved UMTS(Universal Mobile Telecommunications System) Terrestrial Radio Access,"E-UTRA,  Evolved UTRA",Evolved Universal Terrestrial Radio Access,"엘티이(LTE) 이동 통신에서 무선 접속망(E-UTRAN)을 구성하는 단말과 기지국 사이의 무선 접속 기술.
국제 표준화 단체인 3GPP에서 정의한 공식 명칭이다.

E-UTRA의 다중 접속 방식은 하향 링크와 상향 링크가 각각 다르다.
기지국에서 단말로 전송되는 하향 링크(DL: Downlink)는 직교 주파수 분할 다중 접속(OFDMA: Orthogonal Frequency Division Multiple Access) 방식을 사용하고, 단말에서 기지국으로 전송되는 상향 링크(UL: Uplink)는 단일 반송 주파수 분할 다중 접속(SC-FDMA: Single Carrier Frequency Division Multiple Access) 방식을 사용한다.
OFDMA는 OFDM(Orthogonal Frequency Division Multiplexing)이라는 전송 기술을 기반으로 여러 단말이 음성/데이터 서비스를 받을 수 있도록 다중 접속을 시킨다. SC-FDMA는 OFDMA가 가지는 문제 중 하나인 첨두 전력 대 평균 전력비(PAPR: Peak to Average Power Ratio) 특성으로 인하여 단말의 전력 증폭기에 부담을 많이 주는 것을 개선하기 위해서 고려된 기술이다. 송신단에서의 이산 푸리에 변환(DFT: Discrete Fourier Transform)과 수신단에서의 역 이산 푸리에 변환(IDFT: Inverse DFT)을 수행함으로써 PAPR이 매우 낮아져 단말의 전력 증폭기에 부담을 줄여주기 때문에 SC-FDMA는 상향 링크의 다중 접속 방식으로 채택되었다."
진화된 범용 지상 무선 접속망,Evolved UMTS(Universal Mobile Telecommunications System) Terrestrial Radio Access Network,"E-UTRAN,  Evolved UTRAN",Evolved Universal Terrestrial Radio Access Network,"엘티이(LTE) 이동 통신의 무선 접속망(RAN: Radio Access Network).
국제 표준화 단체인 3GPP에서 정의한 공식 명칭이다.

일반적으로 이동 통신망은 단말에 이동 환경을 제공하는 무선 접속망(RAN: Radio Access Network)과 단말 데이터를 처리하고 다른 망과의 상호 연결 등을 제공하는 핵심망(CN: Core Network)으로 구성한다.
3GPP는 LTE 망의 RAN 이름을 E-UTRAN, E-UTRAN에 연결되는 핵심망(CN: Core Network)을 EPC(Evolved Packet Core), E-UTRAN과 EPC를 합친 전체 시스템은 EPS(Evolved Packet System)라 명명하였다.
E-UTRAN은 단말(UE: User Equipment), 기지국(eNodeB: evolved NodeB), 단말과 기지국 사이의 무선 접속 기술인 E-UTRA으로 구성된다.

E-UTRAN에서 사용자 데이터와 제어 정보를 주고받는 네트워크 프로토콜은 하위 계층(Layer 1/2/3)과 상위 계층(예: 비접속 계층[NAS: Non-Access Stratum], 애플리케이션 계층)으로 구성된다. 1 계층(L1: Layer 1)은 물리 계층(PHY: Physical layer)으로 무선 신호를 사용하여 데이터 송수신을 한다. 2 계층(L2)은 매체 접근 제어(MAC: Medium Access Control), 무선 링크 제어(RLC: Radio Link Control), 패킷 데이터 변환 프로토콜(PDCP: Packet Data Convergence Protocol) 세 개의 부 계층(sublayer)들로 구성된다. 3 계층(L3)은 무선 자원 제어(RRC: Radio Resource Control) 계층으로 기지국과 단말 사이의 연결, 전송, 데이터 품질 등을 관리한다."
노드닷제이에스,Node.js,,,"서버 쪽 응용 프로그램 개발에 사용할 수 있는 자바스크립트 기반의 소프트웨어 플랫폼.
마이크로소프트 윈도우(MS Windows), 리눅스(Linux), 애플 맥오에스(macOS) 등 다양한 플랫폼에서 실행된다.

기존 자바스크립트(JavaScript)는 주로 HTML에 포함되어 클라이언트 쪽 응용 프로그램 개발에만 사용되어, 실시간 웹 소켓 통신이나 데이터베이스 입출력 등을 위한 서버 쪽 응용 프로그램은 피에이치피(PHP)와 같은 서버 스크립트로 언어로 개발해야 했다. 즉, 브라우저의 자바스크립트 엔진만이 자바스크립트 코드를 처리·실행할 수 있었다.
‘모든 곳에서 자바스크립트 사용(JavaScript everywhere)’이라는 비전에 따라 만들어진 Node.js 출현으로 자바스크립트 언어 하나만으로 웹 클라이언트 응용 프로그램과 서버 응용 프로그램 모두 개발할 수 있게 되었다.
넷플릭스(Netflix), 그루폰(Groupon), 링크드인(LinkedIn) 등 전 세계 웹 서비스에 많이 활용된다."
깃허브,GitHub,,,"컴퓨터 프로그램 소스를 공유하고 협업하여 개발할 수 있는 버전 관리 시스템인 깃(Git)에 프로젝트 관리 지원 기능을 확장하여 제공하는 웹 호스팅 서비스.
2008년 미국 깃허브사(GitHub Inc)에서 서비스를 시작하였다. 사용자에게 무료로 계정과 저장소를 제공하며, 분산형 버전 관리 서비스로 서버 장애 시 데이터 복원력이 뛰어나다. 전 세계에서 오픈 소스 프로젝트 관리를 위해 가장 많이 사용되는 웹 호스팅 서비스 중 하나이다.

깃(Git)은 2005년 리눅스 제작자인 리누스 토발즈(Linus Torvalds)가 오픈 소스 리눅스(Linux) 커널 개발의 효율성을 높이기 위해서 개발하였다.
많은 개발자들이 소프트웨어 소스 코드를 공유하고 협력하면서 개발할 수 있도록 지원하는 분산형 버전 관리 시스템(DVCS: Distributed Version Control System)으로, 코드 수정 권한, 버전 추적 등 소프트웨어 개발에 필요한 관리 기능을 제공한다.
분산형 버전 관리 시스템(DVCS)은 중앙 집중 방식의 문제를 해결한다. 공동 버전 시스템(CVS: Concurrent Versions System), 서브버전(Subversion), 퍼포스(Perforce) 등과 같은 중앙 집중 방식의 버전 관리 시스템(CVCS: Central Version Control System)은 중앙 서버에서 모든 파일의 버전을 저장·관리하고 다수 클라이언트가 서버에서 파일들을 가져와서 사용하는 방식으로 서버에 장애가 발생하면 사용을 할 수 없고 데이터 복구도 할 수 없다.
이와 달리 DVCS에서는 클라이언트가 저장소를 통째로 복제하여 사용하기 때문에 서버에 문제가 발생해도 클라이언트는 복제된 저장소를 다시 서버에 복사하여 서버 내 데이터를 복원할 수 있다.
깃허브(GitHub)는 깃(Git)의 기본 기능을 포함하여 프로젝트 관리에 필요한 버그 추적(bug tracking), 기능 요청(feature requests), 작업 관리(task management), 위키(wiki) 기능 등을 추가적으로 제공한다.

깃허브 조사에 따르면 2018년 6월 기준으로 2,800만 명 사용자가 있으며 5,700만개의 코드 저장소가 있다."
웹어셈블리,WebAssembly,"WA, Wasm",,"웹 페이지에서 실행할 코드에 대해 이진 포맷과 어셈블리와 유사한 텍스트 포맷을 정의한 웹 표준.
기존에 C, C++ 등 언어로 작성된 소스 코드를 웹어셈블리로 변환하여 웹 응용 프로그램 개발에 재활용할 수 있다. 또 기계어에 가까운 포맷 표준으로 웹 응용 프로그램의 실행 성능과 하드웨어 이식성이 높다.

예를 들면, 얼굴 인식 웹 응용 프로그램을 개발할 경우 기존에 C 언어로 개발한 소스 코드가 있어도 브라우저에서 실행할 방법이 없어 자바스크립트로 새로 구현해야 했지만, 웹어셈블리를 이용하여 C 소스 코드를 웹어셈블리 코드로 변환하면 자바스크립트에서 사용할 수 있다. 따라서 기존 소스 코드를 재활용할 수 있고 응용 프로그램 실행 성능도 개선될 수 있다.
특히, 기존에 웹 응용 프로그램으로의 개발이 어렵고 성능도 높아야 하는 게임, 가상 현실, 증강 현실 등 다양한 분야에 웹어셈블리를 적용하여 생산성을 높일 수 있다.
국제 웹 표준화 단체인 월드 와이드 웹 컨소시엄(W3C: World Wide Web Consortium)에서 2017년 개발하였다. W3C 웹어셈블리 작업반에서 모질라(Mozilla), 마이크로소프트(Microsoft), 구글(Google)과 애플(Apple) 등 주요 브라우저 제작사와 관련 기업들이 협력하여 표준화를 추진한다.  
  C++
웹어셈블리
   이진(Binary) 포맷
 텍스트 포맷
  int factorial(int n) {
   if (n == 0)
     return 1;
   else
     return n * factorial(n-1);
  }
         20 00
 42 00
 51
 04 7e
 42 01
 05
 20 00
 20 00
 42 01
 7d
 10 00
 7e
 0b
 get_local 0
 i64.const 0
 i64.eq
 if i64
    i64.const 1
 else
    get_local 0
    get_local 0
    i64.const 1
    i64.sub
    call 0
    i64.mul
 end
출처: 웹어셈블리 https://webassembly.org"
큐알코드 지급 결제,QR Code payment,,,"QR코드를 활용한 간편 지급 결제 서비스.
QR코드 리더기, 모바일 앱 등으로 QR코드를 스캔하면 결제를 할 수 있으며, 온라인과 오프라인에서 모두 활용된다. QR코드에는 판매자 정보와 계좌 정보, 거래 내역 등의 정보가 담겨 있다.

카드 결제 단말기와 같은 별도의 장비가 필요 없고 판매자와 소비자 모두 스마트폰만 있으면 결제가 가능하다. 소비자가 상점의 QR코드를 스캔하면 소비자의 계좌에서 판매자의 계좌로 현금이 바로 이체되고 결제 내역이 양쪽에게 실시간으로 통보된다. 전통시장, 포장마차 등 주로 소액 현금으로 거래가 이루어지던 상점에서도 손쉽게 활용할 수 있다. 또한 카드사나 결제대행업체를 거치지 않기 때문에 기존 카드 결제 대비 수수료를 줄일 수 있다.
QR코드 지급 결제 서비스는 중국에서 보편화되어 있다. 중국의 컨설팅 업체 아이리서치(iResearch)의 ‘2017년 중국 모바일 결제 시장 보고서’에 따르면, 2017년 중국의 전체 지불 방식에서 모바일 결제가 차지하는 비중은 78.5 %이며, 그중 대부분이 QR코드 결제로 이루어졌다고 한다. 인도, 나이지리아 등 국가에서도 사용이 늘어나고 있으며, 우리나라도 최근 카카오 및 네이버페이에서 QR코드 지급 결제 서비스를 본격 제공하고 있다.

EMVCo는 고객과 상인용 QR코드 지급 결제 시스템 관련 표준을 제정하였다(EMV® QR Code Specification for Payment Systems, 2017)
※ EMVCo: 유로페이(Europay), 마스터카드(MasterCard), 비자카드(VISA) 등 세계 3대 신용카드 회사가 공동으로 설립한 조직으로, IC 카드 관련 국제 기술 표준 제정"
웹 국제화,Web Internationalization,,,"다양한 국제 언어 문화 환경을 수용할 수 있도록 웹 콘텐츠나 서비스, 웹 표준 등을 설계하고 개발하는 것.
특정 소수의 언어나 문화권 이용자도 영어권의 이용자와 동일한 수준으로 웹 서비스를 이용할 수 있도록 하기 위한 것이 목적이다. 월드와이드웹 컨소시엄(W3C)은 웹 국제화를 고려하여 HTML, CSS 등 웹 표준화를 진행한다.

전 세계의 모든 사람이 웹에 접근하여 잘 활용할 수 있도록 하는 것은 초기부터 W3C의 중요한 관심사 중의 하나였다. 따라서 W3C는 HTML이나 XML 콘텐츠 작성 시 다양한 문자 세트를 지정을 위한 문자 세트 지정 포맷(예: 유니코드 UTF-8, 완성형 한글 EUC-KR 등)을 표준화하여 효율적으로 다양한 언어를 표현할 수 있도록 하였다. 그리고 세로쓰기 형태인 한국 고어, 일본어, 중국어를 위해 종속형 스타일 시트(CSS: Cascading Style Sheets), 가변 벡터 도형 처리(SVG: Scalable Vector Graphics) 및 XML 문서 포맷에 사용하는 XSL 포매팅 객체(XSL-FO: XSL Formatting Objects) 표준에 세로 형태 표현 기능을 정의하였다.
W3C는 핵심이 되는 표준 개발에서 국제화를 더욱 강화하기 위해 2018년 6월 국제화 협의체(Internationalization Initiative)를 설립하여 활동을 시작하였다. 국제화의 영단어 ‘Internationalization'에서 첫 글자인 ""I""자와 마지막 글자인 ""N""의 사이에 18개의 글자가 들어가 있어 줄여서 ""I18N""이라고도 표기한다.

※ HTML5 표준에서는 문자 세트를 다음과 같이 간단히 지정할 수 있다.
<meta charset=""UTF-8""> 
유니코드 UTF-8 지정
<meta charset=""EUC-KR"">
완성형 한글 코드 지정"
자립형 5세대 이동 통신,5G StandAlone,5G SA,단독형 5G,"5세대 이동 통신(5G) 엔알(NR: New Radio) 기반의 차세대 무선 접속망(NG-RAN: Next Generation Radio Access Network)과 5G 핵심망(5GC: 5G Core network)으로 구성된 5G 이동 통신망.
기존 설치되어 운용되는 LTE 이동 통신 시스템에서 진화하지 않고 자체 5G 시스템만으로 구성되어 이용자에게 5G의 뛰어난 서비스를 제공한다.

자립형(SA: StandAlone)은 순수 5G 시스템만으로 무선 접속망(RAN: Radio Access Network)과 핵심망(CN: Core Network)을 구축하는 망 형태로, 기존에 설치된 LTE 망에 새로운 5G 무선 접속 기술을 구축하는 비자립형(NSA: Non-StandAlone, 종속형)과 대조를 이룬다. 5G SA 망은 기존 망을 병행 사용하지 않고 새로 구축되기 때문에 상용망으로서 안정적인 성능을 내기까지 기술 및 서비스 표준화, 시스템 개발과 상용망 구축 등에 소요되는 시간, 비용, 자원 등이 NSA 망 형태보다 더 필요하다. 따라서, 상용 5G 서비스를 조기에 안정적으로 제공하기 위해서는 NSA 망 사용이 우선 고려된다.
※ 3GPP 표준화 기구에서는 5G 이동 통신 상용화를 앞당기려는 이동 통신 사업자들의 요구 사항을 반영하여 NSA 표준화를 2017년말 완료하고, 그 이후에 SA 표준화를 2018년 6월 말에 완료하였다."
이중 연결,Dual Connectivity,DC,,"엘티이(LTE) 이동 통신에서 사용자 단말이 서로 다른 두 기지국에 연결되어, 각각의 기지국과 데이터를 동시에 송수신할 수 있는 기술.
단말은 전송 환경에 따라 연결된 두 기지국에서 데이터를 동시에 수신하거나 하나만 선택하여 이용할 수 있는 장점이 있다. 서비스 범위가 넓으나 전송 속도가 느린 매크로셀과 서비스 범위는 좁지만 전송 속도가 빠른 스몰셀(small cell)이 공존하는 환경에서 유용하다. 이동 통신 사실 표준화 기구 3GPP에서 개발한 기술로 릴리즈 12 표준에 포함하였다.

백홀(backhaul)에서 2.5 마이크로초(µsec) 이하 정도 지연과 최대 10 Gbps 처리율 조건을 만족시키는 백홀을 이상적 백홀(ideal backhaul)로 보며, 조건을 만족시키지 못하는 백홀은 비이상적 백홀(non-ideal backhaul)로 본다. 이중 연결(Dual Connectivity)에서 두 기지국은 수 밀리초(ms) 이상 지연 특성이 있는 비이상적 백홀로 연결되는 것으로 가정한다. 이상적 백홀로 연결이 되는 경우 좀 더 향상된 성능을 얻을 수 있으나 비이상적 백홀보다 구현이 어렵다.
비이상적 백홀로 연결된 두 기지국은 서로 다른 역할을 수행한다. 한 기지국은 마스터 기지국(eNodeB)이 되어 기지국 제어기(RRC)를 통해 제어 평면(control plane)과 사용자 평면(user plane)을 모두 처리하고, 다른 기지국(eNodeB)은 보조 역할로 사용자 평면을 처리한다. 단말은 마스터 또는 보조 eNodeB에서 데이터를 받거나, 두 기지국 모두에서 각기 다른 데이터를 수신하거나 하나의 데이터를 쪼개서 두 기지국에서 각각 받는 연결 설정이 모두 가능하다. 예를 들어, 매크로셀과 스몰셀에 연결된 단말이 매크로셀에서는 음성(voice) 데이터를 수신하고, 스몰셀에서는 고속의 데이터를 수신할 수 있다. 또한 단말이 매크로셀 내에서 이동 시 스몰셀이 변경될 때마다 핸드오버(handover)를 하지 않고, 매크로셀이 변경될 때만 핸드오버를 수행한다. 스몰셀의 좁은 커버리지로 인하여 빈번하게 발생하는 핸드오버에 따른 오버헤드(signaling overhead)를 줄일 수 있다."
다중 무선 접속 기술,multiple Radio Access Technology,multi RAT,,"이동 통신 망에서 서로 다른 여러 무선 통신 기술을 동시에 사용하는 무선 접속 기술.
3세대(3G) W-CDMA, 4세대(4G) LTE, 5세대(5G) NR(New Radio) 등 같은 계열의 이동 통신 기술 또는 와이파이(Wi-Fi), 블루투스(Bluetooth) 등의 무선 통신 기술들이 혼재된 이종망에서 사용된다. 주어진 환경에 맞는 최적의 무선 통신 기술이 사용되거나, 두 개 이상의 통신 기술이 함께 사용되어 사용자에게 보다 최적화된 통신 서비스가 제공된다.

대표적인 예로 3GPP 릴리즈 13 표준에 정의된 LWA(LTE-WLAN Aggregation)와 릴리즈 15에 있는 5G NR NSA(Non-StandAlone) 등이 있다. LWA는 LTE와 Wi-Fi를 조합하여 사용하는 기술로, 기지국은 핵심망에서 수신된 사용자 데이터를 LTE와 Wi-Fi 각각의 무선 채널 상태나 부하를 고려하여 데이터를 분산 전송한다. 사용자 단말은 LTE와 Wi-Fi 채널 각각에서 받은 데이터를 통합한다. 비자립형 5G(5G NSA)는 기존 4G LTE와 5G NR을 함께 사용하는 기술로, 채널 상태를 고려하여 사용자 데이터를 분리하고, LTE와 NR 무선 채널로 각각 분산 전송하거나 한 개의 채널만 사용하여 단말로 전송한다.
multi RAT 이용으로 단말의 데이터 송수신 속도는 빨라지고, 각 무선 통신 채널의 상황에 따라 데이터가 가변적으로 전송되어 최적화된 통신 서비스를 받을 수 있다."
지노드비,next generation Node B,"gNodeB, gNB",,"이동 통신 사실 표준화 기구 3GPP에서 제정한 5세대 이동 통신 NR(New Radio) 기지국.

3GPP에서 사용하는 공식 명칭이다. 3GPP에서 기존 4세대(4G) 이동 통신의 LTE 기지국의 이름 이노드비(eNodB)와 구별하여 5G NR(New Radio) 기지국을 ‘다음 세대(next generation)’의 알파벳 ‘g’를 인용하여 gNodeB로 정하였다.
5G 무선 접속망 NG-RAN(Next Generation-Radio Access Network)은 다수의 gNodeB들로 연결 구성되며, 기존의 eNodeB도 포함될 수 있다.
gNodeB는 NR 무선 프로토콜(radio protocol)을 통해 사용자 평면(User Plane) 및 제어 평면(Control Plane) 데이터를 단말(UE: User Equipment)과 주고받고, 5G 핵심망(5GC: 5G Core Network)에는 NG 인터페이스를 통해 연결된다. gNodeB 기지국 간에는 Xn 인터페이스로 연결된다.

 시스템
 3G
 LTE, 4G
5G
 전체 이동 통신 시스템
 UMTS
 EPS
5GS
 무선 접속 기술
 UTRA
 E-UTRA
 NR 또는 E-UTRA
 무선 접속망
 UTRAN
 E-UTRAN
 NG-RAN
 기지국
 Node B
eNodeB 
 gNodeB
 "
비자립형 5세대 이동 통신,5G Non-Standalone,5G NSA,"비단독형 5G, 종속형 5G","기존의 엘티이(LTE) 이동 통신망에 5G 엔알(NR: New Radio) 기지국을 추가 연결하여 LTE 서비스에서 5G 서비스로 비교적 쉽게 진화하는 망 구조.
5G 이동 통신의 상용화 초기에 적용할 수 있고, 서비스 이용자에게 LTE 서비스보다 향상된 서비스를 제공할 수 있다. 5G 자체적으로 동작하지 못하고 기존의 LTE 망에 의존하는 형태로, 비자립형(또는 종속형, Non-StandAlone)이라고 부른다.

가장 이상적인 5G 망 구조는 5G 시스템, 즉 5G NR 기반의 무선 접속망(NG-RAN)과 5G 핵심망(5GC)으로만 구성하는 자립형(또는 단독형, Standalone)이다. 하지만 자립형 5G 망을 구축하여 안정적으로 서비스하기까지 시간이 오래 걸릴 수 있으므로, 초기에는 기존에 설치된 4G LTE 망에 5G NR 기지국을 종속시켜 5G 서비스로 쉽게 진화할 수 있는 비자립형 망을 구축한다.
5G 비자립형 구조는 5G NR 기지국(gNodeB)이 4G LTE의 무선 접속망(E-UTRAN)과 핵심망(EPC)에 연결되어, 4G LTE의 E-UTRA와 NR이 이중 연결(DC: Dual Connectivity)을 갖는 구조 형태이다. gNodeB는 직접 또는 LTE 기지국(eNodeB)을 통해 EPC에 접속한다. LTE 기지국 eNodeB가 주 기지국으로, 사용자 평면과 제어 평면 데이터를 처리한다. 5G gNodeB는 사용자 평면 데이터만 처리한다."
차세대 무선 접속망,Next Generation Radio Access Network,NG-RAN,,"이동 통신 사실 표준화 기구 3GPP에서 제정한 5세대 이동 통신 NR(New Radio) 기술 기반의 무선 접속망.
NG-RAN은 5G NR은 물론 기존 LTE 무선 접속을 모두 수용하는 형태로 설계되어 있어, 5G NR 기지국(gNodeB) 및 LTE E-UTRA 기지국(eNodeB)을 포함한다.

5G 이동 통신 시스템(5GS: 5G System)은 크게 5G 무선 접속망 NG-RAN과 5G 핵심망(5GC: 5G Core network)으로 구성되고, NG-RAN은 5G NR(New Radio), 단말기, 기지국(eNodeB 및 gNodeB)로 구성된다. 기지국 간에는 Xn 인터페이스로 연결되며, 기지국과 5G 핵심망(5GC)은 NG 인터페이스로 연결된다.
NG-RAN에서 기지국은 다음과 같은 형태로 구성될 수 있다.
 (1) 5G 기지국 gNodeB만으로 구성된 형태
 (2) LTE 기지국 eNodeB만으로 구성된 형태
 (3) gNodeB와 eNodeB(보조)로 혼합된 형태로, gNodeB가 주도적인 역할을 수행하면서 사용자 평면(user plane)과 제어 평면(control plane) 데이터를 모두 처리하고, eNodeB는 보조적으로 사용자 평면만 처리한다.
 (4) eNodeB와 gNodeB(보조)로 혼합된 형태로, eNodeB가 주도적인 역할을 수행하면서 사용자 평면과 제어 평면을 모두 처리하고, gNodeB는 보조적으로 사용자 평면만 처리한다.

 시스템
 LTE, 4G
 5G
 전체 이동 통신 시스템
EPS
5GS
핵심망
EPC
5GC
 무선 접속망
 E-UTRAN
NG-RAN
 무선 접속 기술
 E-UTRA
 NR 또는 E-UTRA
 기지국
eNodeB
 gNodeB
 "
앵귤러제이에스,AngularJS,,,"웹 애플리케이션 개발에 사용되는 자바스크립트 프레임워크.
모델·뷰·컨트롤러(MVC: Model-View-Controller) 개발 방식을 지원하여 웹 애플리케이션 개발 시 소스 코드 구현 시간이 단축되고, 코드를 재사용할 수 있으며 유지보수의 효율성이 향상된다. 구글(Google)사에서 개발하였으며, 공개 소스이다. 2010년 처음 배포되었다.

웹 애플리케이션(웹 앱) 내에서 데이터를 관리하고 화면을 구성하기 위해서는 jQuery 같은 자바스크립트 라이브러리를 활용해서 일일히 데이터 바인딩(data binding) 코드를 작성해서 구현해야 한다. 하지만 AngularJS는 단일 웹 페이지의 UI에 업데이트된 데이터를 반영하거나 사용자의 입력에 따라 동적으로 특정 UI를 수정할 때 이미 선언된 데이터 바인딩만으로 자동 관리할 수 있게 한다.
※ 데이터 바인딩(data binding): 입력되는 값과 출력될 값을 일치(동기화)시키는 방법

아래 작성된 코드 예제에서 볼 수 있듯이 'ng-model'로 구성된 'input' 박스에 사용자가 값을 입력할 경우 별도의 데이터 바인딩 없이 'a_text' 내의 값이 'input' 박스의 내용으로 표시된다.

<html ng-app>

<head> 

 <script src=""angular.js""></script> 

 <script src=""controllers.js""></script> 

</head> 

<body> 

 <div ng-controller='Controller'> 

 <input ng-model='a.text'> <!-- 사용자 입력 박스창 -->

 <p>{{a.text}}, World</p>  <!-- 박스창에 입력된 값이 표시됨 -->

 </div>

</body>

</html>"
리액트제이에스,ReactJS,,,"단일 웹 페이지나 모바일 앱에서 사용자 인터페이스 중 화면에 표시되는 뷰 부분의 개발에 사용되는 자바스크립트 라이브러리.
페이스북(Facebook)에서 개발하여 2013년 처음 배포하였고, 공개 소스이다. 모델·뷰·컨트롤러(MVC: Model-View-Controller) 개발 요소 중 뷰(view)만 제공하며, 기존의 웹 기술 HTML, CSS 등과 결합하여 사용할 수 있어 확장성이 뛰어나다. 개발자는 자바스크립트만으로도 개발할 수 있어 사용이 편리하다.

ReactJS와 유사한 앵귤러제이에스(AngularJS)나 백본제이에스(backboneJS) 등은 모델·뷰·컨트롤러(MVC) 개발 방식 기반이다. 개발자는 자바스크립트 이외 별도의 스크립트를 배워야 하고, 다른 라이브러리를 같이 사용하여 개발할 수 없다. 이에 반해 ReactJS 라이브러리를 이용하면, 자바스크립트만으로도 웹 소프트웨어를 개발할 수 있고, 기존의 웹 기술을 결합하여 ‘뷰’ 부분만을 효율적으로 개발할 수 있다. 그리고 문서 객체 모델(DOM: Document Object Model) 구조가 매우 복잡한 단일 웹 페이지에서 특정 요소가 변경되었을 때 웹 페이지 전체를 다시 렌더링하는 것이 아니라 가상(Virtual) DOM 모델을 제시하여 가상 DOM이 실제 DOM을 모니터링하면서 변경된 부분만 렌더링하게 하여 불필요한 자원의 소모를 줄이고 웹 앱 성능을 향상시킬 수 있다.
ReactJS 라이브러리에서 컴포넌트는 JSX(JavaScript XML)라는 HTML과 유사한 형태의 태그를 이용해 구성할 수 있으며, 컴포넌트 객체 기반으로 UI를 관리할 수 있다.
자바스크립트 내에 HTML과 유사한 마크업 형태 (예:
<h1>Hello, {formatName(user)}!</h1>
)를 그대로 활용하도록 하여 가독성이 높고 특정 변수도 직관적으로 구성할 수 있다는 장점이 있다.

JSX 예제
function getGreeting(user) {

  if (user) {

    return <h1>Hello, {formatName(user)} </h1>;

  }

  return <h1>Hello, Stranger </h1>;

} "
모델·뷰·컨트롤러,Model-View-Controller,MVC,,"소프트웨어 설계에서 세 가지 구성 요소인 모델(Model), 뷰(View), 컨트롤러(Controller)를 이용한 설계 방식.
모델은 소프트웨어 내에서 데이터를 의미하고, 뷰는 사용자에게 보이는 화면 내용을 의미한다. 이러한 모델과 뷰의 상호 작용을 관리하는 것이 컨트롤러이다.

예를 들어, 사용자의 입력이 컨트롤러로 들어오면 컨트롤러는 모델에서 데이터를 불러오고, 해당 데이터를 뷰를 통해 화면으로 출력한다. 모델, 뷰, 컨트롤러가 기능별로 독립적으로 분리되어 있어서 여러 명의 개발자가 동시에 각각의 기능을 개발할 수 있고, 일부 기능이 추가될 경우도 기존의 구성 요소를 재사용할 수 있어 코드 재사용성이 향상된다.
노르웨이 컴퓨터 과학자인 트리베 린스카우그(Trygve Reenskaug)가 1970년대에 최초로 MVC 개념을 제안하였다. 당시에는 PC용 소프트웨어를 개발하기 위한 모델로 제시되었지만, 현재는 웹 애플리케이션을 개발하는 데에도 상당히 많이 사용된다.
MVC 모델을 웹 애플리케이션에 쉽게 적용할 수 있는 라이브러리로는 앵귤러자바스크립트(AngularJS), 엠버자바스크립트(EmberJS), 자바스크립트엠브이시(JavaScriptMVC), 백본자바스크립트(BackboneJS) 등이 있다.
MVC의 변형 형태로 모델·뷰·프리젠터(MVP: Model-View-Presenter), 모델·뷰·뷰모델(MVVM: Model-View-ViewModel) 등이 있다. MVC 유형에서 뷰와 모델은 정확히 분리되지만, 컨트롤러가 뷰의 구성에 상당 부분 관여하는 경우가 있어 각각의 독립성이 다소 떨어지는 문제가 발생할 수 있다. 이를 해결하기 위해 컨트롤러의 뷰 구성 기능은 모두 뷰 자체에 맡기고 프리젠터(presenter)가 모델과 뷰 사이의 인터페이스 역할만을 하도록 하는 것이 MVP이고, 데이터 바인딩 기반으로 뷰가 뷰모델과 인터페이스하도록 제한을 두는 것이 MVVM이다."
프로그레시브 웹 앱,Progressive Web App,,,"인터넷이 연결되지 않아도 웹 브라우저에서 이용할 수 있고 모바일 앱의 푸시 알림 기능 등을 지원하는 애플리케이션.
웹과 다운로드형의 모바일 앱의 장점을 이용했다는 면에서 하이브리드 앱과 유사하지만, 하이브리드 앱은 앱 마켓(스토어)에서 다운받아 설치한 후 사용하는 반면, 프로그레시브 웹 앱은 브라우저에서 바로 사용한다.

기존의 웹 앱은 인터넷에 연결되어 있는 경우에만 사용할 수 있어서 모바일 앱만큼 사용자에게 다양한 기능을 제공하지 못했다. 이러한 웹 앱의 단점을 해결하기 위해 구글(Google) 개발자들이 주축이 되어 2015년 프로그레시브 웹 앱을 만들었다.
PWA에서는 사용자가 임의 URL의 웹 앱에 한 번 접속하면 해당 앱의 기본이 되는 소스가 브라우저의 캐시에 다운로드된다. 이후 그 URL에 다시 방문하면 캐시에 다운로드된 소스가 실행되어 훨씬 빠르게 앱이 구동되고, 오프라인에서도 일부 기능이 사용된다. PWA 구현 기술로 매니페스트(Manifest), 앱캐시(AppCache), 서비스 워커(Service Workers) 등이 사용된다. 매니페스트(Manifest)는 W3C 표준으로 앱의 이름과 관련 설정 등을 저장하기 위한 메타데이터 관련 기술이며, 앱캐시(AppCache)는 오프라인에서도 앱을 구동시키기 위한 브라우저 저장 기술이다. 서비스 워커(Service Workers)는 푸시 알림 기능과 백그라운드 실행 기능을 구현하는 기술이다.
앱은 사용자가 앱 마켓(스토어)에서 다운로드하여 설치해야 하는 번거로움이 있고, 모바일 웹은 앱의 기능을 활용하는 데에 제약이 있다. 이 때문에 둘의 단점을 보완한 프로그레시브 웹 앱의 활용이 점차 늘어나고 있다."
신경망 기계 번역,Neural Machine Translation,NMT,인공신경망 기계 번역,"원문 번역의 전 과정을 인공 신경망으로 처리하는 기계 번역.
주로 심층 신경망(DNN: Deep Neural Network)을 사용한다.

전통적으로 기계 번역에는 단어 사전과 번역 규칙을 이용하는 규칙 기반 기계 번역(RBMT: Rule-Based Machine Translation)과 원문과 해당 번역문에 대한 대량의 말뭉치(corpus) 데이터를 활용하는 통계적 기계 번역(SMT: Statistical Machine Translation)이 주로 사용되어 왔다. 2013년에 원문과 해당 번역문 사이의 관계를 인공 신경망으로 학습하는 방법이 개발되었으며, 기존의 통계적 기계 번역(SMT)보다 우수한 성능을 보였다.
신경망 기계 번역은 DNN의 여러 모델 중 주로 심층 순환 신경망(deep RNN: deep Recurrent Neural Network)을 사용하고 있으며, 기계 번역의 주류 기술이 되고 있다."
카렐 프로그래밍 언어,Karel programming language,,,"컴퓨터 프로그래밍 초보자를 위한 교육용 프로그래밍 언어.
격자(그리드) 구조에서 카렐이라는 작은 로봇을 좌우(수평) 상하(수직) 방향 이동, 90도 회전, 소리를 내는 비퍼(beeper)를 잡거나 놓기 등의 단순 명령으로 제어하는 프로그램을 작성할 수 있다.

미국의 리처드 패티스(Richard E. Pattis) 교수가 만들었으며, 1981년 저술한 책(Karel The Robot: A Gentle Introduction to the Art of Programming)에 소개하였다. 리처드 패티스는 '로봇(robot)' 단어를 도입한 체코의 작가 카렐 채펙(Karel Čapek) 이름을 따서 ‘카렐’이라고 하였다.
카렐 언어는 다섯 가지의 기본 명령어를 지원한다. 프로그램에서 카렐 로봇이 향한 방향으로 한 칸 이동시키는 명령어 ‘move’, 왼쪽으로 90° 회전시키는 명령어 ‘turnLeft’, 비퍼를 집게 하는 명령어 ‘pickBeeper’, 비퍼를 내려놓게 하는 명령어 ‘putBeeper’, 그리고 프로그램을 종료하는 명령어 ‘turnOff’이다. 또한 카렐 로봇의 이동 방향이나, 주위 장애물 또는 비퍼 존재 여부에 대하여 논리 연산자를 이용하여 질의할 수 있다.
카렐 언어는 다양한 소프트웨어 교육 도구에 영향을 끼쳤다. 대표적인 예로, 교육용 로보마인드(RoboMind) 소프트웨어, 인터랙티브 온라인 프로그래밍 학습 플랫폼 codeHS, 파이선(Python) 학습용 러플(RUR-PLE), 파이선과 자바스크립트 학습용 리보그 세상(Reeborg’s World) 등이 있다. 황병욱 교사가 학생 교육용으로 만든 플레이봇(Playbot)도 카렐 언어의 영향을 받았다."
언플러그드 컴퓨팅,Unplugged computing,,,"교사가 학생들에게 컴퓨터 없이 컴퓨터 과학의 원리를 가르치는 학습 방법.
‘언플러그드’란 말 그대로 컴퓨터 전원 플러그를 꽂지 않아 사용하지 않음을 의미한다. 주로 유치원생, 초등학생과 중학생을 대상으로 하며, 컴퓨터 대신 신체 활동이나 동전, 카드 등을 이용한 놀이를 통해 쉽고 재미있게 컴퓨터를 가르치는 것을 목적으로 한다.

뉴질랜드의 컴퓨터 과학자인 팀 벨(Tim Bell) 교수가 중심이 되어 1990년 중반 '컴퓨터 과학 언플러그드(Computer Science Unplugged)' 방법을 개발하였다. 언플러그드 컴퓨팅이 제시된 초기에는 게임, 카드, 끈, 크레용을 사용하는 퍼즐 게임을 통해 컴퓨터 과학을 가르치는 학습 활동이었다. 우리나라에서는 바둑돌, 동전, 자석 등을 이용한 놀이와 활동 위주의 컴퓨팅 교수 학습 방법으로 확장되었고, 프로그래밍의 원리 교육을 위하여 만들어진 보드 게임이나 카드 게임을 이용한 학습을 가리키기도 한다. 예를 들어, 컴퓨터에서 이진수로 정보를 전달하는 것을 바둑돌이나 동전, 카드 등을 이용한 게임을 통해 학습하고, 운동장에서 키 순서대로 줄을 서는 놀이에서도 어떻게 하면 줄을 효율적으로 빨리 설 수 있는지 등의 방법을 찾으면서 컴퓨터의 정렬 알고리즘을 배운다.
언플러그드 컴퓨팅은 컴퓨터가 없는 지역에서도 컴퓨터 교육을 할 수 있다. 학생들은 재미와 흥미를 끌 수 있는 활동을 통해 컴퓨터를 배우고 컴퓨터 방식의 사고 능력을 향상시킬 수 있다.

※ 관련 출처: 언플러그드를 활용한 소프트웨어 교육(2015), 소프트웨어야 놀자"
로보틱 처리 자동화,Robotic Process Automation,RPA,로봇 프로세스 자동화,"업무 과정에 발생되는 데이터를 정형화하고 논리적으로 자동 수행하는 기술.
기업의 재무, 회계, 제조, 구매, 고객 관리 등에서 데이터 수집, 입력, 비교 등과 같이 반복되는 단순 업무를 자동화하여 빠르고 정밀하게 수행한다. 경영 전반의 업무 시간을 단축하고 비용을 절감할 수 있다.

지능형의 로봇 소프트웨어을 활용한 비즈니스 자동화 기술은 1990년대부터 웹 사이트 화면에서 필요한 정보를 수집하는 스크린 스크래핑(screen scraping)이나 업무 관련된 제반 사항을 자동으로 처리 관리하는 워크플로 자동화 등에 활용되었다.
일반 비즈니스 자동화는 인공 지능(AI)과 기계 학습(Machine Learning) 기술을 적용한 비즈니스 관리 위주의 프로세스로 구축된 반면, RPA는 최종 사용자의 관점에서 규칙 기반 비즈니스 프로세스로 설계되어 사람 대신 단순 반복 작업을 끊임없이 대량으로 수행한다. RPA는 현재 규칙이 확실하게 규정된 작업만 처리할 수 있고 사람의 판단력을 대체할 수준은 아니다. 기계 학습, 음성 인식, 자연어 처리와 같은 인지 기술을 적용하여 사람의 인지 능력이 필요한 의료 분야의 암 진단, 금융업계에서의 고객 자산 관리, 법률 판례 분석 등에도 활용될 수 있다."
웹 지급 결제,Web payments,,,"웹에서 신용카드, 현금카드 등 다양한 지급 결제 수단을 사용하여 지급 처리를 제공하는 기능에 대한 총칭.
월드와이드웹(W3C) 표준화 기구에서 웹 지급 결제 표준을 개발하고 있다.

웹상에서의 결제 처리 방식은 웹 사이트별로 결제 처리 방법이 상이하여 같은 정보를 반복 입력하거나, 결제 완료까지 복잡한 단계를 거쳐야 하는 경우가 많다. 모바일 웹상에서는 액티브엑스(ActiveX)가 지원되지 않아 더 많은 불편을 겪는다. 국내의 경우 대부분의 결제 서비스가 액티브엑스(ActiveX)를 사용하여 불편을 가중시켰다. 이를 해결하기 위해 W3C는 2015년 10월에 웹 지급 결제 작업 그룹(WPWG, Web Payments Working Group)을 설립하였다. WPWG는 PC와 모바일 단말에서 효율적이며 일관된 지급 결제 서비스 환경을 제공할 수 있는 웹 지급 결제 표준을 개발하고 있다. 애플(Apple), 삼성전자, 구글(Google), 알리바바(Alibaba), 마이크로소프트, 페이스북, 비자카드(Visa), 마스터카드(Mastercard) 등 지급 결제 서비스를 제공하는 글로벌 업체들이 참여하고 있다. 현재 구글(Google)의 크롬(Chrome), 애플(Apple)의 사파리(Safari), 마이크로소프트(Microsoft)의 에지(Edge), 삼성 인터넷 브라우저 등이 W3C의 웹 지급 결제 표준을 적용하여 서비스하고 있다."
웹 온톨로지 언어,Web Ontology Language,OWL,,"웹에서 표현되는 다양한 어휘 정보를 여러 웹 응용 프로그램들이 재활용할 수 있도록 지원하는 온톨로지 저작용 언어.
웹 분야에서는 온톨로지의 사물(thing) 중에서 어휘를 대상으로 하여, 웹 형식의 문서와 웹 응용 프로그램에서 어휘, 어휘 그룹, 어휘 관계를 논리적으로 풍부하고 유연하게 기술할 수 있는 장점이 있다.

월드와이드웹(W3C) 표준화 기구에서 2004년 처음 만들었고, 2009년 OWL 2 버전이 개발되었다.
OWL은 W3C의 자원 기술 프레임워크(RDF: Resource Description Framework) 표준과 DAML+OIL 언어를 기반으로 개선된 언어이다.
추론 시스템에 축적된 명제들을 정의하며, 클래스 및 그 구성원 간의 관계를 기술하고, 구문적으로 정의되지 않은 사실의 논리적 유추를 가능하게 하는 클래스 및 속성과 이에 적용할 수 있는 제약 사항으로 구성된다. OWL에서 표현 수준에 따라 세 가지 하위 언어(sublanguage), OWL Lite, OWL DL, OWL Full이 있다. OWL 라이트(Lite) 언어는 클래스 계층 구조와 단순 제약 사항 정도만 표현하는 경우를 대상으로 한다. OWL 기술 논리(DL: Description Logic) 언어는 OWL의 모든 어휘를 포함하나 어휘의 속성이나 관계 표현에 제약이 있으며, 기술 논리 비즈니스 분야를 지원하고 추론 시스템에 적합한 계산 속성을 갖는다. OWL 풀(Full) 언어는 계산 결과나 시간 등에 대한 보장이 없이 최대 표현력과 RDF의 유연한 문법을 모두 지원하여 어휘 조합을 통해 온톨로지를 확장할 수 있게 한다.

※ OWL 예시
<owl:Class rdf:ID=""Wine"">

  <rdfs:subClassOf rdf:resource=""&food;PotableLiquid"" />

  <rdfs:subClassOf>

    <owl:Restriction>

     <owl:onProperty rdf:resource=""#hasMaker"" />

     <owl:allValuesFrom rdf:resource=""#Winery"" />

    </owl:Restriction>

  </rdfs:subClassOf>

</owl:Class>"
웹 운영 체제,Web Operating System,"Web OS, WOS",,"웹 표준 기술 기반의 소프트웨어 개발 인터페이스를 제공하는 운영 체제.
표준을 따르므로 소프트웨어의 상호 호환성이 우수하고, 기기의 제조사별 특성이나 기술 사양에 영향 받지 않는다. PC, 스마트폰, 태블릿PC 등의 컴퓨팅 기기와 웹 서비스만을 위한 클라우드 단말, 스마트 TV, 냉장고 등의 스마트 가전제품에 사용된다. 대표적인 웹 운영 체제로 크롬 OS, 타이젠, 웹오에스(webOS) 등이 있다.

마이크로소프트 윈도우(Microsoft Windows)나 애플(Apple)의 맥OS(macOS) 같은 독자적 운영 체제는 서로 다른 이용 환경을 제공하고, 소프트웨어 개발에 필요한 응용 프로그래밍 인터페이스(API)도 각각 독자적으로 만들어 제공한다. 이와 같은 제조사별 고유 OS의 단점은 제품 개발 시 새로운 OS에 능숙한 소프트웨어 개발자를 신속히 확보하기 어렵고, 사용자는 OS별 환경에 맞춰 이용해야 하는 제약이 있다는 것이다. 웹 운영 체제(WOS)는 월드 와이드 웹 컨소시엄(W3C)의 국제 웹 표준을 바탕으로 하기에, 사용자는 제품 기기의 환경과 관계없이 인터넷에 접속된 웹 브라우저에서 앱을 이용할 수 있다. 그리고 웹 개발자는 기존에 알고 있는 웹 개발 지식으로 기기에 상관없이 웹 앱을 개발할 수 있다. 웹의 사용 환경, 소스 코드 재사용, 웹 자원 관리, 웹 보안 등 웹 생태계 구축이 기존 독자적 OS 환경보다 쉽다.
일반적으로 웹 운영 체제는 리눅스(Linux)를 기초로 하고 그 위에 웹 플랫폼을 올리는 형태로 개발된다. 대표적인 웹 운영 체제로 구글(Google)의 크롬(Chrome) OS, 삼성전자의 타이젠(Tizen), LG전자의 웹OS(webOS) 등이 있다.

※ 웹 생태계는 웹 기반으로 하는 모든 것을 의미하며, 웹 개발자, 웹 소프트웨어, 웹 서비스, 웹 소프트웨어 개발 도구, 웹 플랫폼 제공자, 웹 소프트웨어 및 서비스 사용자 등을 포함한다.
※ LG전자의 웹 운영 체제의 이름은 'webOS'로, 표기 혼동에 주의해야 한다."
자연어 처리,Natural Language Processing,NLP,,"컴퓨터를 이용해 사람의 자연어를 분석하고 처리하는 기술.
요소 기술로 자연어 분석, 이해, 생성 등이 있으며, 정보 검색, 기계 번역, 질의응답 등 다양한 분야에 응용된다.

자연어는 일반 사회에서 자연히 발생하여 사람이 의사소통에 사용하는 언어로, 컴퓨터에서 사용하는 프로그래밍 언어와 같이 사람이 의도적으로 만든 인공어(constructed language)에 대비되는 개념이다.
자연어 처리에는 자연어 분석, 자연어 이해, 자연어 생성 등의 기술이 사용된다. 자연어 분석은 그 정도에 따라 형태소 분석(morphological analysis), 통사 분석(syntactic analysis), 의미 분석(semantic analysis) 및 화용 분석(pragmatic analysis)의 4 가지로 나눌 수 있다. 자연어 이해는 컴퓨터가 자연어로 주어진 입력에 따라 동작하게 하는 기술이며, 자연어 생성은 동영상이나 표의 내용 등을 사람이 이해할 수 있는 자연어로 변환하는 기술이다.
자연어 처리는 인공 지능의 주요 분야 중 하나로, 1950년대부터 기계 번역과 같은 자연어 처리 기술이 연구되기 시작했다. 1990년대 이후에는 대량의 말뭉치(corpus) 데이터를 활용하는 기계 학습 기반 및 통계적 자연어 처리 기법이 주류가 되었으며, 최근에는 심층 기계 학습(deep learning) 기술이 기계 번역 및 자연어 생성 등에 적용되고 있다.

※ 통사 분석(syntactic anaylisys): 컴퓨터 분야에서는 ‘구문 해석’이라 하나 언어학에서는 ‘통사 분석’이라 함. 통사는 생각이나 감정을 말과 글로 표현할 때 완결된 내용을 나타내는 최소의 단위.
※ 통사: 주어와 서술어를 갖추고 있는 것이 원칙이나 때로 이런 것이 생략될 수도 있다. 글의 경우, 문장의 끝에 ‘.’, ‘?’, ‘!’ 따위의 마침표를 찍는다. ‘철수는 몇 살이니?’, ‘세 살.’, ‘정말?’ 따위이다. (출처: 우리말샘)
※ 화용(話用) 분석: 말하는 이, 듣는 이, 시간, 장소 따위로 구성되는 맥락과 관련하여 문장의 의미를 체계적으로 분석하는 것"
챗봇,Chatbot,,"채터봇(Chatterbot), 대화 로봇","문자 또는 음성으로 대화하는 기능이 있는 컴퓨터 프로그램 또는 인공 지능.
사람처럼 자연스러운 대화를 진행하기 위해 단어나 구(句)의 매칭만을 이용하는 단순한 챗봇부터 복잡하고 정교한 자연어 처리 기술을 적용한 챗봇까지 수준이 다양하다. 챗봇은 채터봇(chatterbot), 토크봇(talkbot) 등의 이름으로도 불린다.

초창기 웹 검색 엔진 중 하나인 라이코스(Lycos)의 개발자인 마이클 로렌 몰딘(Michael Loren Mauldin)이 1994년 미국의 전국 인공 지능 학술 대회(National Conference on Artificial Intelligence)에서 발표한 논문에 채터봇(ChatterBot)이라는 용어가 등장한 것이 최초로 알려져 있다. 1960년대에도 문자로 간단한 대화를 할 수 있는 수준의 소프트웨어가 있었는데, 대표적으로 엘리자(ELIZA)가 있다. 2000년대 초반에는 인터넷의 발달과 함께 대화형 메신저 형태의 챗봇이 다수 개발되었으며, 페이스북 메신저(Facebook Messenger)는 자연어 처리 기반 챗봇을 개발하는 데 필요한 소프트웨어 도구를 제공하고 있다.
챗봇은 전자상거래, 은행 등 다양한 분야에서 고객 지원이나 정보 습득과 같은 영역에 활용되고 있다. 대표적으로, 뱅크 오브 아메리카(Bank of America), 스타벅스(Starbucks)와 디즈니(Disney) 같은 기업은 주문 및 고객 응대에 챗봇을 이용하고 있다."
온톨로지,Ontology,,,"존재하는 사물과 사물 간의 관계 및 여러 개념을 컴퓨터가 처리할 수 있는 형태로 표현하는 것.
어떤 일정 범위에서 사용되는 단어들의 개념, 특성, 연관 관계 등을 표현하여 단어에 대한 일반적 지식이 명시적으로 드러나고, 단어 간 관계 정의를 통해 문장의 의미를 파악할 수 있다. 스탠포드 대학의 그루버(Thomas A. Gruber) 교수는 온톨로지를 ‘일반적으로 개념화된 것을 형식적으로 명백하게 기술하는 명세(an explicit formal specification of a shared conceptualization)’라고 정의하였다(1992).
온톨로지는 인공 지능(AI), 시맨틱 웹(semantic web), 자연어 처리(NLP: Natural Language Processing), 문헌정보학 등 여러 분야에서 지식 처리, 공유, 재사용 등에 활용된다.

온톨로지는 사물의 본질, 존재의 근본 원리를 사유나 직관에 의하여 탐구하는 형이상학(Metaphysics)의 한 분야인 존재론(ontology)을 기반으로 실재(reality)에 대한 정확한 이해를 추구하는 철학에서 유래한다.
※ 1613년 고클레니우스(Rudolf Goclenius)가 ‘존재의 보다 일반적 속성을 탐구하는 이론’에 존재론(ontologia)이라는 이름을 붙였다.
온톨로지 용어가 정보 시스템에 사용하게 된 것은 1980년대 인공 지능(AI) 연구자들이 AI 구축의 핵심 요소로 지식 공학(knwledge engineering)을 연구하면서 온톨로지(ontology) 용어를 사용하기 시작했다.
온톨로지는 클래스(class, 또는 개념[concept]), 인스턴스(instance, 또는 indivisual), 속성(property), 관계(relation) 등의 구성 요소로 표현된다. 클래스는 사물의 개념(concept), 즉 범주(category)를, 인스턴스는 개별 요소인 실체(entity)를 뜻한다. 속성은 클래스와 인스턴스의 특성(feature)을 나타내며, 관계는 클래스 및 인스턴스 간의 관계성을 표현한다. 예를 들어, ‘평창’ 인스턴스는 ‘2018년 동계 올림픽 개최’라는 속성으로 ‘올림픽’ 클래스와 관계를 맺는다. 따라서 ‘올림픽’을 검색하면 ‘평창’이 연관 검색어로 나온다.
특정 범주의 온톨로지를 구축하는 방법론을 연구하는 학문을 ‘온톨로지 공학(ontology engineering)’이라 한다. 소프트웨어 응용 프로그램, 비즈니스 거래에서 용어나 클래스 등에 대한 의미 해석이 달라 발생할 수 있는 상호 운영성 문제를 예방할 수 있다.
온톨로지 작성에 사용되는 대표적인 언어로, 웹상의 정보 처리에 사용되는 웹 온톨로지 언어(OWL: Web Ontology Language)와 형태 제약 언어(SHACL: Shapes Constraint Language), 비즈니스 정보 거래에 사용되는 확장성 비즈니스 보고 언어(XBRL: eXtensible Business Reporting Language), 지식 기반 시스템(knowledge-based system)에서 정보를 공유하고 재사용하는 데 쓰이는 지식 교환 형식(KIF: Knowledge Interchange Format) 언어와 술어 논리 기반의 공통 논리(CL: Common Logic, ISO/IEC 24707) 언어 등이 있다."
하이퍼텍스트 보안 전송 프로토콜,HyperText Transfer Protocol Secure,HTTPS,,"웹 클라이언트인 브라우저와 서버 간의 안전한 통신을 지원하기 위해 HTTP의 전송 계층에 암호 통신 규약을 적용한 웹 표준 기술.
암호 규약으로 전송 계층 보안(TLS: Transport Layer Security)이 사용되며, 정보 불법 도청이나 변조 등을 방지하여 안전하고 신뢰가 가는 통신을 제공한다.

HTTPS의 기본 목적은 웹 사이트 접근 인증과 데이터 무결성이다. 즉, 웹 브라우저와 서버 사이에 중간자가 침입하여 전달되는 정보를 도청하거나 조작하는 중간자 공격을 막기 위한 것이다. W3C 국제 표준화 기구는 웹의 안전한 사용 환경을 위해 2014년부터 주요 웹 브라우저 개발업체들과 HTTPS로 전환 사용을 협력하고 있다. 구글(Google), 페이스북(Facebook), 애플(Apple), 삼성전자 등 주요 글로벌 기업을 포함하여 많은 웹 서비스 기업들이 HTTPS로 전환하였다.
HTTP 인터넷 주소(URL)는 ‘http://'로 시작하고 기본 80번 포트를 사용한다. 반면, HTTPS 인터넷 주소(URL)은 'https://'로 시작하며(예: https://terms.tta.or.kr), 443번 포트를 기본으로 사용한다.

HTTPS는 공식적으로 2000년 IETF RFC 2818 표준으로 처음 제정되었다.

※ TLS 프로토콜은 보안 소켓 계층(SSL: Security Sockets Layer) 규약 3.0 버전에서 개정되었다(1999)."
스리지피피,3rd Generation Partnership Project,3GPP,,"이동 통신 표준을 제정하는 사실 표준화 기구.

3세대 이동 통신 시스템인 IMT-2000 표준인 광대역 부호 분할 다중 접속(WCDMA: Wideband CDMA) 표준을 개발하기 위해 1998년 유럽 전기 통신 표준 협회(ETSI)를 중심으로 일본 전파산업회(ARIB)와 정보통신기술위원회(TTC), 중국통신표준협회(CCSA), 미국 정보통신표준협회(ATIS), 한국정보통신기술협회(TTA)가 참여하여 설립하였다.
현재 인도 표준개발기구(TSDSI)까지 총 7개 표준화 기구가 3GPP 무선 접속망, 핵심 전송 망, 서비스 요건 등 이동 통신망 기술 표준을 공동 개발하고 있다.

대표 3GPP 표준으로 초기의 릴리즈 98, 99를 거쳐 All-IP 핵심망의 릴리즈 4, IMS(IP Multimedia Subsystem)와 고속 하향 패킷 접속(HSDPA: High Speed Downlink Packet Access)이 추가된 릴리즈 5, 무선 랜(WLAN) 연동과 고속 상향 패킷 접속(HSUPA, High Speed Uplink Packet Access)가 추가된 릴리즈 6, VoIP(Voice over IP)와 고속 패킷 접속 에볼루션(HSPA Evolution, 또는 HSPA+) 릴리즈 7이 있다. HSPA+는 릴리스 8, 9, 10 등 이후에도 표준이 진화되었다. LTE 기술은 릴리즈 8과 릴리즈 9에 포함되었고, 이후 LTE-Advanced는 릴리즈 10, 11, 12에, LTE-Advanced Pro는 릴리스 13부터 포함되었다.

※사실 표준(de facto standard): 시장에서 표준으로 인정받거나, 필요에 따라 업계를 중심으로 결성된 사실 표준화 기구에서 제정되는 표준.
※TSDSI: Telecommunications Standards Development Society, India
※3GPP 설립과 같은 해(1998년)에 동기식 IMT-2000 표준인 CDMA2000 개발을 위해 미국의 퀄컴사를 중심으로 미국 통신산업협회(TIA), 일본의 ARIB/TTC, 중국의 CCSA, 우리나라의 TTA 등은 3GPP2 사실 표준화 기구를 설립하였다."
지식 기반 시스템,Knowledge-Based Systems,KBS,,"특정 분야의 전문 지식으로 구성된 지식 베이스(knowledge base)에 기초한 추론으로 복잡한 문제를 해결하는 컴퓨터 시스템.

지식 기반 시스템은 인공 지능(AI) 초창기에 개발되었던 간단한 탐색 기반 기술의 한계인 영역 지식(domain knowledge)과 계산 능력의 부족을 극복하기 위해 제안되었다. 대표적인 지식 기반 시스템(KBS)의 예로 1970년대 개발된 분석화학 분야의 특정 문제 해결에 사용된 덴드럴(DENDRAL)과 혈액 감염 진단용 마이신(MYCIN) 등이 있다. 이러한 지식 기반 시스템은 특정 분야의 전문가를 모방해서 만들어져 전문가 시스템(expert system)이라고도 한다.
지식 기반 시스템(KBS)의 가장 큰 특징은 데이터인 ‘지식’과 알고리즘인 ‘추론’을 분리한 점이다. 지식 기반 시스템의 지식 베이스는 이프덴(if-then) 규칙, 명제 논리, 술어 논리, 확률론 등 다양한 형태에 기반할 수 있으며, 지식의 내용과는 독립적인 추론 엔진을 사용하여 문제를 해결한다.

※ 지식 베이스(knowledge base): 특정 분야의 전문 지식과 문제 해결에 필요한 사실과 규칙 등이 저장된 데이터베이스"
이노드비,"evolved Node B, E-UTRAN Node B","eNodeB, eNB",,"엘티이(LTE: Long Term Evolution) 이동 통신 기지국.
이동 통신 사실 표준화 기구 3GPP에서 사용하는 공식 명칭이다.

3GPP는 기존 3세대(3G) 이동 통신 기지국의 이름 ‘Node B’와 구별하여 LTE의 무선 접속망 E-UTRAN(Evolved UTRAN) 기지국을 ‘E-UTRAN Node B’ 또는 ‘evolved Node B’라 하였다. 주로 줄임말 eNodeB(eNB)로 사용한다.
eNodeB 기지국은 단말(UE: User Equipment)과 무선으로 연결되어 핵심망(EPC: Evolved Packet Core)과의 통신 중계 역할을 한다.
기존 3G 이동 통신의 무선 접속망 UTRAN(UMTS: UMTS Terrestrial Radio Access Network)에서 기지국(Node B)은 기지국 제어기(RNC: Radio Network Controller)와 분리된 구조였던 반면에 LTE 이동 통신의 E-UTRAN에서는 별도의 기지국 제어기 없이 eNodeB가 직접 핵심망에 연결되는 평면 구조이다. 즉, eNodeB는 기존 3G 망의 기지국과 기지국 제어기의 기능을 수행한다.

 시스템
3G
 LTE, 4G
5G
 전체 이동통신 시스템
UMTS
 EPS
5GS
 무선 접속 기술
UTRA 
 E-UTRA
 NR 또는 E-UTRA
 무선 접속망
UTRAN
 E-UTRAN
 NG-RAN
 기지국
Node B 
 eNodeB
 gNodeB
 "
반응형 웹,Responsive web,,,"단말의 종류와 화면 크기에 실시간 반응하여 웹 페이지를 최적화된 화면 구성으로 보여주는 웹.

스마트폰 같은 모바일 단말의 이용량이 늘면서 데스크톱 위주의 기존 웹 사이트가 작은 화면에는 적당하지 않아 웹 페이지를 사용자의 화면 크기에 자동으로 맞춰 보여주는 기술이 필요하게 되었다.
반응형 웹 구현에 사용되는 대표적인 기술은 종속 스타일 시트 3 버전(CSS3: Cascading Style Sheets version 3)이다. 웹 문서 내 미디어 스타일 설정에 사용하는 미디어 쿼리(media query)를 이용하면 단말 화면의 폭이나 높이에 따라 레이아웃이 자동으로 구성된다. 글자 크기를 자동으로 조정하기 위해서는 폰트의 고정 크기 단위인 px(픽셀)이 아닌 상대 단위인 em(엠)을 사용하면 된다. 또 이미지 크기는 상대 비율 단위인 %를 이용하면 반응형 웹 화면을 구현할 수 있다.
화면 크기에 대응하여 웹 페이지의 레이아웃이 바뀌는 반응형 웹과 달리 웹 페이지를 다양한 화면 크기별로 미리 제작하여 보여주는 ‘적응형 웹(Adaptive web)' 방식도 있다."
스마트 팜,Smart farm,,"스마트 농장, 스마트 온실, 스마트 축사, 스마트 양식장","농·림·축·수산물의 생산, 가공, 유통 단계에서 정보 통신 기술(ICT)을 접목하여 지능화된 농업 시스템.
사물 인터넷, 빅데이터, 인공 지능 등의 기술을 이용하여 농작물, 가축 및 수산물 등의 생육 환경을 적정하게 유지·관리하고, PC와 스마트폰 등으로 원격에서 자동 관리할 수 있어, 생산의 효율성뿐만 아니라 편리성도 높일 수 있다.

ICT 기술을 활용한 스마트팜 기술을 통해 환경 정보(온도·상대습도·광량·이산화탄소·토양 등) 및 생육 정보에 대한 정확한 데이터를 기반으로 생육 단계별 정밀한 관리와 예측 등이 가능하여 수확량, 품질 등을 향상시켜 수익성을 높일 수 있다. 또한, 노동력과 에너지를 효율적으로 관리함으로써 생산비를 절감할 수 있다. 예를 들면, 기존에는 작물에 관수할 때 직접 밸브를 열고 모터를 작동해야 했다면, 스마트 팜에서는 전자밸브가 설정값에 맞춰 자동으로 관수를 한다. 또한, 스마트 팜은 농·림·축·수산물의 상세한 생산 정보 이력을 관리할 수 있어 소비자 신뢰도를 높일 수 있다.
스마트 팜은 응용 분야에 따라 스마트 농장, 스마트 온실, 스마트 축사, 스마트 양식장 등의 이름으로 사용되고 있다.

※ 관계부처합동 '스마트팜 확산방안'(2018.4)의 스마트팜: 사물인터넷, 빅데이터 등을 활용해 최적의 생육환경을 자동으로 제어하는 농장"
초고신뢰?저지연 통신,Ultra-Reliable and Low Latency Communications,URLLC,,"5세대 이동 통신(5G) 망에서 데이터 전송의 신뢰도가 매우 높고 지연 시간이 매우 짧은 통신.
이동 통신 국제 표준 IMT-2020의 사용 시나리오 중 하나이며, 자율 주행 자동차, 공장 자동화, 가상 현실 및 증강 현실, 원격 진료 등과 같은 서비스에 필요하다. IMT-2020 표준에서 URLLC의 기술 성능 요건으로 1 밀리초(ms) 이하의 지연 시간과 10-5의 데이터 전송 패킷 오류율을 정하고 있다.

IMT-2020 표준에서 고려하는 5G 주요 사용 시나리오는 URLLC 외에 초광대역 이동 통신(eMBB: enhanced Mobile BroadBand), 대규모 사물 통신(mMTC: massive Machine-Type Communications) 등이 있다.
ITU의 IMT-2020 표준과 달리 3GPP 표준은 URLLC 지연 시간으로 0.5 ms를 요구 사항으로 정의하였고, URLLC의 요구사항을 구현하기 위해 전송 시간 간격(TTI: Transmission Time Interval)을 줄인 슬롯(slot) 구조를 새로 만들었다. 스케줄링(scheduling) 기법 개선, 데이터 중복 전송 등의 방안을 고려하고 있다."
면허 대역 지원 접속,License Assisted Access,LAA,,"엘티이(LTE) 이동 통신망에서 기지국이 면허 대역을 주요 요소 운반파로 사용하고, 면허 불필요 대역을 보조 요소 운반파로 사용하는 운반파 묶음(CA: Carrier Aggregation) 기술.

폭증하는 이동 통신 트래픽을 수용하기 위해 개발된 대역폭 확장 기술이다. 보조 요소 운반파(SCC) 관점에서 면허 대역을 사용하는 주요 요소 운반파(PCC)의 지원을 받아 무선 접속을 하기 때문에 LAA라고 부른다. 면허 불필요(unlicensed) 대역이 면허 대역의 보조 대역으로 사용되어 기지국에서 단말로의 하향 링크 데이터 전송 속도가 높아진다. 이동 통신 표준화 기구 3GPP에서 LAA 표준을 제정하였다.

단말은 항상 LTE 면허(licensed) 대역으로 통신하지만, 기지국은 망 상황에 따라 면허 대역과 면허 불필요(unlicensed) 대역을 사용하여 면허 대역의 트래픽 일부를 면허 불필요 대역으로 전송할 수 있다. 이때 면허 불필요 대역을 추가 사용하기 위해 여러 개의 요소 운반파(CC: Component Carrier)를 묶어(3GPP Release 13 표준은 최대 32개로 정함) 대역폭을 확장할 수 있는 운반파 묶음(CA) 기술이 사용된다.
LAA에서 면허 대역은 주요 요소 운반파(PCC: Primary CC)로서 중요한 제어 기능을 수행하고, 면허 불필요 대역은 보조 요소 운반파(SCC: Secondary CC)로 설정된다. SCC로 사용자 데이터를 추가하여 보낼 수 있어 데이터 전송 속도를 높이는 역할을 한다. LAA는 하향 링크 데이터 전송 속도를 높이는 장점이 있는 반면, 와이파이(Wi-Fi), 블루투스(Bluetooth) 등의 다양한 통신 시스템과 면허 불필요 대역을 함께 사용하여 시스템 간 간섭을 일으킬 수 있다. 이를 위해, 3GPP LTE 표준은 LAA 지원 기술로 채널 상태를 확인 후 빈 채널로 전송하는 LBT(Listen-before-talk), 우선순위에 따라 채널을 사용하는 동적 주파수 선택(DFS: Dynamic Frequency Selection) 등을 채택하였다(3GPP Release 13 LTE-LAA)."
하이브리드 빔 형성,Hybrid beamforming,,하이브리드 빔포밍,"기저 대역에서 채널의 상태 정보(CSI: Channel State Information)를 토대로 디지털 빔 형성을 한 후에 무선 주파수(RF) 체인을 거쳐 아날로그 빔 형성을 하는 기술.
디지털 빔 형성을 모든 안테나에 적용하는 것에 비해 상대적으로 비용이 적게 들며 복잡도가 낮다. 경로 손실이 큰 밀리미터파(millimeter wave) 대역에서 충분한 전송 거리를 얻기 위해 사용하는 대량 다중 입력 다중 출력(massive MIMO) 안테나 시스템에 효과적으로 적용될 수 있다.

5G 이동 통신에서는 대역폭이 넓은 채널을 사용하기 위하여 밀리미터파) 대역을 활용한다. 그러나 개별 안테나의 개구 면적이 작으면 밀리미터파의 경로 손실이 높아지는 문제가 있으므로, 송신단과 수신단에 massive MIMO 기술을 활용한 수십 개 이상의 안테나를 구축하여 경로 손실을 보상하고 대용량의 데이터를 송수신할 수 있도록 한다. 단, massive MIMO의 안테나 시스템을 디지털 빔 형성만으로 구현하는 경우 과도한 복잡도와 비용이 소요될 수 있어서 디지털 빔 형성 기술과 아날로그 빔 형성 기술의 장점을 결합한 하이브리드 빔 형성 기술을 활용한다."
차량?사물 셀룰러 통신,Cellular Vehicle-to-Everything,"C-V2X, Cellular V2X",,"엘티이(LTE), 5G와 같은 셀룰러 이동 통신망을 통해 차량이 다른 차량이나 교통 인프라, 보행자, 네트워크 등과 정보를 서로 주고받는 차량 통신 기술.
이동 통신 표준화 기구 3GPP에서 2017년 LTE 기술을 활용한 Celluar V2X를 표준으로 채택하였다(3GPP Release 14).

차량이 보행자나 자전거 탑승자 등 개인(pedestrian)이 소지한 이동 단말, 다른 차량(vehicle), 도로 인프라(infrastructure) 등과 통신망을 통해 다른 차량의 정보나 교차로 통제 등 정보를 교환하여 차량 안전 향상, 자율 주행, 군집 주행 등에 활용하는 것을 차량·사물 통신(V2X)이라 한다. V2X의 무선 통신 시스템으로 IEEE 802.11p(Wi-Fi 표준 IEEE 802.11 계열) 기반의 차량 환경용 무선 접속(WAVE: Wireless Access Vehicular Environment), 차량용 단거리 전용 통신(DSRC: Dedicated Short Range Communications) 등을 사용한다.
C-V2X는 3GPP에서 셀룰러 이동 통신 기술 기반으로 만든 V2X로, 기존 WAVE와 DSRC 보다 서비스 영역이 넓고 데이터 전송 속도가 빠르다. 따라서 고속으로 주행하는 차량 간(V2V), 차량과 보행자 간(V2P), 차량과 인프라 간(V2I)에 정보를 실시간으로 전달할 수 있다. 차량과 차량, 차량과 노변 기지국(RSU: Road Side Unit) 통신은 단말 간 직접 통신(D2D)이다. 한편 차량과 기지국 사이, RSU와 기지국 사이는 LTE 이동 통신(V2N: Vehicle-to-Network) 기술을 사용하여 교통 정보를 실시간으로 전달할 수 있을 뿐만 아니라 수 킬로미터 전방의 교통 상황 정보 등도 실시간에 제공한다.
※ 3GPP 릴리즈 14 표준의 셀룰러 V2X 기술보다 향상된 차량 통신 기술 표준(enhanced V2X)을 릴리즈 15로 개발하였다."
페이지랭크,PageRank,,,"인터넷 검색 엔진에서 웹사이트 검색 순위를 정하는 알고리즘.

검색된 웹사이트들 중 다른 웹사이트의 링크를 많이 받는 웹사이트가 중요할 것이라는 개념하에 구글(Google)의 창립자인 래리 페이지(Larry Page)와 세르게이 브린(Sergey Brin)이 개발한 알고리즘이다. PageRank는 래리 페이지의 ‘Page'라는 이름을 따서 명명하였다.
검색 순위를 매기는 방법은, 기본적으로 페이지 내에 다른 웹사이트를 참조한 링크가 있으면 해당 링크가 클릭되는 횟수와 링크가 다른 웹사이트에 얼마나 많이 참조되는지를 토대로 웹사이트에 점수를 매긴다. 그러나, 참조 횟수가 적더라도 검색 순위가 높은 웹사이트가 참조하는 경우에는 점수를 많이 받는다. 검색 엔진은 검색된 웹사이트들의 점수가 높은 순서대로 표시한다.
예를 들어, 그림에서 C 웹사이트는 다른 웹사이트들과 연결된 링크가 E 웹사이트보다 훨씬 적지만, 점수가 높은(즉, 중요도가 높은) B 웹사이트에서 C 웹사이트를 참조하기 때문에 E보다 점수가 높게 매겨진다."
엔진엑스,Nginx,,,"웹 서버용 오픈 소스 소프트웨어.
엔진엑스(Nginx)가 제공하는 각 기능은 모듈화되어 있어 효율적인 운영을 할 수 있고, 아파치(Apache) 웹 서버 소프트웨어보다 메모리 사용이 효율적이며 클라이언트 처리 속도가 더 빠르다.

러시아의 프로그램 개발자인 이고르 시쇼브(Igor Sysoev)가 개발하여 2004년 발표하였다.
웹 서버 소프트웨어로 많이 사용되는 아파치(Apache)는 사용자 트래픽이 폭증하는 경우 신속히 처리하지 못하는 문제가 있다. 엔진엑스(Nginx)는 이러한 문제점을 해결하기 위해 개발된 것으로, 메모리를 사용량이 적어 비교적 가볍고 대량 접속 문제를 신속히 효율적으로 처리한다. Nginx는 기본적인 웹 서버 기능 외에 추가로 ‘캐싱(caching)’, ‘트래픽 부하 균형(load balancing)’, ‘TLS/SSL 보안’, ‘메일 프록시’ 등의 기능을 제공한다."
연계 데이터용 제이슨,JavaScript Object Notation for Linked Data,JSON-LD,,"웹에서 용량이 적은 링크드 데이터(linked data)를 교환하기 위해 제이슨(JSON) 기반으로 연계 데이터의 의미를 표현하고 서비스 간 연동을 제공하는 데이터 표현 형식.

텍스트 형식의 제이슨(JSON: JavaScript Object Notation) 데이터 교환 형식을 사용하여, 사람이 읽고 작성하기 쉽다. 링크된 데이터를 기반으로 데이터 객체 내에 속성 정보뿐만 아니라 속성 정보의 인터넷 위치(URL)를 함께 제공하여 서로 다른 서비스 간에도 데이터 연계가 가능하다. 월드 와이드 웹 컨소시엄(W3C)에서 JSON-LD 표준을 제정하였다(2014).

JSON 형식 표기법과 같이 ‘속성(name): 값(value)’ 한 쌍 구조로 데이터의 각 객체를 표현한다.
JSON LD는 총 17개의 속성 키워드를 규정한다. 각 키워드 앞에는 @을 붙여 해당 속성이 JSON LD 키워드임을 표현한다. 가장 기본적인 @context는 데이터의 의미를 알려주는 사전적 정의를 URL 기반으로 제공하고, @id는 데이터의 고유 식별자를 표현하며, @type은 데이터의 종류가 무엇인지 알려준다. 이 밖에 @base, @container, @graph, @index, @language, @list, @nest, @none, @prefix, @reverse, @set, @value, @version, @vocab 등의 키워드가 있다.
아래 예시는, @context 값을 통해 해당 데이터의 사전적 정의가 http:// schema.org 이라는 URL에 정의되어 있고, 해당 데이터가 특정 '사람(person)'에 대한 것이며, 데이터의 고유 식별자가 무엇인지 등을 알려준다.

{
""@context"": ""http:// schema.org/"",
""@type"": ""person"",
""@id"": ""http:// dbpedia.org/resource/John_Lennon"",
""name"": ""John Lennon"",
""born"": ""1940-10-09"",
“email"": “john@beetles.com”,
“phone"": ""(031)000-0000""

}

※ 연계 데이터(linked data): 데이터를 웹상에 게시할 때 해당 데이터에 인터넷 식별자(URI: Uniform Resource Identifier)를 부여하고 또 다른 데이터와의 관계나 하위 정보 역시 URI 기반으로 제공하여 서로 다른 웹 서비스의 데이터끼리도 연계될 수 있도록 구조화된 데이터 세트."
하이퍼텍스트 전송 규약 2.0,HyperText Transfer Protocol Version 2.0,HTTP/2,,"웹 콘텐츠의 전송 속도를 높이고 보안을 강화한 하이퍼텍스트 전송 규약 2.0 버전.
웹이 복잡한 응용 개발을 위한 플랫폼 기술로 발전하면서 요구되는 성능 최적화에 목적을 두고 개발되었다. 바이너리 기반의 프레이밍 전송 계층(binary framing layer), 서버 푸시, 헤더 압축, 요청 및 응답 다중화, 전송 계층 보안(TLS: Transport Layer Security) 프로파일 등 새로운 기술이 추가되어 빠른 성능과 보안이 강화되었다.

웹 페이지 로딩 시간을 50% 줄이는 것을 목표로 구글(Google)사에서 2009년 개발한 개방형 전송 규약인 스피디(SPDY, SPeeDY로 발음)를 토대로 인터넷 엔지니어링 태스크 포스(IETF)에서 표준으로 개발하였다(2015년 IETF RFC 7540).
기존 HTTP 1.1 버전에서 새로 추가된 사항은 다음과 같다. HTTP 메시지를 바이너리 형식으로 캡슐화하여 프레임 단위로 전송함으로써 요청 및 응답 메시지 전송 효율성을 높인 바이너리 프레이밍 계층(binary framing layer), 다수의 요청/응답을 동시 처리하는 요청 및 응답 다중화(request/response multiplexing), 반복 사용되는 헤더 정보의 전송을 최소화한 헤더 압축(header compression), 클라이언트가 요청하지 않아도 필요가 예상되는 리소스를 서버가 미리 전송하는 서버 푸시(server push), 연결 초기에 서버 지원 프로토콜 리스트를 제공하는 프로토콜 교섭(Protocol Negotiation) 등이다. 2015년 말부터 인터넷 익스플로러 11, 크롬(Chrome), 오페라(Opera), 사파리(Safari), 에지 브라우저(Edge browser) 등 주요 브라우저에 적용되었다.

[참고] HTTP는 1989년 영국의 컴퓨터 과학자인 팀 버너스 리(Tim Berners-Lee) 경이 월드 와이드 웹(World Wide Web)을 고안하면서 설계된 프로토콜이다. 이때의 버전을 추후 버전과 구분하기 위해 HTTP/0.9로 정의한다. 이 버전은 매우 단순했고 GET 메소드만을 지원했다. 그 후 1996년 공개된 HTTP/1.0 버전은 확장성을 지원하도록 개선되었다. 즉, 요청 메시지에 버전 정보 추가되었고, 요청 결과에 대한 성공 또는 실패 상태 코드 추가되었다. 또한 요청 및 응답 메시지에 유연하게 확장할 수 있는 HTTP 헤더가 포함되었다. 1997년 공개된 HTTP/1.1 버전은 TCP 연결(connection)이 유지되는 동안 요청 메시지를 연속적으로 여러 개 보낼 수 있는 파이프라이닝(pipelining), 캐시 제어 메커니즘 개선 등 성능과 사용 면에서 개선되었다."
서비스 워커,Service worker,,,"웹 브라우저가 실행하지 않는 상태에서도 브라우저의 고유 기능을 백그라운드로 실행할 수 있는 스크립트.
기존 웹 스크립트(자바스크립트)는 브라우저 사용자 인터페이스(UI)와 상호 작용을 하면서 실행하나, 서비스 워커(Service worker) 스크립트는 브라우저 UI 또는 웹 페이지와 별개로 백그라운드에서 실행한다. 인터넷 연결이 되지 않는 오프라인 환경에서도 웹 메일과 같은 웹 애플리케이션을 사용할 수 있고 브라우저가 종료된 상태에서도 푸시 알림 등을 지원한다.

크롬(Chrome), 사파리(Safari), 파이어폭스(Firefox), 에지 브라우저(Edge browser) 등 대부분의 주요 웹 브라우저에서 지원한다. 월드와이드웹 컨소시엄(W3C)은 2014년 서비스 워커(Service worker) 서비스 표준 개발을 시작하였다.

웹의 가장 큰 단점은 인터넷 연결이 끊어진 오프라인 상태에서 웹 페이지를 볼 수 없다는 것이다. 예를 들어, 구글의 지메일(Gmail)과 같은 웹 메일은 오프라인에서 이용할 수 없다. 이러한 웹 애플리케이션의 문제를 해결하기 위해서 HTML5 표준의 일부로 오프라인 환경을 지원하는 애플리케이션 캐시(Application Cache, AppCache) 표준이 개발되었다. 그러나 AppCache 표준이 여러 웹 페이지로 구성된 웹사이트 적용에 문제가 발생하여 서비스 워커(service worker) 기술이 대안으로 고안되었다.
서비스 워커는 웹 애플리케이션 또는 웹 서비스를 구성하는 HTML, CSS, 자바스크립트, 이미지, 동영상 등 다양한 리소스들에 대해서 적합한 캐시(cache) 제어 기능을 지원하여 네이티브 앱과 같이 오프라인에서도 이용할 수 있도록 한다. 즉, 웹 애플리케이션의 리소스 중 갱신되지 않는 리소스를 로컬에 처음 한번만 저장(캐싱)하고, 이후 재실행되면 로컬에 저장된 리소스를 사용하게 하여 오프라인 이용을 제공한다. 또한, 메신저 앱을 실행하지 않은 상황에서 새로운 메시지를 받을 수 있도록 지원하는 앱의 푸시 알림 같은 기능을 웹에서도 가능하게 한다. 즉 브라우저가 실행되지 않은 상황에서도 서비스 워커 코드가 백그라운드에서 실행되면서 푸시 알림이 오면 이를 처리하여 받은 메시지를 팝업 창으로 보여줄 수 있다. 즉, 서비스 워커는 백그라운드에서 자바스크립트 코드를 실행시킬 수 있는 범용적인 기능으로, 오프라인 지원, 푸시 알림 지원뿐 아니라 가상의 영역을 정의하고 그 지역을 넘어갔을 때 이를 인식하여 처리하는 지오펜싱(geofencing) 같은 다양한 기능 구현에 응용될 수 있다.

※ 지오펜싱(geofencing): 특정 영역에 가상 울타리(geo-fence)를 치도록 지원하는 API"
타입스크립트,TypeScript,,,"웹 클라이언트와 서버 프로그램 개발에 모두 사용되는 오픈 소스 프로그래밍 언어.
마이크로소프트(Microsoft)에서 개발하였다. 자바스크립트(JavaScript)의 상위 언어로, 앵귤러제이에스(AngularJS), 리액트제이에스(ReactJS), 노드닷제이에스(Node.js) 등의 자바스크립트 기반 프로그램은 타입스크립트 프로그램으로도 동작한다.

타입스크립트는 터보 파스칼(Turbo Pascal)과 델파이(Delphi), 시샵(C#)의 핵심 개발자인 마이크로소프트(Microsoft)의 아네르스 하일스베르(Anders Hejlsberg)의 주도하에 개발된 언어이다. 2014년 개발자 컨퍼런스인 마이크로소프트 빌드(Microsoft Build)에서 타입스크립트의 1.0 버전이 공개되었다. 그 사이의 많은 마이너 업데이트와 변수들에 선택적으로 널(null) 값이 들어가는 것을 막을 수 있는 기능 등 몇몇 새로운 기능이 추가된 2.0 버전이 2016년 9월 22일 공개되었다. 2018년 릴리즈된 타입스크립트 3.0은 튜플 타입의 기능 확장, 미지정(unknown) 타입 추가, 프로젝트 참조 기능 등이 지원된다.
2017년 구글(Google)의 공식 개발 언어로 채택되어, 구글의 클라이언트 개발 환경에서 무제한 사용할 수 있다. 웹 애플리케이션 개발 프레임워크인 앵귤러제이에스(AngularJS) 개발에 타입스크립트 언어가 사용되었다."
강화형 기계 학습,Reinforcement learning,,강화 학습,"기계 학습 중 컴퓨터가 주어진 상태(state)에 대해 최적의 행동(action)을 선택하는 학습 방법.
강화형 기계 학습은 지도형/비지도형 기계 학습에 이용되는 훈련 데이터 대신, 주어진 상태에 맞춘 행동의 결과에 대한 보상(reward)을 준다. 컴퓨터는 보상을 이용하여 성능을 향상시킨다. 주로 게임이나 로봇 제어 등에 적용된다.

예를 들어, 체스를 두는 컴퓨터 프로그램을 학습시킬 때, 경우의 수가 너무 많고(약35의 100승) 정해진 하나의 답이 없으므로, 학습 훈련 데이터로 입력(주어진 상태)에 대한 출력(가장 적절한 행동)을 제공하기는 쉽지 않다. 하지만 체스 게임이 종료되면 그 직전에 둔 일련의 수(手, 행동)들이 좋았는지 나빴는지를 학습 알고리즘에게 알려 줄 수 있다. 이렇게 행동의 좋고 나쁜 정도를 학습 알고리즘에게 알려 주는 것을 보상(reward) 또는 강화(reinforcement)라고 하며, 이러한 정보를 이용하는 기계 학습이 강화형 기계 학습(이하, '강화 학습')이다.
강화 학습의 대상이 되는 컴퓨터 프로그램을 에이전트(agent)라고도 한다. 에이전트는 주어진 상태(state)에서 자신이 취할 행동(action)을 표현하는 정책(policy)을 수립한다. 에이전트가 최대의 보상을 받을 수 있는 정책을 수립하도록 학습시키는 것이 강화 학습의 목표이다.
강화 학습의 주요 응용 분야로는 게임과 로봇 제어를 들 수 있다. 1992년 IBM의 제럴드 테사우로(Gerald Tesauro)가 강화 학습을 이용하여 개발한 백개먼(Backgammon) 게임(TD-Game)은 인간 챔피언과 유사한 수준에 도달했고, 2016년 딥마인드(DeepMind)가 개발한 강화 학습 기반의 소프트웨어 알파고(AlphaGo)는 세계 정상급 바둑 기사들을 꺾었다. 로봇 제어 분야에서는 2000년대 후반 모형 헬리콥터의 곡예 비행에 강화 학습이 성공적으로 적용되었고, 자율 주행 자동차 개발에도 강화 학습이 이용된다.

※ 강화형 기계 학습에서는 지도형이나 비지도형 기계 학습의 ‘입력’, ‘출력’ 용어를 사용하지 않고 ‘상태(state)', '행동(action)' 단어를 사용한다.
※ 백개먼 게임: 주사위를 굴려 열다섯 개의 말을 전부 자기 쪽 진지로 먼저 모으는 쪽이 이기는 보드 전략게임
※ TD-Game 관련 자료: 제럴드 테사우로(Gerald Tesauro), ‘Temporal Difference Learning and TD-Gammon’, Communications of the ACM, March 1995"
비지도형 기계 학습,Unsupervised learning,,비지도 학습,"기계 학습 중 컴퓨터가 입력값만 있는 훈련 데이터를 이용하여 입력들의 규칙성을 찾는 학습 방법.
비지도형 학습 모델은 사람의 해석을 통해 유용한 지식을 추출하는 데 활용되거나 지도형 기계 학습(supervised learning)에서의 원래 입력보다 데이터 특징을 더 잘 표현하는 새로운 입력을 만드는 특징 추출기(feature extractor)로 활용된다.

학습 훈련 데이터(training data)로 출력 없이 입력만 제공되는 상황을 문제(입력)의 답(출력)을 가르쳐 주지 않는 것에 비유해 비지도형 기계 학습(이하 ‘비지도 학습’)이라고 한다.
입력의 규칙성에 따라 군집 분석(Cluster analysis), 의존 구조(dependency structure) 학습, 벡터 양자화(vector quantization), 데이터 차원 축소(data dimensionality reduction) 등으로 구분한다. 군집 분석과 의존 구조 학습은 주로 데이터에 내재하는 유용한 정보나 지식을 추출하는 데 활용된다. 예를 들어, 유전자 데이터에서 학습된 유전자 사이의 의존 구조는 생의학 연구자들에게 새로운 지식을 제공할 수 있다. 벡터 양자화와 데이터 차원 축소는 데이터의 잡음과 불필요한 입력을 제거하며, 지식 추출, 데이터 압축 및 특징 추출(feature extraction) 등에 적용된다. 특징 추출은 원래 입력보다 데이터를 더 잘 표현하는 새로운 입력을 만드는 것을 의미하며, 추출된 특징은 지도 학습의 성능을 향상시키는 데 이용된다.
비지도 학습을 위한 군집 분석 방법에는 k-평균 군집화 및 계층적 군집화 등이 있고, 의존 구조 학습의 대표적 방법에는 베이즈 망(Bayesian network)이 있다. 벡터 양자화의 대표적 방법에는 린데·부조·그레이(Linde-Buzo-Gray) 알고리즘이 있으며, 데이터 차원 축소 방법에는 선형 방법인 주성분 분석(principal components analysis)과 인공 신경망 기반 비선형 방법인 오토인코더(autoencoder) 등이 있다.

※ 의존 구조 학습: 데이터의 변수들 사이의 확률적 독립(independence)과 의존(dependence) 관계를 표현하는 그래프 구조를 학습하는 것. 확률적 독립과 의존은 인과 관계(causal relation)와 깊은 관련이 있기 때문에 변수들 사이의 인과 관계를 분석하는데 유용하다.
※ 벡터 양자화: 주어진 데이터를 적은 수의 원형(prototype) 벡터를 이용하여 근사(approximation)하는(똑같지는 않지만 비슷한 값을 가지도록 간략하게 나타내는) 것.
※ 데이터 차원 축소: 주어진 데이터를 원래 변수의 개수보다 적은 수의 변수를 이용하여 근사하는 것. 원래 데이터에 존재하는 정보를 최대한 보존하면서 변수의 개수를 줄이는 것이 목적이다.
※ k-평균 군집화: 데이터를 k 개의 부분 집합(군집)으로 나누는 것으로, k는 사람이 정함
※ 계층적 군집화: 데이터를 계층적으로 분할하거나 병합하는 군집 분석
※ 베이즈 망: 확률적 의존관계(probabilistic dependency)를 그래프로 표현하는 모델
※ 린데·부조·그레이 알고리즘: 코드북 생성에 사용되는 벡터 양자화 알고리즘으로, k-평균 군집화 알고리즘과 유사하다(Y. Linde, A. Buzo. and R. M. Gray, 1980)
※ 주성분 분석: 데이터 왜곡을 최소화하는 저차원 표현을 학습하는 것
※ 오토인코더: 입력을 재구성(reconstruction)하는 신경망 모델"
지도형 기계 학습,Supervised learning,,지도 학습,"기계 학습 중 컴퓨터가 입력값과 그에 따른 출력값이 있는 데이터를 이용하여 주어진 입력에 맞는 출력을 찾는 학습 방법.
지도형 기계 학습 모델은 입력된 문제에 대한 답을 예측하는 데 사용된다. 기계 번역, 상품 추천, 질병 진단 등에 응용될 수 있다.

학습 훈련 데이터(training data)로 입력과 출력이 같이 제공되는 상황을 문제(입력)의 답(출력)을 가르쳐 주는 것에 비유하여 지도형 기계 학습(이하 '지도 학습')이라고 한다. 예로, 개와 고양이 사진을 구분하는 것을 들 수 있다. 이때 입력은 사진이고, 출력은 개 또는 고양이인지의 여부가 된다. 개인지 고양이인지의 여부가 기록된 사진을 이용해 지도 학습을 하며, 학습 결과는 훈련 데이터에 포함되지 않은 사진을 구분하는 데 적용된다.
지도 학습에서 입력을 예측 변수(predictor variable) 또는 특징(feature), 출력을 반응 변수(response variable) 또는 목표 변수(target variable)라고도 한다. 지도 학습 중 목표 변수가 수치형(numeric)인 경우는 회귀(regression), 범주형(categorical)인 경우는 분류(classification)라고 한다. 지도 학습을 위한 대표적인 기계 학습 모델로는 선형 회귀(linear regression), 로지스틱 회귀(logistic regression), 결정 트리(decision tree), 서포트 벡터 머신(support vector machine), 인공 신경망 등이 있다.

* 선형 회귀(linear regression): 지도형 기계 학습 중 출력이 수치형 값을 가지는 경우를 회귀라 하며, 회귀에 선형 함수를 이용하는 것을 선형 회귀라 한다.
* 로지스틱 회귀(logistic regression): 지도형 기계 학습 중 출력이 범주형 값을 가지는 경우를 분류라 하며, 로지스틱 회귀는 로지스틱 함수를 이용하는 분류 방법이다.
* 결정 트리(decision tree): 주어진 입력값이 특정한 값을 출력하기 위한 다양한 조건들을 트리 형태로 표현하는 방법. 회귀와 분류에 모두 사용된다.
* 서포트 벡터 머신(support vector machine): 주어진 입력이 존재하는 다차원 공간 상의 초평면(hyperplane) 개념을 이용하는 분류 방법. 입력 데이터 예제 중 초평면을 결정하는 것들을 서포트 벡터라 한다."
브로드밴드,Broadband,,"광대역, 고속","대량의 정보를 고속으로 전송하는 유무선 정보 통신 시스템 또는 서비스.
통신망에서는 동축 케이블이나 광섬유, 무선 등 광대역 매체를 여러 주파수 채널로 다중화하여 정보를 전송하는 의미로 사용한다. 일반적으로 케이블 모뎀, 디지털 가입자 회선(DSL: Digital Subscriber Line), 와이파이(Wi-Fi), 와이맥스(WiMax), 3세대(3G)/4세대(4G)/5세대(5G) 이동 통신, 위성 등을 포함하는 유무선 통신망 기반으로 초당 수 메가비트(Mbps)부터 기가비트(Gbps)까지의 고속 인터넷 서비스를 의미한다.

브로드밴드(broadband)의 의미는 시대와 상황에 따라서 대역폭 크기, 최소 전송 속도 등 기준과 조건이 상대적으로 변동할 수 있다. 초기 브로드밴드 용어는 기존에 전화선을 이용하여 음성이나 데이터를 전송하는 다이얼업(dial-up) 인터넷 서비스(4khz 대역의 최대 56 kbps)와 비교하여 사용 대역이 훨씬 넓고 데이터 전송 속도가 빠른 인터넷 서비스를 지칭하는 데 주로 사용되었다. 정보통신 기술 관점에서는 다양하고 많은 데이터를 고속으로 전송하기 위해, 동축 케이블이나 광섬유 케이블 등과 같이 넓은 주파수 대역을 갖는 하나의 물리 통신 채널을 여러 개의 좁은 대역 채널로 분할하여 사용하는 주파수 분할 다중화(FDM: Frequency Division Multiplexing) 시스템을 의미하였다. 이후 정보 통신 기술의 발전으로 브로드밴드는 통신, 방송, 인터넷 등을 결합하여 데이터를 고속으로 전송하는 통신 서비스를 포함하는 의미로 확장되었다.
브로드밴드의 최소 전송 속도도 시대와 시스템 상황 등에 따라서 상대적으로 변동한다. 예로, 미국 연방통신위원회(FCC: Federal Communications Commission)는 브로드밴드의 최소 전송 속도를 2010년에 다운로드 속도는 4Mbps, 업로드 속도 1Mbps로 정했으나, 2015년 다운로드 속도 25Mbps, 업로드 속도 3Mbps로 상향하였다.

※ 브로드밴드(broadband)가 넓은 대역 및 고속의 전송 속도를 의미하는 반면, ‘와이드밴드(wideband)'는 단지 대역폭이 넓은 것을 의미한다."
모바일 브로드밴드,Mobile BroadBand,MBB,"광대역 무선 인터넷,  초고속 무선 인터넷, 광대역 이동 통신","스마트폰, 태블릿PC 등 모바일 기기에 멀티미디어 인터넷 서비스를 고속으로 제공하는 기술.
고속 패킷 접속(HSPA: High Speed Packet Access), HSPA+(evolved HSPA), 엘티이(LTE), 엘티이 어드밴스드(LTE-Advanced) 등 3.5세대부터 4세대까지의 이동 통신 기술과 모바일 와이맥스(Mobile WiMAX), 와이브로(WiBro) 등 무선 통신 기술을 통틀어 이르는 말이다.

3세대(3G)의 광대역 부호 분할 다중 접속(WCDMA: Wideband CDMA) 기술은 음성과 짧은 데이터 위주의 통신으로 인터넷 접속이 원활하지 않았다. 2005년 3GPP에서 고속 하향 패킷 접속(HSDPA: High Speed Downlink Packet Access) 표준(3GPP Release 5)이 공표되면서 이동 통신망에서 데이터 다운로드 속도가 초당 14.4 메가비트(Mbps)로 빨라졌다. 이를 계기로 무선 인터넷이 활성화되기 시작하였다. HSDPA는 3G에서 발전된 서비스로 3.5 세대(3.5G)라고 한다. HSDPA 이후 HSPA+(enhanced High Speed Packet Access), 와이브로(WiBro), 와이맥스(WiMAX), 그리고 LTE 기술로 진화되면서 무선 인터넷 접속이 일상화되었다.
2018년 3GPP는 모바일 브로드밴드(MBB)보다 향상된 eMBB(enhanced MBB) 기술 표준을 제정하였다(3GPP Release 15)."
커넥티드 카,Connected car,,,"통신망에 연결된 자동차.
통신 수단으로 무선랜(Wi-Fi), 엘티이(LTE) 이동 통신 등이 사용된다. 커넥티드 카는 다른 차량이나 교통 및 통신 인프라, 보행자 단말 등과 실시간으로 통신하며 운전자의 편의와 교통 안전을 돕고 인터넷의 다양한 서비스를 제공한다. 커넥티드 카 자체가 통신 기기가 된다는 의미에서 ‘거대한 사물 인터넷(IoT) 기기’라고도 한다.

커넥티드 카는 다른 차량이나 보행자 단말, 도로 기반 시설 등과 추돌 경고 신호, 교차로 통제 정보 등을 주고받고, 교통 센터에서 교통 안전 지원, 실시간 길 안내, 차량 점검 서비스 등을 받을 수 있다. 자동차의 와이파이(Wi-Fi)나 이동 통신 기능을 핫스폿으로 이용하여 탑승자들은 음악 및 영화 스트리밍 서비스, 실시간 날씨 및 뉴스 검색 서비스 등을 이용할 수 있다.
최초의 커넥티드 카는 1996년 제너럴 모토스(General Motors)에서 만든 온스타(OnStar) 서비스이다. 온스타는 셀룰러 통신과 위성 통신 기반으로 내비게이션, 차량 추적, 긴급 구조 요청 전화 등의 서비스를 제공하였다. 2014년 아우디(Audi)가 최초로 LTE Wi-Fi 핫스폿(Hotspots) 접속 기능을 탑재한 A3 자동차를 출시하였고, 이후 제너럴 모터스(GM)에서도 LTE 통신 기능을 탑재한 자동차를 대량 출시하였다. 2016년 SK텔레콤은 에릭슨(Ericsson)과 5G 시험망을 공동 구축하고, BMW와 세계 최초 5세대 이동 통신(5G)을 탑재한 커넥티드 카 T5를 시연하였다."
협대역 사물 인터넷,NarrowBand-Internet of Things,NB-IoT,,"엘티이(LTE) 기술 기반으로 사물 인터넷을 효율적으로 제공하는 저전력 광역 통신 표준 기술.
2016년 3GPP 이동 통신 표준화 기구에서 제정하였다. 180kHz의 좁은 대역으로 최대 250kbps의 데이터 전송 속도와 10km 이상의 광역 서비스를 지원하고, 이동성은 지원하지 않는다. 수도·가스·온도·전기 등 검침 센서, 스마트 조명, 위치 추적 기기 등과 같이 원거리에 있고 데이터 사용 빈도와 전력 소비가 적으며 이동성이 없거나 낮은 사물 인터넷(IoT) 기기에 적합하다.

지그비(ZigBee, IEEE 802.15.4), 저전력 블루투스(BLE: Bluetooth Low Energy) 등이 단거리 서비스인 반면, 저전력 광역 통신(LPWA: Low-Power Wide-Area) 기술의 통신 서비스 범위는 수 킬로미터 이상으로 매우 넓다. 3GPP는 LTE 이동 통신망에서 LPWA의 장점을 활용하여 180kHz의 좁은 대역으로 최대 250kbps의 데이터 전송을 제공하는 NB-IoT 표준을 제정하였다.
NB-IoT는 전력 소모를 줄이기 위해 전력 절약 모드(PSM: Power Saving Mode)와 단말의 불연속 수신 향상 기술(eDRX: enhanced Discontinuous Reception) 등을 지원한다. 그리고 프로토콜의 복잡도를 낮추기 위해 이동성을 지원하지 않는다. NB-IoT 주파수 대역으로는, GSM 대역의 일부를 NB-IoT용으로 변경한 대역(standalone 모드), LTE 주파수 대역의 일부(in-band 모드) 또는 보호 대역(guard-band 모드) 등이 사용될 수 있다.

※ 3GPP에서 제정한 이동 통신망 기반의 저전력 광역 통신(LPWA) 기술 표준으로 협대역 사물 인터넷(NB-IoT) 외에 eMTC(enhanced Machine Type Communication) 표준이 있다(3GPP 릴리즈 13).
※ 정부 NB-IoT 기술 기준(2017): LTE 주파수인 800㎒ 대역에서 829∼849㎒(업로드) 및 874∼894㎒(다운로드), 1.8㎓ 대역에서 1735∼1755㎒(업로드) 및 1830∼1850㎒(다운로드)를 NB-IoT 주파수로 활용"
향상된 모바일 브로드밴드,enhanced Mobile BroadBand,eMBB,"향상된 광대역 이동 통신, 초광대역 이동 통신","5세대 이동 통신에서 사용자가 체감하는 대용량 데이터 전송 속도가 기존 모바일 브로드밴드보다 빠른 서비스.
ITU-R에서 정한 IMT-2020(5G) 이동 통신의 주요 서비스 요건(usage scenario) 중 하나이다. 기존 4세대(LTE)의 모바일 브로드밴드(MBB) 서비스 품질을 향상시켜 데이터 다운로드의 최고 전송 속도가 10 ~ 20 기가비트(Gbit/s)이며 사용자의 체감 전송 속도는 10 ~ 100 메가비트(Mbit/s)이다(※ 참고 Rec. ITU-R M.2083-0).

초고선명(UHD)의 가상 현실(VR), 증강 현실(AR), 360도 동영상, 홀로그램 등 새로운 응용 영역에서 보다 향상된 성능을 제공하여 사용자는 끊김 없는(seamless) 고품질 서비스를 이용할 수 있다. 또한, eMBB는 광역 커버리지(wide-area coverage)와 핫스폿(hotspot)과 같이 요구 사항이 서로 다른 서비스에도 적용된다. 사용자 밀도가 높고 이동성이 낮은 핫스폿에서는 높은 데이터 최고 전송 속도를 우선으로 제공하고, 이동성이 높은 광역 커버리지에서는 끊김 현상 없이 안정적이고 균일한 전송 품질의 서비스를 제공한다.
eMBB 외 IMT-2020 주요 서비스 요건으로 대규모 사물 통신(mMTC: massive Machine Type Communications)과 초고신뢰·저지연 통신(URLLC: Ultra-Reliable and Low Latency Communications)이 있다.
※ 3GPP는 무선 접속 기술 5G NR에서 eMBB 서비스를 제공하기 위해 전송률 극대화와 대역폭 증대를 달성하는 방향으로 표준화하고 있다."
기존 시스템,Legacy system,,레거시 시스템,"새로운 시스템과 구별하여 기존 시스템을 일컫는 말.
새로 제안된 방식이나 기술 등을 부각하는 의미로 사용된다. 과거에 개발되어 현재까지 계속 사용되는 기술, 데이터, 플랫폼, 소프트웨어 및 하드웨어 등을 총칭한다. 현재 사용하지 않지만 새로운 시스템에 영향을 주는 경우도 포함한다.

기존(레거시) 시스템은 구형 컴퓨터나 서버와 같은 하드웨어부터, 현재 운영 중인 컴퓨터 운영 체제(OS), 프로그래밍 소스 코드, 데이터베이스 등 소프트웨어 자산까지 모두 포함하는 개념이다. 새로운 시스템에 대비해 기존 시스템을 의미하지만, 이전의 시스템을 모두 기존 시스템이라고 하지는 않는다. 새로운 시스템과 특정 관계를 주고받거나 영향을 주는 기존 시스템을 의미한다. 일부에서는 기존 시스템을 노후화된 하드웨어, 복잡하고 비대해진 애플리케이션, 특정 공급 업체에 의존도가 높은 시스템 등과 같이, 보수 또는 교체가 불가피한 시스템이라는 의미로도 사용한다.
기업들은 기존 시스템이 오래 전에 개발되었지만 여전히 잘 동작하는 경우, 시스템 교체 시 서비스 및 관리 운용에 심각한 영향을 끼치는 경우 등에 기존 시스템을 계속 사용하기도 한다. 기존 시스템을 클라우드 컴퓨팅 시스템으로 대체 전환하는 기업도 있다."
제이슨,JavaScript Object Notation,JSON,,"웹과 컴퓨터 프로그램에서 용량이 적은 데이터를 교환하기 위해 데이터 객체를 속성·값의 쌍 형태로 표현하는 형식.
자바스크립트(JavaScript) 토대로 개발되었다. 여러 프로그래밍 언어에도 사용할 수 있어 독립형 언어이며 텍스트로 기술하여 사람도 쉽게 읽고 작성할 수 있다. 웹 브라우저와 웹 서버 간 비동기 통신, 웹 서버 간의 데이터 교환 등에 주로 사용된다. IETF RFC 7159(The JavaScript Object Notation(JSON) Data Interchange Format) 표준과 ECMA-404(The JSON Data Interchange Syntax) 표준으로 제정되어 있다.

JSON은 자바스크립트(ECMA-262 3rd edition, 1999)를 토대로 개발되었으며, 2000년대 미국의 컴퓨터 프로그램 개발자인 더글라스 크락포드(Douglas Crockford)가 확산시켰다. 특히, 웹 브라우저에서 비동기 처리에 사용되는 에이잭스(AJAX)가 데이터 교환 형식으로 JSON을 사용하면서 널리 알려졌다. AJAX가 기존 사용하던 XML 기반의 메시지 포맷은 시작 태그와 끝 태그를 포함하여 메시지 크기가 커지는 문제가 있었다. 이를 해결하기 위해 JSON으로 대체하였다. 대부분의 웹 기반 애플리케이션에서 데이터 교환 형식으로 XML 대신 JSON을 활용한다.
JSON은 자바스크립트(JavScript)의 구문 형식을 따르지만, C, C++, C#, 자바(Java), 파이선(Python) 등의 프로그램 언어와도 함께 사용되어 플랫폼과 프로그래밍 언어 면에서 독립적인 언어이다. 데이터 구조는 속성(name)과 값(value) 한 쌍으로 구성되며, “속성: 값” 형식으로 데이터 객체를 표현한다. 값(value)의 자료형으로 수(number), 문자열(string), 객체(object), 배열(array), 참/거짓(boolean), 또는 빈값(null)이 지원된다. 배열(array)은 대괄호([ ])로, 객체는 속성·값 쌍의 집합으로 중괄호({ })를 사용하여 표현하며, 객체 간의 구분은 쉼표(,)로 한다. 아래는 ‘paul’이라는 사람에 대한 정보(나이, 주소 등)를 JSON 형식으로 표현한 예시이다. ‘name’ 속성에 대한 값은 ‘paul’이며, ‘age' 속성에 대한 값은 ‘27’이다. 전화번호(phone)는 집(home) 전화와 휴대폰(cellphone) 객체 2개를 갖는 배열로 표현한다.

{
""name"": ""paul"",
""age"": 27,
""address"": {
""Address"": ""11Ro Seoul Korea""},
""phone"": [
{ ""type"": ""home"",
""number"": ""02-000-0000"" },
{ ""type"": ""cellphone"",
""number"": ""010-0000-0000"" },
],
""children"": [],
""spouse"": null
}"
유니코드 변환 형식,Unicode Transformation Format,UTF,"UCS(Universal Coded Character Set) Transformation format, 유니코드 인코딩","유니코드 문자를 기존 문자 체계와의 상호 호환을 위해 가변 길이의 바이트열 값으로 인코딩하는 방식.
유니코드(Unicode)는 전 세계의 거의 모든 문자에 고유 숫자를 부여한 문자 집합으로, 1993년 국제 표준(ISO/IEC 10646)으로 제정되었다. 유니코드는 기본적으로 2 바이트로 한 문자를 표현하여, 기존 7 비트 또는 8 비트로 한 문자를 표현하는 아스키(ASCII) 문자 기반 시스템과 호환을 위해 UTF를 사용한다.

UTF 인코딩 방식으로 UTF-8, UTF-16 및 UTF-32 등이 있다. UTF 뒤의 숫자는 한 문자를 인코딩하는 길이로, UTF-8은 유니코드 문자를 8비트(1바이트) 값으로 인코딩함을 의미한다. 대표적인 UTF 인코딩 방식은 다음과 같다.
▷ UTF-8: 모든 유니코드 문자(코드포인트)를 1 ~ 4 바이트의 8 비트 단위로 인코딩한다. 유니코드 문자 모두를 인코딩하며 가장 많이 사용되는 방식이다. 표준 영어 및 기호는 1 바이트(7비트 ASCII와 동일), 추가 라틴 및 중동 문자는 2 바이트, 한글을 포함한 아시아 문자는 3 바이트, 그리고 추가 문자는 4 바이트를 사용하여 표현한다. 웹에서 많이 사용되며, W3C는 XML 및 HTML의 기본 인코딩으로 UTF-8을 권장한다.
▷ UTF-16: 2 바이트(16 비트) 단위로 1~ 2개를 사용하여 유니코드의 유효한 모든 문자를 인코딩할 수 있다. 기본 다국어 평면(BMP: Basic Multilingual Plane)에 속하는 문자들은 그대로 16 비트 값으로 인코딩하고, 추가 문자는 32 비트(16비트 2개) 값으로 인코딩한다. 자바(Java) 프로그래밍에서 기본으로 사용된다.
▷ UTF-32: 유니코드 문자를 모두 4 바이트(32 비트) 고정 길이로 인코딩한다. 유니코드의 모든 문자에 해당하는 UTF-32 값이 색인화되어 있어, 인코딩 변환 처리가 따로 필요 없다. 그러나 모든 문자가 4 바이트를 차지하는 메모리상의 비효율로 다른 UTF-8과 UTF-16에 비해 많이 사용되지 않는다.

예를 들어, 알파벳 대문자 ‘A’의 유니코드 값(코드포인트※)은 'U+0041'로, UTF-8로 변환하면 0x41(이진수 01000001), UTF-16으로 변환하면 0x0041, UTF-32로 변환하면 0x00000041(십진수 65)이다. 한글 ‘가’의 유니코드 값은 ‘U+AC00'이다. 이를 UTF-8로 변환하면, 0xEA 0xB0 0x80(이진수 11101010:10110000:10000000), UTF-16으로 변환하면 0xAC00, UTF-32로 변환하면 0x0000AC00(십진수 44,032)이다.

※ 유니코드에서 각 문자에 부여하는 고유 숫자 값(예: U+0041)을 코드 포인트(code point)라 한다."
스프라이트,Sprite,,,"컴퓨터 그래픽스(CG)에서 장면 일부를 구성하는 2D 비트맵 이미지를 등록하고 합성하는 기능.
1980년대 초기 비디오 게임과 비디오 영상에서 화면 전체가 아닌 개체의 움직임만 제어하는 하드웨어 기능을 지칭하는 용어였으나, 소프트웨어적인 이미지 개체의 움직임도 포함하는 것으로 의미가 확장되었다. 스크래치(Scratch)와 같은 시각적인 블록 프로그래밍에서 이미지, 소리, 연산 및 움직임 등의 동작을 수행하는 객체를 지칭하는 용어로도 사용된다.

그래픽스 게임에서 캐릭터의 움직임을 표시하기 위해서는, 먼저 움직임을 구성하는 각각의 캐릭터 이미지를 스프라이트로 만들어 등록하고, 스프라이트 이미지들을 순서대로 고속으로 연결하여 화면상에 표시한다. 장면 전체를 계속 바꿔 표시하는 것보다 움직이는 캐릭터만 갱신하므로 컴퓨터의 연산 처리 부담이 줄어든다.
프로그래밍 분야에서, 스프라이트를 사용하는 대표적인 비주얼 블록 프로그래밍으로 스크래치(Scratch)가 있다. 스크래치 프로그램에서 직접 스프라이트를 만들거나 스프라이트 저장소(라이브러리)에 공개된 다양한 스프라이트를 이용하여, 블록을 가지고 놀 듯이 스프라이트를 에디터 화면으로 끌어 조립하는 방식으로 프로그램한다. 정지 이미지, 움직이는 이미지, 소리 등 다양한 스프라이트로 프로그램하여 게임, 뮤직비디오, 애니메이션 등을 만들 수 있다. 엔트리(Entry), 앨리스(Alice)와 같은 블록 프로그램에서는 스프라이트 용어를 사용하지 않고 오브젝트(object)라는 용어를 사용한다.

※ 스크래치(Scratch): 미국 MIT 미디어랩에서 8~16세 아동을 대상으로 만든 무료 교육용 프로그래밍 언어. 150개 이상의 나라에서 활용된다.
※ 엔트리(Entry): 카이스트 출신의 학생들이 주축이 되어 만든 교육용 프로그래밍 언어
※ 앨리스(Alice): 미국 카네기멜론대학교에서 개발한 교육용 프로그래밍 언어. 3D 게임, 애니메이션 개발용으로 활용된다."
지능형 환경,Ambient Intelligence,AmI,"생활환경지능, 환경지능, 앰비언트 인텔리전스","사람과 다양한 전자 기기 간의 실시간 상호 작용으로 만들어지는 지능화된 서비스 환경.
주위 환경을 의미하는 ‘앰비언트’와 지능을 뜻하는 ‘인텔리전스’가 결합한 말로, 주변 환경이 사람을 인식하고 사람이 원하는 시간 및 장소에서 사람이 원하는 서비스를 맞춤형으로 제공하고 희망 사항을 예측함을 의미한다. 미래에는 전자 기기가 특별히 눈에 띄지 않고 마치 배경처럼 주변 곳곳에 존재하며, 사람과 전자 기기가 자연스럽게 소통할 수 있는 기술이 필요할 것이라는 생각에서 고안된 개념이다.

지능형 환경(Ambient Intelligence)이라는 개념은 1998년 필립스(Philips)에서 고안되었다. 기능상 몇몇 분야로 나뉜 당시 가전 산업이 2020년경에는 정보, 통신, 오락 등이 통합된 대규모 가전 산업으로 어떻게 재편될지를 조사하는 워크숍을 통해 만들어졌고, 1999년 유럽의 디지털 거실 학술대회(Digital Living Room Conference)에서 지능형 환경의 개념이 처음 공개되었다.
지능형 환경의 주요 기술 특성은, 주위에 많은 인터넷 기기가 주변 곳곳마다 있어 특별히 눈에 띄지 않음을 의미하는 내재형(embedded), 전자 기기가 사람의 상황(콘텍스트)를 인식함을 의미하는 상황 인지(context aware), 개인 요구에 맞춤을 의미하는 개인화(personalized), 상황에 맞춰 응대하는 것을 의미하는 적응형(adaptive), 사용자의 희망 사항을 미리 예상하는 것을 의미하는 예견(anticipatory) 등이다. 지능형 환경의 구현은 인공 지능, 나노 기술, 내장형 시스템, 모바일 기술, 센서 기술과 같은 다양한 분야와 관련 있다."
개방형 연계 데이터,Linked Open Data,LOD,,"웹에서 누구나 사용할 수 있도록 무료로 공개되는 연계 데이터.
연계 데이터(Linked data)와 오픈 데이터(Open data)가 결합된 단어로, 웹에 게시되는 데이터에 식별자(URI)를 부여하고 관련 정보를 구조적으로 제공하는 연계 데이터를 저작권 없이 무료로 제공하여 사용자가 정보를 다양하고 효율적으로 활용할 수 있도록 한다.

하이퍼텍스트 전송 규약(HTTP), 자원 기술 프레임워크(RDF: Resource Description Framework)와 인터넷 식별자(URI: Uniform Resource Identifier) 등의 웹 표준 기술을 이용하여 시맨틱 웹을 구축하고, 출처가 서로 다르지만 인터넷 식별자(URI)를 통해 데이터를 서로 연결한다. 데이터를 재사용할 수 있고, 데이터 중복을 줄일 수 있는 장점이 있다. 국립중앙도서관, 서울시, 한국관광공사, 특허청 등에서 LOD 활용 서비스를 하고 있다."
스몰셀,small cell,,소형셀,"수백 미터(m) 정도의 운용 범위를 갖는 저전력 무선 접속 기지국.

스몰셀은 단말기를 기지국에 가깝게 위치시켜 운용 범위(셀 크기)를 줄임으로써 통신 품질 저하 및 음영 지역 발생 등의 문제점들을 해결할 수 있다. 또한 단말기가 기지국과 가까이 위치하게 되어 단말기의 전력 소모를 줄일 수 있고, 설치비와 유지 보수 비용이 기존 기지국에 비해 적게 드는 이점 등의 장점을 갖는다. 사용 범위 및 용도에 따라 메트로셀(metro cell), 마이크로셀(micro cell), 피코셀(pico cell), 펨토셀(femto cell)로 분류가 된다. 그리고 설치 지역 및 서비스 목적에 따라 가정(home), 기업(enterprise), 핫스폿(hotspot)으로 나뉠 수 있다."
대량 다중 입력 다중 출력,massive Multi Input Multi Output,massive MIMO,대량 미모(MIMO),"대용량의 데이터를 고속으로 전송하기 위하여 수십 개 이상의 대량 안테나를 사용하는 다중 입력 다중 출력(MIMO) 기술.
수 GHz 이상의 높은 주파수를 사용하는 5세대 이동통신에서 안테나 이득이 매우 높은 빔을 형성하여 가입자에게 대용량의 정보를 전송하거나 증가된 자유도(degree of freedom)를 이용하여 여러 채널로 정보를 동시에 전송할 수 있다. 따라서 에너지 효율 향상과 간섭에 강인한 장점을 얻을 수 있다. 주로 10 GHz 이상의 주파수를 사용하는 시분할 송수신(TDD: Time Division Duplexing) 방식의 시스템에 적합하다."
통계적 기계 번역,Statistical Machine Translation,SMT,통계적 자동 번역,"통계적 분석으로 기계 학습에 필요한 많은 양의 말뭉치에서 모델 파라미터를 학습하여 문장을 번역하는 기술.
기본 요소는 통계적 번역 모델과 언어 모델, 이중 언어 말뭉치에서 파라미터를 찾아내는 학습 알고리듬과 학습된 번역 모델에 따라 최적으로 번역 결과를 탐색하는 디코딩 알고리듬으로 구성된다. 이 기술은 1949년 워런 위버(Warren Weaver)가 처음 제시하였고 1991년 IBM사 토머스 제이 왓슨 연구소(Thomas J. Watson Research Center)가 다시 소개한 이후 활발하게 연구되었다."
단말 간 직접 통신,Device-to-Device communication,D2D communication,디투디(D2D) 통신,"이동 통신 단말기가 기지국을 거치지 않고 단말기 끼리 직접 통신하는 기술.
늘어나는 데이터 트래픽의 수요를 해결하고 한정된 주파수 자원의 이용 효율을 높일 수 있다. 또한 기지국이 없는 상태에서 인접 단말들 간의 통신이 가능해 재난통신망에서도 유용하게 사용될 수 있다."
무작위 대입 공격,Brute Force Attack,,,"암호문의 암호 키를 찾기 위해 모든 경우의 수를 무작위로 대입하여 암호를 푸는 공격 방법.
과거에는 암호문을 알아볼 수 있는 평문을 찾기 전에는 다른 키로 그 뜻을 파악하여 공격하는 암호 키를 알아내는데 사용하는 공격이었으나, 주로 아이디(ID)와 패스워드를 알아내기 위하여 반복 대입하는 공격으로 사용된다."
면허 불필요 대역,Unlicensed radio frequency/License-exempt spectrum,,,"주파수 공동 이용(Spectrum Commons) 정책에 따라 소출력 통신에 이용하는 주파수 대역.
다른 무선국의 통신을 저해하지 아니하는 출력 범위에서 특정 구역이나 건물 내 등 가까운 거리에서 사용할 목적으로 분배 또는 지정된 주파수이다. 산업용·과학용·의료용·가정용 기기, 기타 유사한 용도로 사용되는 2.4GHz와 5.7GHz의 ISM(Industrial, Scientific, and Medical) 대역과 개별 용도로 지정되거나 기술 기준만 만족하면 용도와 관계없이 사용 가능한 용도 미지정 대역(FACS: Flexible Access Common Spectrum)이 있다."
근접 무선 통신,Near Field Communication,NFC,,"고주파(HF)를 이용한 근거리 자기장 통신 기술.
ECMA-340, ISO/IEC 18092 표준으로, 아주 가까운 거리에서 양방향 통신을 지원하는 RFID 기술의 일종이다. 13.56MHz 주파수를 이용해 10cm 안에서 최고 424kbps의 속도로 데이터 전송을 지원한다. 모바일 기기에서 결제뿐만 아니라 슈퍼마켓이나 일반 상점에서 물품 정보나 방문객을 위한 여행 정보 전송, 교통, 출입 통제, 잠금장치 따위에 광범위하게 활용된다."
기업·정부 전자상거래,Business To Government,B2G,,"기업과 정부 기관이 웹 사이트를 통해서 정보를 교환하고 효율적으로 비즈니스를 행할 수 있는 전자상거래.
예를 들어, 업자들에게 애플리케이션과 정부 차원의 세금 관련 양식들을 한 장소에서 제공하고, 양식 작성과 수수료 송부, 상호 정보 현행화, 질의 답변 요구 등을 수행할 수 있다. 또한 업자들은 정부 기관의 구매 수요를 알 수 있고, 정부 기관은 제안에 대한 응신 서비스도 제공한다. 가상 작업 공간을 만들어 업자와 정부 기관이 계약 건에 대해서 상호 온라인 회의, 계획 검토, 사업 진행 관리 등을 공통 사이트에서 협동으로 수행할 수 있다."
기업·소비자 전자상거래,Business to Consumer,"B2C, B to C",기업 소비자 간 전자상거래,"기업 간 전자상거래(B2B)에 반하여, 기업과 소비자 간에 행해지는 전자상거래.
온라인 쇼핑이 대표적인 예이다. 소비자나 기업의 인증, 카드 회사/은행과의 결제가 시스템상 중요하다."

`