export const tta2017 = `서비스형 시스템,Everything as a Service,"XaaS, aaS",,"사용자에게 필요한 소프트웨어, 콘텐츠, 스토리지 등을 인터넷상에서 대여 형태로 제공하는 클라우드 컴퓨팅 서비스 시스템.  콘텐츠, 데이터, 데이터베이스, 스토리지, 개발 플랫폼, 소프트웨어, 게임 등이 클라우드 컴퓨팅 서비스로 제공된다.  
서비스 유형에 따라 서비스형 콘텐츠(CaaS: Content as a Service), 서비스형 인프라스트럭처(IaaS: Infrastructure as a Service), 서비스형 플랫폼(PaaS: Platform as a Service), 서비스형 소프트웨어(Software as a Service), 서비스형 게임(Game as a Service) 등이 있다."
서비스형 함수,Functions as a Service,FaaS,"함수형 서비스, 서버리스 컴퓨팅(serverless computing)","애플리케이션 개발자에게 함수(function) 단위의 소스 코드를 포함하여 애플리케이션의 개발, 실행, 관리 등에 필요한 모든 환경을 갖춘 플랫폼을 제공하는 클라우드 컴퓨팅 서비스.   
FaaS 플랫폼에서는 애플리케이션 개발에 필요한 프로그램, 네트워크, 스토리지 등 기반 환경을 모두 서비스하기 때문에, 개발자는 컴퓨터 서버(가상서버, 웹서버 등)를 따로 구축하거나 운영 체계(OS), 메모리 등 자원(resource)을 추가·관리할 필요가 없다. 그리고 소스 코드를 함수(function) 단위로 제공하여 개발자는 필요한 함수를 찾아 사용하면 된다.  
즉, 개발자는 FaaS에 접속하여 서비스되는 함수를 이용하여 프로그램 코드만 작성하면 된다. 이에 FaaS를 서버가 없는 컴퓨팅(serverless computing)이라고도 한다.  
FaaS 이용료는 플랫폼상에서만 제공되는 함수(function) 구동(호출) 횟수 또는 시간에 따라 청구된다.  
아마존 AWS(Amazon Web Services) 람다(Lambda)에서 처음 FaaS를 제공하였고, 구글 클라우드 펑션(Google Cloud functions), 마이크로소프트 애저 펑션(MicrosoftAzure Functions) 등이 FaaS를 제공한다. "
굿풋,goodput,,,"데이터 통신에서 단위 시간당 실질적으로 처리된 사용자 데이터 수.  굿풋(goodput)은 응용 계층(application layer)의 사용자 데이터 패킷을 대상으로 하여, 데이터 패킷의 오버헤드(overhead)와 재전송된 데이터 패킷은 제외하고 측정한다. 반대로, 단위 시간당 처리되지 못하고 손실된 사용자 데이터 수는 배드풋(badput)이라 한다. 데이터 처리율(throughput)은 굿풋(goodput)과 배드풋(badput)의 합으로 계산된다. "
버퍼블로트,bufferbloat,,,"통신망에서 패킷 전송 시간이 버퍼로 인해 예상보다 오래 지연되는 현상.  전송 중에 패킷이 손실되는 것을 방지하기 위해 라우터, 와이파이(Wi-Fi) 공유기 등 각 노드의 네트워크 버퍼(큐)의 크기가 크게 확장되었다. 이로 인하여 응답 문자(ACK: acknowledgement) 신호와 같이 작은 크기의 패킷이 버퍼에 갇혀 전송되지 못하는 버퍼블로트 현상이 발생된다."
저전력 광역 통신망,Low-Power Wide-Area Network,LPWAN,,"서비스 범위(커버리지)가 10 km 이상의 광역으로 매우 넓고, 초당 최대 수백 킬로비트(kbps) 이하의 통신 속도를 제공하는 전력 소모가 적은 무선 광역 통신망.   저전력 광역 통신망(LPWAN)은 10 킬로미터(km) 안팎의 거리에서 기지국당 수백 bps에서 수백 Kbps 정도의 통신 속도를 제공하여 사물 인터넷(IoT) 전용 네트워크로 사용된다. 예를 들어, 수도·가스·전기 검침, 자전거 도난 방지, 자산 관리 등을 위해 넓은 지역에 걸쳐 산재되어 있고 생성되는 데이터의 양이 매우 낮으며 교환되는 빈도가 낮아 배터리 하나로 수년 이상 동작해야 하는 사물 인터넷 기기 및 응용 분야에 매우 적합하다. LPWAN을 실현하기 위한 기술에는 ISM 면허 불필요 대역을 사용하는 로라(LoRaWAN), 시그폭스(SIGFOX) 등과 이동통신 면허 대역을 이용하는 엘티이-엠티시(LTE-MTC: LTE Machine-Type Communications),  협대역 사물 인터넷 (NB-IoT) 기술 등이 있다."
온오프 변조 방식,On-Off Keying,OOK,,"일정 진폭의 반송파(carrier wave)를 단속(斷續, on-off)하여 전송하는 방식으로, 디지털 신호가 ‘1’이면 온(on)하고 ‘0’이면 오프(off) 시키는 변조 방식.  0과 1의 값만 존재하는 2 레벨(level) 변조 방식으로, 진폭 편이 방식(ASK: Amplitude Shift Keying) 중 가장 단순하다. 모스 부호(Morse code) 전송에서 사용된 방식이다. "
양자 통신,quantum communication,,,안전한 통신을 위해 양자 역학적 특성을 이용한 양자 암호(quantum cryptography)의 양자 암호 키 분배(QKD: Quantum Key Distribution) 기술로 물리적 입자의 전달이 아닌 큐비트(qubit)를 전송(quantum teleportation)하는 기술.  양자 상태(quantum states)에 정보를 기록하여 전송하므로 공격자가 도청을 위해 양자 상태를 측정하는 순간 양자 상태 자체가 변화된다. 따라서 수신자는 데이터에 대한 도청 시도를 파악하고 수신된 정보를 폐기할 수 있다. 이에 따라 양자 상태에 기록된 정보는 근본적으로 도청이 불가능하다.  양자 통신 채널은 중간에 증폭기가 없는 순수 광섬유로만 연결된 채널로서 현재는 거리에 제약이 있다.
협대역 사물 인터넷,NarrowBand-Internet of Things,NB-IoT,,"이동통신망을 통해 저전력 광역(LPWA: Low Power Wide Area) 통신을 지원하는 협대역 사물 인터넷 표준. 지에스엠(GSM: Global System for Mobile Communications) 또는 엘티이(LTE: Long Term Evolution) 망에서 좁은 대역을 이용하여, 수백 kbps 이하의 데이터 전송 속도와 10 km 이상의 광역 서비스를 지원한다. 따라서 수도 검침, 위치 추적용 기기 등과 같이 원거리에 있고 전력 소비가 낮은 사물 간의 통신에 적합하다."
디지털 메시,digital mesh,,"디지털 격자망, 디지털 그물망","차량, 카메라, 가전제품, 스마트폰, 착용 컴퓨터(웨어러블 기기) 등 많은 다양한 기기들이 상호 연결되어 촘촘한 그물망 같은 형태를 가리키는 것.  디지털 메시에는 컴퓨터, 스마트폰뿐만 아니라 착용 컴퓨터(웨어러블 기기), 가상 현실 기기, 사물 인터넷(IoT) 센서 등 여러 스마트 기기들이 포함되며, 정보 수집, 사람들과의 소통, 비즈니스 등에 활용된다. '디지털 메시'는 가트너(Gartner)의 2016년 핵심 전략 기술 중 하나이다."
올조인,AllJoyn,,,"사물 인터넷(IoT: Internet of Thing) 연합 단체인 올신얼라이언스(AllSeen Alliance)에서 표준화한 오픈 소스 기반의 IoT 플랫폼.  올조인은 로컬 영역에서 올조인 기기 간 피투피(P2P: Peer-to- Peer) 통신을 지원하는 IoT 플랫폼이다. 리눅스(Linux), 안드로이드(Android), 아이오에스(iOS), 윈도우(Windows) 등 다양한 운영 체제(OS)와 와이파이(Wi-Fi) 같은 무선 접속 기술을 지원하여 사실상 특정 하드웨어에 의존하지 않는 IoT 애플리케이션 개발이 가능하다. 즉, 각기 다른 제조사에서 만들어진 조명, 스마트워치(smartwatch), 냉장고, 에어컨, 도어록, 스마트폰, 태블릿 PC 등으로 올조인 기반 IoT 서비스를 구성할 수 있다. 기존의 댁내 제어뿐만 아니라 외부에서도 댁내 올조인 기기를 제어할 수 있는 기술들도 제공된다."
가상 현실 위치 추적,virtual reality positional tracking,,포지셔널 트래킹,"가상 현실(VR)에서 머리 착용 디스플레이(HMD: Head Mounted Display), 콘트롤러, 주변 기기 등의 자유도(DOF)를 측정하여 동작 변화를 추적하는 데 사용된다.   
예를 들어, HMD를 착용한 사용자가 가상 공간상에서 상하좌우, 앞뒤 방향으로 움직이고 팔을 뻗어 손으로 물건을 잡는 등의 동작을 하면 HMD와 사용자 손의 위치(포지션)를 측정하여 VR 콘텐츠에 반영시킨다. 따라서 현실 공간에서의 사용자의 실제 동작이 가상 공간에 그대로 동기화되어 높은 몰입도와 생생한 현실감을 전달할 수 있다.  
위치 추적 기능은 카메라와 같이 위치 추적 센서를 외부에 별도로 설치하여 HMD 사용자를 추적하는 아웃사이드-인(outside-in) 추적 방식과 HMD 기기에 위치 추적 센서를 탑재하여 외부 사물의 위치를 추적하는 인사이드-아웃(inside-out) 추적 방식이 있다. 대표적인 예로, 오큘러스 리프트(Oculus Rift)와 플레이스테이션 VR(PlayStation VR)은 아웃사이드-인(outside-in) 방식이다.
"
실감형 가상 현실,Immersive Virtual Reality,Immersive VR,,"가상 현실(VR: Virtual Reality)에서 사용자의 몰입감을 증대시켜 주변 환경이 현실이라고 느낄 정도로 실감을 주는 것. 
사용자는 시각, 청각, 촉각 등의 감각 요소를 통해 생생한 현실감을 느끼게 된다. 
예로,  머리 착용 디스플레이 (HMD: Head Mounted Display)를 이용하여 자동차 운전 시뮬레이션을 할 때 실감나는 주행 소음, 엔진 소리, 노면의 진동 등을 통해 실제 도로에서 주행하는 것과 같은 효과를 얻을 수 있다.  
※ immersive 사전적 의미 (옥스포드 영어사전) : (of a computer display or system) generating a three-dimensional image which appears to surround the user."
대화형 상거래,Conversational Commerce,,대화형 커머스,"메신저로 대화하며 쇼핑을 하는 전자상거래.  일상에서 의사소통 수단으로 PC나 스마트폰에서 메신저가 많이 이용된다. 이 점에 착안하여 전자상거래에 메신저가 활용되게 되었다. 메신저는 로봇이 실시간 대응해주는  챗봇 (chatbot)이다. 챗봇은 인공지능(AI) 기술이 반영된 소프트웨어 로봇으로 사람의 자연어를 이해하고, 자연어로 대답을 하기도 한다.  
대화형 커머스 챗봇은 고객과 일대일로 신속하고 친숙하게 메시지 또는 음성(voice)으로 쇼핑 정보를 주고받으며, 고객 맞춤 서비스를 제공한다. 
따라서 소비자는 쇼핑 웹사이트를 방문하는 대신 카카오톡, 라인(LINE), 위챗(WeChat), 페이스북 메신저 등의 메신저로 상품 구매, 결제, 배송 확인 등을 할 수 있다.
  
아마존(Amazon), 이베이(eBay), 11번가 등 많은 유통업체들이 대화형 커머스를 활용한다. 
"
인포그래픽스,Infographics,,"인포그래픽, 정보그림","복잡한 정보를 쉽고 빠르게 전달하기 위해 차트, 그래픽 등으로 축약해서 표현한 것. 정보(information)와 그래픽스(graphics)의 합성어로, 정보를 분석 정리하여 차트, 그래프, 아이콘, 그래픽스, 이미지 등을 활용하여 시각화한다.  
인포그래픽스 형태로는 한 장에 정보를 표현하는 원페이지 인포그래픽스(one page inforgraphics), 사용자의 선택에 따라 반응하는 인터랙티브 애니메이션(interactive animation), 그래픽스를 영상으로 표현하는 모션그래픽스(motion graphics) 등이 있다.  
인포그래픽스는 이용자들의 관심과 참여를 필요로 하는 설문 조사 결과, 제품 홍보, 교육 자료 등에 많이 사용된다.
"
다크 데이터,dark data,,,"정보를 수집한 후, 저장만 하고 분석에 활용하고 있지 않는 다량의 데이터.  다크 데이터는 처리되지 않은 채 미래에 사용할 가능성이 있다는 이유로 삭제되지 않고 방치되어 있어, 저장 공간만 차지하고 보안 위험을 초래할 수 있다."
스마트 데이터,smart data,,,"실제적으로 가치를 창출할 수 있는 양질의 데이터.   스마트 데이터를 얻기 위해서는 단순 수집된 빅데이터에서 정확하고 의미 있는 정보를 추출하고, 조직에서 바로 분석하고 활용할 수 있게 신속하게 제공하는 기술이 요구된다. 스마트 데이터는 '정확(accurate)', '실행 가능(actionable)', '신속(agile)'의 특성을 갖는다."
시각 언어,visual language,,,"비디오, 사진, 영화, 텔레비전과 같이 시각적인 요소를 통해 의미를 전달하는 체계.  텍스트 또는 음성을 매개로 하는 자연어(natural language)는 개념적으로 의미를 전달하고, 추상적이고 관념적으로 사물을 묘사한다. 반면 시각 언어는 영상을 매개로 하기 때문에 구체적이고 직접적으로 의미를 전달하고 사물을 묘사하여 언어나 국가에 자유롭다. 예를 들어, 교실 풍경을 카메라에 찍으면, 영상을 인식하여 칠판, 테이블, 의자 등과 같은 단순 정보뿐만 아니라 수업 내용, 테이블 크기 등 다양한 정보를 제공한다."
시각 검색,visual search,,비주얼 검색,"카메라로 촬영한 객체의 영상이 가지고 있는 색상, 질감, 모양 등 고유 정보를 추출하여 유사하거나 동일한 객체를 포함하는 영상을 검색하는 기술.   이용자는 검색 대상의 이름, 특징 등 구체적 정보를 몰라도 바로 영상을 촬영하여 확인할 수 있다. 시각 검색 기술로 영상 특징 기반 검색 기술, 영상 속성 기반 검색 기술, 실세계 검색 기술, 시각 언어(visual language) 기반의 시각 상호 작용(visual interaction) 기술, 시각 검색 응용 기술 등이 있다."
공공데이터,public information(or open data),,,"데이터베이스, 전자화된 파일 등 공공기관이 법령 등에서 정하는 목적을 위하여 생성 또는 취득하여 관리하고 있는 광(光) 또는 전자적 방식으로 처리된 자료 또는 정보.   공공데이터는 공공기관이 생성하거나 관리하고 있는 자료 또는 정보를 말하며, 기관이 업무를 수행하며 만들어낸 다양한 형태(텍스트, 수치, 이미지, 동영상, 오디오 등)의 모든 자료 또는 정보가 대상이 된다. 우리나라에서는 공공데이터 촉진을 위해 2013년 법률이 시행되었다. 그리고 공공데이터를 누구나 무료로 자유롭게 활용할 수 있도록 개방·제공을 의무화하는 것을 정부3.0 핵심 정책으로 세웠다. 공공데이터는 공공데이터포털 사이트를 통해 이용할 수 있다."
증강 가상,Augmented Virtuality,AV,,"가상 세계(virtual world)에 카메라로 포착된 물건, 사람 등과 같은 현실(real) 이미지를 더해 가상 환경과 실시간으로 상호 작용할 수 있는 기술.   가상 환경에 현실 정보를 부가하는 증강 가상(AV)은 혼합 현실(MR: Mixed Reality)이라고도 한다. 증강 가상(AV) 예로, 가상 공간에서 사용자가 걷고 뛰는 모습을 보여주는 러닝머신, 실제 교사 모습이 추가된 가상 교실 서비스 등이 있다."
패스트 데이터,fast data,,,"생성되는 대로 실시간으로 빠르게 처리되는 이벤트 데이터. 수집된 정보 간의 연관 분석이 필요 없이, 실시간 정보를 필요로 하는 배송 추적, 건강 진단, 금융 거래 등의 분야에서 패스트 데이터를 비즈니스에 활용할 수 있다."
시선 추적,eye tracking,,,"시선의 위치 또는 움직임을 추적하는 기술.  시선 추적을 위해 눈 주위에 센서를 부착하거나 거울(mirror) 또는 탐지 코일(search coil)이 내장된 콘택트렌즈, 또는 실시간 촬영된 이미지 분석 등의 방법이 이용된다. 시선 추적은 지속적인 응시나 깜박임 같은 특정 눈 동작으로 기기를 동작시키는(예: 커서 이동, 선택 등) 사용자 인터페이스(UI) 기술에 활용된다. 가상 현실(VR) 분야에서는 사용자의 가상 캐릭터에 반영하여 감정을 표현하거나, 시선이 머무는 부분을 선명하게 구현하는 데 활용된다.
"
혼합 현실,Mixed Reality,MR,,"현실 세계에 가상 현실(VR)이 접목되어 현실의 물리적 객체와 가상 객체가 상호 작용할 수 있는 환경.  혼합 현실(MR)은 현실을 기반으로 가상 정보를 부가하는 증강 현실(AR: Augmented Reality)과 가상 환경에 현실 정보를 부가하는 증강 가상(AV: Augmented Virtuality)의 의미를 포함한다. 즉, 현실과 가상이 자연스럽게 연결된 스마트 환경을 제공하여 사용자는 풍부한 체험을 할 수 있다. 예로, 사용자의 손바닥에 놓인 가상의 애완동물과 교감한다거나, 현실의 방 안에 가상의 게임 환경을 구축해 게임을 할 수 있다. 또 집안의 가구를 가상으로 재배치해 본다거나, 원격에 있는 사람들이 함께 모여 함께 작업하는 듯한 환경을 구축할 수 있다.  
※ MR은 1994년 폴 밀그램(Paul Milgram)이 논문에서 처음 제시한 개념으로, 실제 현실(real) 환경과 가상(virtual) 환경 사이에서 증강 현실(AR)과 증강 가상(AV)의 혼합으로 설명하였다.  "
신경 모방 칩,neuromorphic chip,,뉴로모픽 칩,"인간의 뇌 신경 구조를 모방하여 인간의 사고 과정과 유사하게 정보를 처리하는 반도체 소자.   
인지 컴퓨팅 기능을 하드웨어적으로 구현한 것이다. 작은 반도체 칩으로 구현되어 확장성이 용이하고 전력 소모가 작으며 인간의 두뇌처럼 병렬 구조로 고속 연산 처리를 한다.  
뉴로모픽 칩은 2008년 미국 국방부 고등 연구 계획국(DARPA)의 인지 컴퓨팅 프로젝트 시냅스(SyNAPSE: Systems of Neuromorphic Adaptive Plastic Scalable Electronics)의 지원으로 IBM에서 개발하였다. 
인간의 뇌에는 1,000억 개의 뉴런이 있는데, IBM에서 2014년 생산한 트루노스(TrueNorth) 칩은 4,096개의 코어를 갖고 있어 인간뇌 100만 개의 뉴런(neuron)과 2억 5,600만 개 시냅스(synapse)를 재현한다. 인간처럼 물체를 식별하고, 패턴 인식 등의 처리를 한다."
순방향 신경망,FeedForward Neural Network,FFNet,전방향 신경망,"데이터를 입력하면 연산이 입력층(input layer)에서 은닉층(hidden layer)을 거쳐 출력층(output layer)까지 순차적으로 진행되는 인공 신경망(ANN).  
순방향 신경망(FFNet)은 일반적인 인공 신경망(ANN)으로  입력 데이터는 모든 노드를 딱 한번만 거쳐 출력층으로 진행한다. 
 첫 번째 층은 입력층(input layer)이고 마지막 층은 출력층(output layer)이며 중간 은닉층(hidden layer)는 외부와의 연결이 없다. 또한, 각 계층(layer)의 노드들은 다음 계층의 노드로 연결되며 같은 계층 간의 연결이 없다. 이러한 이유로 순방향 신경망이라고 한다."
순환 신경망,Recurrent Neural Network,RNN,,"시계열 데이터(time-series data)와 같이 시간의 흐름에 따라 변화하는 데이터를 학습하기 위한 딥 러닝 모델.  기준 시점(t)과 다음 시점(t+1)에 네트워크를 연결하여 구성한 인공 신경망(ANN)이다.  
그러나 매 시점에 심층 신경망(DNN)이 연결되어 있을 경우 오래 전의 데이터에 의한 기울기 값이 소실되는 문제(vanishing gradient problem)로 학습이 어려워진다. 이를 해결하는 대표적인 모델로 장단기 메모리(LSTM: Long-Short Term Memory) 방식의 순환 신경망이 있다. "
콘볼루션 신경망,Convolutional Neural Network,CNN,합성곱 신경망,"심층 신경망(DNN: Deep Neural Network)의 한 종류로, 하나 또는 여러 개의 콘볼루션 계층(convolutional layer)과 통합 계층(pooling layer), 완전하게 연결된 계층(fully connected layer)들로 구성된 신경망.  CNN은 2차원 데이터의 학습에 적합한 구조를 가지고 있으며, 역전달(Backpropagation algorithm)을 통해 훈련될 수 있다.  
영상 내 객체 분류, 객체 탐지 등 다양한 응용 분야에 폭넓게 활용되는 DNN의 대표적 모델 중 하나이다."
심층 신경망,Deep Neural Network,DNN,,"입력층(input layer)과 출력층(output layer) 사이에 다중의 은닉층(hidden layer)을 포함하는 인공 신경망(ANN: Artificial Neural Network). 
심층 신경망은 다중의 은닉층을 포함하여 다양한 비선형적 관계를 학습할 수 있다. 그러나 학습을 위한 많은 연산량과 과하게 학습하여 실제 데이터에 대해 오차가 증가하는 과적합(overfitting), 기울기 값의 소실 문제(vanishing gradient problem) 등의 문제가 발생할 수 있다. 2000년대 이후 드롭아웃(drop-out), ReLU(Rectified Linear Unit), 배치 정규화(batch normalization) 등의 기법이 적용되면서 딥 러닝(deep learning)의 핵심 모델로 활용되고 있다.  
심층 신경망은 알고리즘에 따라 비지도 학습 방법(unsupervised learning)을 기반으로 하는 심층 신뢰 신경망(DBN: Deep Belief Network), 심층 오토인코더(deep autoencoder) 등이 있고, 이미지와 같은 2차원 데이터 처리를 위한 합성곱 신경망(CNN: Convolutional Neural Network), 시계열 데이터 처리를 위한 순환 신경망(RNN: Recurrent Neural Network) 등이 있다. "
인지 컴퓨팅,Cognitive Computing,CC,,"인간의 두뇌가 인지, 학습 및 추론하며 다양한 환경에 대응하듯이 동작하는 컴퓨팅.  
인공 지능(AI)보다 더 포괄적인 개념이다. 인공 지능(AI)이 인간의 신경망을 수학 통계학적 모델을 기반으로 하는 컴퓨팅 기술인 데 반해 인지 컴퓨팅(CC)은 인공 지능을 기반으로 인간의 두뇌가 시각, 청각, 촉각 등 오감으로 정보를 받아들여 인지하고 처리하여 응용하는 정보 처리 방식을 모델링한 기술이다.  
인지 컴퓨팅은 사람의 목소리, 얼굴 표정, 행동 특성, 주변 환경 등을 인식하여, 자연어로 대화하고 행동하며, 스스로 학습하여 추론한다. 이로써 인간이 처리하지 못하는 정형 및 비정형의 빅데이터를 분석하여 인간의 인지 능력을 증강시키고, 올바른 의사결정을 할 수 있도록 돕는다.  
대표적인 인지 컴퓨팅 플랫폼의 예로, IBM의 왓슨(Watson)이 있다. 왓슨은 금융, 교육 등 여러 전문 분야에서 활용되며, 의료 분야에서 암 진단 솔루션으로도 사용된다. "
대화형 사용자 인터페이스,Conversational User Interface,CUI,대화형 UI,"모바일 단말이나 개인용 컴퓨터(PC)가 사용자의 생체, 언어, 몸짓을 이해하여 사용자의 언어로 대화를 하면서 동작하는 지능형(intelligent) 사용자 인터페이스.  사용자 인터페이스(UI)는 사용자와 기기 사이에 서로 작용하는 인터페이스로 초기에는 키보드로 명령을 입력하는 문자 방식 사용자 인터페이스(CUI: character-based UI), 그 뒤 화면에 그래픽스를 사용한 그래픽 사용자 인터페이스(GUI: Graphical UI)를 거쳐 사용자 동작을 인식하는 엔유아이(NUI: Natural UI)로 진화하였다. 대화형 UI는 인공 지능, 음성 인식, 자연어 처리, 생체 인식 등 기술을 기반으로 하며 PC, 스마트폰, 자동차, 스마트 가전 기기 등 기기에서 사용될 수 있다. 예로, 사용자 음성 명령에 따라 작업을 수행하는 지능형 가상 비서(IPA: Intelligent Personal Assistant) 애플리케이션은 특히 스마트폰에서 중국 문자 사용자들의 한자 입력 불편함을 해소하기 위해 많이 사용된다.  대화형 UI는 매사추세츠 공과대학(MIT)의 과학 기술 잡지인 MIT 테크놀로지 리뷰(MIT Technology Review)에서 2016년 미래 사물 인터넷(IoT) 시대를 대표하는 기술로 선정되었다."
자동 통역,automatic speech translation,,,"서로 다른 언어를 사용하는 사람 간의 대화를 자동으로 통역하는 기술.  자동 통역 기술은 사람의 말소리를 자동으로 인식하여 해당 언어의 문자로 변환하는 자동 음성 인식(ASR: Automatic Speech Recognition), 한 언어의 문자를 다른 언어의 문자로 변환해 주는 기계 번역(MT: Machine Translation), 문자를 음성으로 변환해 주는 문자 음성 변환 합성(text-to-speech synthesis) 기술 등으로 구성된다. 자동 통역을 사용하여 언어 장벽으로 인한 의사소통 문제를 해결할 수 있다. 자동 통역을 위한 모바일 앱으로 한국전자통신연구원(ETRI)에서 개발한 ‘지니톡(GenieTalk)’, 네이버(Naver)사의 ‘파파고(papago)’ 등이 있다. "
적응적 동기,adaptive synchronization,Adaptive-Sync,어댑티브 싱크,"모니터의 화면 재생률을 고정하지 않고 그래픽스 카드(graphics card)의 프레임 전송에 맞춰 자동으로 변경시키는 기능.  적응적 동기(Adaptive Sync) 기능은 모니터의 화면 찢김(screen tearing) 현상을 줄이기 위한 것으로, 모니터의 재생률과 상관없이 그래픽스 카드와 동기를 맞춘다. 적응적 동기(Adaptive-Sync) 기능은 에이엠디(AMD: Advanced Micro Devices)사에서 개발된 프리싱크(FreeSync) 기술이며, 2014년 비디오 전자 공학 협회(베사 VESA: Video Electronics Standards Association)의 'DisplayPort 1.2a' 표준 기술로 채택되었다."
수직 동기,vertical synchronization,VSync,브이싱크,"그래픽스 카드(graphics card)의 영상 프레임을 모니터의 화면 재생률에 맞춰 전송하는 기능.  예를 들어, 대부분의 모니터가 초당 60 프레임을 표시하는데(재생률 60Hz), 그래픽스 카드가 초당 100 프레임을 표시할 수 있더라도, 수직 동기(VSync) 기능을 켜면 항상 60 프레임으로 고정된다. 수직 동기(VSync) 기능은 비디오 재생 시, 화면 찢김(screen tearing) 현상을 방지하기 위해 고화질의 그래픽스 게임에서 지원된다. 수직 동기(VSync)는 텔레비전에서 송신 측과 수신 측에서 하나의 필드를 주사하는 시작점을 일치시키기 위해 사용하는 수직 동기 신호(vertical synchronizing signal)의 이름에서 따온 것이다."
화면 찢김,screen tearing,,스크린 테어링,"모니터 화면이 찢어지듯 갈라지는 현상.  일반적으로 모니터는 초당 60 프레임의 화면 재생률(refresh rate)를 갖는데, 그래픽스 카드의 그래픽스 처리 장치(GPU)가 모니터 재생률에 맞춰 프레임을 전송하지 못해 발생되는 현상이다. 화면 찢김 현상은 주로 고화질의 게임에서 발생된다. 화면 찢김 현상을 줄이기 위해 그래픽스 카드의 표시 프레임을 고정시키는 수직 동기(V-Sync: vertical synchronization) 기능이나 모니터 화면 재생률을 가변시키는 적응적 동기(Adaptive-Sync: adaptive synchronization) 기능 등이 사용된다."
평면 디자인,flat design,,플랫 디자인,"이차원 그래픽스 사용자 인터페이스(GUI). 삼차원(3D) 공간으로 표현하지 않고, 단순히 레이아웃, 대비 등 기본적인 요소로만 디자인한다. 대표적인 예로, 마이크로소프트(Microsoft)의 윈도우 8(Windows 8)과 애플(Apple)사의 iOS7를 들 수 있다.
 반면, 애플(Apple)사의 iOS6 UI와 같이 삼차원적으로 현실의 사물 형태를 따라하는 디자인을 스큐어모피즘(skeuomorphism)라 한다. 플랫 디자인이 채용된 iOS7 UI는 iOS6 UI의 스큐어모피즘에 비해 아이콘이 단순하고 화면 구성이 명료하다."
유에스비-스카시 프로토콜,USB Attached SCSI Protocol,"UAS, UASP",,"유에스비(USB) 3.0 표준 규격에 스카시(SCSI) 프로토콜이 탑재되어 데이터 이동 속도가 개선된 컴퓨터 프로토콜. USB 3.0보다 데이터 전송 속도가 더 빠르고 안정되어 외부 저장 장치에 최적화된 작업 환경을 구현한다. 특히 SSD와 같은 메모리 장치 사용 시 속도가 크게 향상된다.
마이크로소프트(Microsoft) 윈도우 8(Windows 8)이나 애플(Apple) 맥(Mac) OS X 10.8, 리눅스(Linux) 커널에서 지원된다."
민하드웨어,bare metal / bare machine,,베어 메탈,"소프트웨어가 설치되어 있지 않은 컴퓨터 하드웨어.  베어메탈(bare metal)의 일반적 의미는 금속 재질이 그대로 드러나는 상태를 뜻하지만, IT 업계에서는 운영 체제(OS)를 포함하여 어떤 소프트웨어도 설치되어 있지 않은 하드웨어를 의미한다."
막대형 컴퓨터,PC-on-a-stick,,"스틱 컴퓨터, 스틱 PC","유에스비(USB) 메모리 장치 같이 생긴 작은 막대형 컴퓨터. 고화질 멀티미디어 인터페이스(HDMI) 포트가 지원되는 모니터만 있으면 막대형 컴퓨터(스틱 컴퓨터)를 바로 연결하여 인터넷, 동영상 재생, 문서 작성 등 간단한 작업을 할 수 있다. 막대형 컴퓨터는 크기는 작지만 컴퓨터의 주요 구성 요소인 프로세서, 램(RAM), 저장 장치(storage), 와이파이(Wi-Fi) 등이 제공되고 운영 체제도 설치되어 있으며, 마이크로 유에스비(USB) 포트에 전원을 연결하여 사용한다."
누름힘 접촉,force touch,,포스 터치,"터치스크린에 손가락으로 누르는 힘의 강도를 인식하여 다르게 동작하는 촉각 센서 기술. 터치 위치뿐만 아니라 터치의 강도를 감지하는 누름힘(force) 센서를 더하여 사용자에게 빠르고 편리한 인터페이스를 제공한다. 예를 들어, 그림판에서 선을 그릴 때 약하게 누르면 가는 선, 강하게 누르면 굵은 선이 나온다. 누름힘 접촉(포스 터치)는 애플(Apple)사의 애플워치, 맥북 등에 적용되었으며, 아이폰6s에는 3가지 압력을 구분하는 포스 터치(3D터치) 기술이 적용되었다."
공개 소스 하드웨어,Open-Source Hardware,OSHW,오픈 소스 하드웨어,"하드웨어 설계(design) 내용과 관련 정보가 공개되어, 누구나 동일하게 만들고, 수정, 배포, 제조하여 팔 수 있는 하드웨어.  OSHW는 자유·공개 소스 소프트웨어(FOSS: Free and Open-Source Software)와 같이 소스 공개를 통해 기술과 제품을 더욱 발전시키는 데 목적이 있다. 따라서 하드웨어 제작에 필요한 회로도, 인쇄 회로 기판(PCB) 설계도면, 제작 과정 등 필요한 모든 정보의 공개를 원칙으로 한다. OSHW는 누구나 쉽게 구할 수 있는 부품, 재료, 표준 가공 방법, 개방 시설, 공개 콘텐츠, 공개 소스 소프트웨어(OSS) 등을 사용하는 것이 이상적이다. OSHW를 배포하기 위해서는 하드웨어를 설계한 문서 공개, 공개 범위 명시, 제작에 필요한 소프트웨어 공개, 저작권 표시 여부, 특정 개인이나 단체 차별 금지, 활용 분야 차별 금지 등을 준수하여야 한다.  ※ 참고: 오픈 소스 하드웨어 협회(OSHWA: Open Source Hardware Association)의 오픈 소스 하드웨어 정의"
대규모 다중 접속 온라인 역할 게임,Massively Multiplayer Online Role-Playing Game,MMORPG,대규모 다중 사용자 온라인 롤플레잉 게임,"수백 또는 수천 명 이상이 동시에 같은 게임에 접속하여 각자 맡은 등장인물의 역할을 수행하고 서로 협업하며 즐기는 온라인 게임.  MMORPG는 대규모 다중 이용자(MMO)와 역할 게임( RPG )의 합성어로,  RPG 와의 차이점은 수백, 수천 또는 수만 명의 이용자들이 동시에 게임에 접속할 수 있는 대규모 온라인 RPG를 뜻한다. 
한 게임 안에서 수백, 수천 명의 플레이어들이 서로 등장 인물(캐릭터)을 맡아 역할을 수행하면서, 다른 플레이어들과 정보를 공유하고 함께 집단 전투 활동 등을 하면서 성취감, 동질감, 소속감 등을 갖는다.  
MMORPG에서는 이용자가 게임에 접속하는 것에 상관없이 현실과 같이 게임은 계속 진행된다. 즉, 이용자가 다시 게임에 접속하면 종료한 시점에서 시작하지 못한다. 
1996년 넥슨(NEXON)사의 '바람의 나라', 미국 오리진 시스템즈(Origin Systems)의 ‘울티마 온라인’ 게임 등으로 그래픽스 기반 MMORPG의 대중화가 시작되었다. 이후 초고속 인터넷이 보급되면서 엔씨소프트의 리니지(1998년), 소니온라인엔터테인먼트의 에버퀘스트(1999년), 블리자드 엔터테인먼트의 월드 오브 워크래프트(2004년 출시) 등의 세계적인 흥행으로 게임의 주류로 자리잡게 되었다. 
4G 이동통신( IMT-Advanced ), 와이파이(Wi-Fi) 등 기술 발전으로 데이터 사용 한도가 커지고 속도가 빨라지면서 모바일 MMORPG의 이용이 증가되었다."
양자 정보 과학,Quantum Information Science,QIS,,"양자 효과(quantum effect)에 종속되는 정보 과학의 연구 분야. 즉, 양자 정보(quantum information, state of photon)의 연구 분야로 양자 컴퓨터, 양자 통신 등의 기초 과학이다. 
양자는 더 이상 나눌 수 없는 에너지의 최소량의 단위로 중첩(superposition) 가능, 복제 불가능, 얽힘(entanglement) 상태 유지, 원격 전송 등의 특성이 있다. 양자 정보 과학(QIS)은 이런 양자의 특성을 활용한 양자 암호 통신, 양자 컴퓨터, 양자 통신 등의 분야를 포함한다. 양자 암호 통신은 양자의 복제 불능 특성을 이용하여 완벽한 보안 통신 구현이 가능하고, 양자 컴퓨터는 초고속 연산이 가능하여 기존 PC에서 100만 년 걸릴 연산을 10분 내에 처리할 수 있다. 또한, 양자 통신의 경우도 묶음 단위 정보 전송으로 현재의 광통신보다 100만 배 빠른 속도로 정보를 전송하는 것이 가능하다."
기계 학습,Machine Learning,ML,머신 러닝,"인공 지능(AI)의 한 분야로 컴퓨터가 여러 데이터를 이용하여 학습한 내용을 기반으로 새로운 데이터에 대한 적절한 작업을 수행할 수 있도록 하는 알고리즘과 기술을 개발하는 분야.  
기계 학습은 학습 방식에 따라 지도 학습(supervised learning, 감독 학습), 준지도 학습(semi-supervised learning), 비지도 학습(unsupervised learning, 자율 학습), 강화 학습(reinforcement learning)으로 분류된다.  지도 학습(supervised learning)은 미리 구축된 학습용 데이터(training data)를 활용하여 모델을 학습하며, 준지도 학습(semi-supervised learning)은 학습용 데이터와 정리되지 않은 데이터를 모두 훈련에 사용하는 방법이다. 비지도 학습(unsupervised learning)은 별도의 학습용 데이터를 구축하는 것이 아니라 데이터 자체를 분석하거나 군집(clustering)하면서 학습한다. 강화 학습(reinforcement learning)은 학습 수행 결과에 대해 적절한 보상을 주면서 피드백을 통해 학습한다."
은닉 마르코프 모델,Hidden Markov Model,HMM,,"상태(state) 정보가 은닉된 통계적 마르코프 모델. 기본 마르코프 모델에서는 시간(t)에 따른 상태(state) 정보가 관찰되나, 은닉 마르코프 모델(HMM)에서는 상태(state) 정보가 숨겨져 있고 출력(output)된 정보만 관찰된다. 따라서 출력된 정보만을 가지고 숨겨진 상태(state) 정보를 추정한다. 은닉 마르코프 모델(HMM)은 음성 인식, 자연어 처리, 몸짓 인식(gesture recognition) 등과 같이 대량으로 출력된 데이터를 통계적으로 패턴 분석하여 입력된 정보를 추론하는 데에 응용된다. 예로, 음성 인식 분야에서는 주어진 음성의 문자열(은닉 상태)을 찾기 위해 음성 신호의 변동을 확률 변수로 취급하여 입력 음성의 흔들림 등이 잘 분석된다."
4D 프린팅,fourth dimension printing,4D printing,환경 반응 입체 프린팅,"미리 설계된 시간이나 임의 환경 조건이 충족되면 스스로 모양을 변경 또는 제조하여 새로운 형태로 바뀌는 제품(object)을 3D 프린팅하는 기술.  4D 프린팅을 위해서 온도, 습도, 진동 등 에너지에서 자극을 받으면 모양이 변하는 스마트 소재가 사용된다. 예를 들면, 물을 만나면 팽창되는 나무를 소재로 하는 입체 프린터(3D printer)로 코끼리 모양의 평면 설계도를 출력한다. 그리고 출력된 설계도를 물에 넣으면 저절로 입체 코끼리 모양으로 바뀐다. 4D 프린팅 기술은 2013년 테드(TED: Technology, Entertainment, Design) 강연에서 미국 MIT 자가조립연구소 스카일러 티빗츠(Skylar Tibbits) 교수에 의해 소개되었다. 4D 프린팅은 의료, 의류 등 다양한 분야에 활용될 수 있다. ※ 여기서, 4D(4th dimension)는 수학·물리의 4차원(4D: four-dimensional space)과 다르다."
C형 유에스비,Universal Serial Bus Type-C,"USB Type-C, USB-C",,"기기 간 데이터 전송을 위한 유에스비(USB) 케이블 단자의 위아래가 동일한 24핀의 유에스비(USB).  USB 규격을 제정하는 USB-IF(USB Implementers Forum)에 의해 2014년 USB Type-C 규격(1.0 버전)이 발표되었다. C형 USB(USB Type-C)는 단자 위아래 구분 없이 어느 쪽으로든 연결할 수 있어 편리하다. 특징은 초당 최대 10 기가비트(Gbps) 빠른 속도를 제공하고, 최대 100 W의 전력을 공급한다. 따라서 전원 케이블 없이 스마트폰과 프린터를 USB Type-C만으로 연결하여 사진을 전송하여 출력할 수 있다. USB Type-C를 지원하는 기기나 어댑터를 연결하여 사용될 수 있다.  "
개체명 인식,Named-Entity Recognition,NER,,"미리 정의해 둔 사람, 회사, 장소, 시간, 단위 등에 해당하는 단어(개체명)를 문서에서 인식하여 추출 분류하는 기법.  추출된 개체명은 인명(person), 지명(location), 기관명(organization), 시간(time) 등으로 분류된다. 개체명 인식(NER)은 정보 추출을 목적으로 시작되어 자연어 처리, 정보 검색 등에 사용된다. 

※ 예:철수[인명]는 서울역[지명]에서 영희[인명]와 10시[시간]에 만나기로 약속하였다."
프레임 간 예측 부호화,interframe predictive coding,,,"영상 부호화 방법의 하나로, 시간 축 방향으로 나열된 화면 간에 매우 높은 상관성을 이용하여 현재 화면의 신호와 이전 화면에서 예측된 신호의 차이만을 부호화하는 방식.  일반적으로 동영상은 시간축 방향으로 인접 화면 간 진폭이 급격하게 변화하지 않기 때문에 매우 높은 상관성을 갖게 된다. 따라서, 프레임 간 예측 부호화를 사용하면 시간적 중복성을 제거할 수 있게 되어, 매우 높은 부호화 효율을 얻을 수 있다. 프레임 간 예측 부호화는 크게 움직임 예측(motion prediction), 움직임 보상(motion compensation) 및 예측 오차, 예측 오차의 양자화 및 부호화 단계를 거친다. 프레임 간 예측 부호화는 동영상 압축 방식의 핵심 기술로 엠펙(MPEG) 등 거의 대부분 표준에서 사용되고 있다."
프라이버시 마스킹,privacy masking,,"데이터 마스킹, 개인정보 가림","이미지나 영상 등에서 다른 공개된 정보와 결합되어 개인을 식별하는 데 도구가 될 수 있는 민감 데이터(예: 식별자)를 보이지 않도록 처리하여 식별할 수 없도록 하는 것.  
카메라로 촬영되거나 온라인으로 전송되는 이미지에서 민감한 정보가 되는 부분을 암호화하거나 마스킹(masking)을 하여 식별될 수 없도록 처리함으로써 개인정보가 노출되는 사고를 방지한다.  
대표적인 예로, CCTV 프라이버시 마스킹은 실시간으로 감시·녹화되는 화면에서 인가되지 않은 화면은 녹화되지 않게 하거나 식별되지 않도록 흐릿하게 하거나 모자이크 처리하는 기술이다. "
스마트 계약,smart contract,,스마트 콘트랙트,"분산 원장 기술(DLT: Distributed Ledger Technology)(예: 블록체인)에서 거래의 일정 조건을 만족시키면 당사자 간에 자동으로 거래가 체결되는 기술.  
스마트 계약 시스템에 거래 조건과 내용을 등록하면 그에 해당되는 법률 및 절차 등이 자동으로 적용되어 거래 당사자에게 결과가 전달된다. 따라서, 거래 절차가 간소화되고 거래상 발생되는 비용도 절감될 뿐만 아니라, 거래 당사자 간에 안전한 계약이 이뤄질 수 있다.  
예를 들어, 보험회사와 병원은 스마트 계약을 통해 환자 의무기록은 보호하면서 보험료를 자동 지급함으로써 지급 결제 시스템을 간소화하고, 위변조가 어려운 원장을 만들어 보험 사기를 방지할 수 있다.  
스마트 계약을 지원하는 대표적인 플랫폼으로 이더리움(Ethereum)이 있다.  
스마트 계약(smart contract) 용어는 1996년 컴퓨터 과학자인 닉 사보(Nick Szabo)가 제시하였다. 닉 사보는 스마트 계약을 ‘디지털 형식으로 명시된 일련의 약속으로, 당사자가 약속을 이행하는 프로토콜을 포함한다’라고 하였다."
준식별자,Quasi-IDentifier,QID,,"연령, 성별, 거주 지역, 국적 등과 같이 해당 데이터만으로는 직접적으로 특정 개인을 식별할 수는 없지만, 다른 정보와 결합하여 개인을 식별할 수 있는 데이터.  데이터 자체만으로는 단일 식별자(Unique IDentifier)가 되지 않아 준식별자들끼리 결합이 되어야 단일 식별자가 된다. 준식별자의 예로 우편번호, 성별, 취미, 혈액형, 신장, 신용 등급, 학교명, 가족 정보, 위치 기록 등이 있다.  
※ 출처: 개인정보 비식별화에 대한 적정성 자율평가 안내서, 한국정보화진흥원"
신뢰 실행 환경,Trusted Execution Environment,TEE,,"메인 프로세서 내 별도로 독립된 보안 영역(secure area)이 제공하는 안전한 실행 환경.  일반 영역(normal area)과 보안 영역(secure area)이 따로 분리된 프로세서에서, 보안 영역에는 생체 정보, 결제 정보, 기업 보안 문서 등의 중요한 정보가 저장된다. 일반 영역과의 정보 교환이 통제되고 보안 소프트웨어가 안전하게 실행될 수 있다.   
개인 정보가 많은 스마트폰에 주로 사용된다. 신뢰 실행 환경(TEE)를 구현하는 대표적인 상업 솔루션으로 암(ARM)사의 트러스트존(TrustZone)이 있다.  
※ TEE 국제 표준은 비영리 표준화 기구인 글로벌플랫폼(GlobalPlatform)에서 2010년 처음 제정되었다(TEE Client API v1.0)."
재식별화,re-identification,,,"비식별화(de-identification)된 개인정보를 다른 정보와 조합, 분석, 또는 처리하여 특정 개인을 다시 식별할 수 있게 하는 일련의 과정 또는 방법.  식별 방지된 개인정보는 제3자가 웹, SNS, 의료 기록 등 빅데이터를 수집, 분석하는 과정에서 고의 또는 실수로 재식별시킬 수 있어 개인정보가 유출될 수 있다. 사전동의 없이 재식별된 개인정보는 즉시 파기하거나 식별할 수 없도록 변환해야 한다.  국제표준화기구 ISO/IEC 20889 표준은 재식별화(re-identification)를 '데이터로부터 원래의 정보주체의 비식별화 데이터 집합을 귀속시키는 과정'이라 정의한다. "
비식별화,de-Identification,,"익명화, 식별 방지","특정 개인을 식별할 수 없도록 개인정보의 일부 또는 전부를 변환하는 일련의 과정 또는 방법.  개인 식별 요소로는 이름, 주소, 주민등록번호, 생년월일, 전화번호, 이메일 주소, 의료기록번호 등과 같이 그 자체로 특정 개인을 직접 식별할 수 있는 식별자(identifier)와 연령, 성별, 거주 지역, 국적, 홈페이지URL 등과 같이 다른 정보와 결합하여 식별할 수 있는 준식별자(quasi-identifier)가 있다.  
비식별화 방법으로 식별 요소 중 다른 값으로 대체하는 가명처리, 데이터의 종합 값만 보여주고 개별 데이터는 보여주지 않는 총계처리, 일부 식별 요소를 지우는 데이터 삭제, 데이터 정확한 값은 감추고 범주 값으로 변환하는 범주화, 중요 식별자가 보이지 않게 하는 데이터 마스킹 방법 등이 있다.  
비식별화된 개인정보는 웹, SNS, 의료 기록 등 빅데이터 수집·분석 과정에서 재식별화(re-identification) 될 수 있어 엄격한 관리가 필요하다.  
비식별화와 유사한 용어로 익명화(Anonymization)가 사용되는데, 익명화는 개인정보를 더 이상 식별할 수 없도록 하는 것을 의미한다. 
국제 표준화 기구 ISO/IEC 20889 표준은 '비식별화 과정'을 '정보주체와 식별속성의 집합 간에 연계를 제거하는 과정', 그리고 '비식별화 기술'은 '정보가 개인정보 주체와 연계되는 정도를 감소할 목적으로 데이터 집합을 변환하는 방법' 이라 정의한다.   "
분산 원장 기술,Distributed Ledger Technology,DLT,,"분산된 피투피(P2P: Peer-to-Peer) 망 내 참여자들이 모든 거래 목록을 지속적으로 갱신하는 디지털 원장(출처 : ITU-T FocusGroup on DFS).  
중앙 관리자나 중앙 데이터 저장소가 없으며, 피투피(P2P) 망 내 모든 참여자(peer)가 거래 장부를 서로 공유하여 감시 관리하기 때문에 장부 위조를 막는다.  
분산 원장 기술이 사용된 대표적인 예가 블록체인(Blockchain)이다. "
트러스트존 기술,TrustZone technology,,,"프로세서(processor) 안에 독립적인 보안 구역을 따로 두어 중요한 정보를 보호하는 하드웨어 기반의 보안 기술.  
암(ARM: Advanced RISC Machine)사에서 개발하였다(ARM® TrustZone®). 트러스트존(TrustZone) 기술은 하드웨어에서 직접 실행되며 하나의 CPU를 2개의 가상 공간, 즉 일반 구역(normal world)과 보안 구역(secure world)으로 분할하여 관리한다. 
보안이 필요하지 않은 작업은 일반 구역에서 실행되고, 보안이 필요한 작업은 보안 구역에서 실행된다. 
모바일 프로세서(AP), 컴퓨터 중앙 처리 장치(CPU)에 트러스트존 기술을 적용하여 스마트폰이나 태블릿PC, 컴퓨터 등에 저장된 결제, 인증서, 회사 기밀정보 등 중요한 정보와 응용 프로그램을 외부 공격에 노출하지 않고 운영 체제(OS) 수준에서 안전하게 보호할 수 있다. 
모바일 신뢰 보안 모듈(MTM: Mobile Trusted Module)은 별도의 보안 칩이 필요한 반면, 트러스트존 기술은 모바일 프로세서에 보안 기술을 적용한다. "
모바일 기기 기본 보호프로파일,Mobile Device Fundamentals Protection Profile,MDFPP,모바일 기기 공통 보호프로파일,"국제 공통평가기준(CC: Common Criteria)을 준용하여 모바일 기기에 대한 보안 인증 요구 사항을 기술한 국제 표준.  
스마트폰, 태블릿PC 등 모바일 기기 보안의 핵심이 되는 키 관리(key management), 암호 모듈, 기기 암호화, 와이파이(Wi-Fi) 보안, 화면 잠금(screen lock) 및 단말 관리 등에 대해 80여 개의 보안 요구 사항을 기술한다. 
2013년 10월 모바일 기기의 국제 보안 인증을 위해 미국 국가정보보증협회(NIAP: National Information Assurance Partnership) 주도로 영국, 캐나다 등의 정부기관과 삼성전자, 애플(Apple), 마이크로소프트(Microsoft), 블랙베리(Blackberry), 모토로라(Motorola) 등 글로벌 기업이 함께 만들었다.  
※ 미국 국가정보보증협회(NIAP)는 1997년 미국 국립표준기술연구소(NIST)와 국가안보국(NSA) 주관으로 설립한 공통평가기준(CC) 인증기관이다."
간편 결제 서비스,Simple Payment Service,,,"온라인과 오프라인 상거래에서 빠르고 간편하게 결제하는 전자 결제 서비스. 
스마트폰, 스마트워치 등 기기에 저장된 생체 정보, 신용 카드 정보 등을 이용하여 바로 결제되기 때문에 추가적인 인증 수단이 필요하지 않다.
간편 결제 서비스를 위해 지문, 홍채, 손바닥 정맥 등 생체 정보를 이용한 생체 인식 결제, 근거리 무선 통신(NFC) 방식, QR코드 방식,  마그네틱 안전 전송 (MST) 방식, 일회용 가상 카드번호를 활용하는 앱 카드 결제 방식 등이 이용된다. 
간편 결제 서비스는 이용자들이 안전하고 쉽고 빠르게 이용할 수 있도록 높은 보안성과 간단한 사용자 인터페이스(UI)를 제공한다. 
대표적인 예로, 온라인 기반의 페이코(PAYCO)와 카카오페이(kakaopay), 신용카드 기반의 삼성페이(Samsung Pay) 등이 있다. 
"
개인정보보호 규정,General Data Protection Regulation,GDPR,,"유럽 의회에서 유럽 시민들의 개인정보 보호를 강화하기 위해 만든 통합 규정. 
2016년 유럽 의회에서 공표되었으며(Regulation(EU) 2016/679), 약 2년 간의 유예 기간을 갖은 후 2018년 5월 25일부터 EU 각 회원국에서 시행된다. 유럽 연합(EU)의 시민의 데이터를 활용하는 경우 GDPR을 준수해야 한다.  
GDPR의 주요 항목은, 사용자가 본인의 데이터 처리 관련 사항을 제공 받을 권리(the right to be informed), 열람 요청 권리(the right of access), 정정 요청 권리(the right to rectification), 삭제 요청 권리(the right to erasure), 처리 제한 요청 권리(the right to restrict processing),  데이터 이동 권리 (the right to data portability), 처리 거부 요청 권리(the right to object), 개인정보의 자동 프로파일링 및 활용에 대한 결정 권리(rights in relation to automated decision making and profiling) 등이다.  
이 중, 삭제 요청 권리(the right to erasure)는 기존 GDPR 초안의  잊힐 권리 (the right to forgotten)에서 명칭이 바뀌었다. 개인정보의 자동 프로파일링 및 활용에 대한 결정 권리(rights in relation to automated decision making and profiling)는 마케팅의 일환으로 개인의 직업, 취미, 위치 등이 자동 수집·처리되어 활용되는 경우에 대해 데이터 주체자인 사용자에게 고지, 활용 여부 결정 및 거부할 수 있는 권리 등에 대한 것이다."
데이터 이동 권리,the right to data portability,,정보 이동 권리,"사용자가 이용 중인 서비스에서 자신의 개인 데이터를 다른 곳으로 이동할 권리.  
데이터 이동 권리는 특정인에 의한 사용자 개인정보의 독점 사용 또는 사용자의 동의 없는 무단 사용 등으로부터 정보 주체를 보호하기 위함이다. 
사용자는 현재 이용하는 서비스에서 자신의 메일 정보, 사진 등의 개인 데이터를 다른 서비스로 복사, 이동, 전달을 쉽게 할 수 있어야 한다. 
2016년 유럽 의회에서 유럽 시민들의 개인정보 보호를 강화하기 위해 만든  개인정보보호규정 ( GDPR : General Data Protection Regulation) 항목 중 하나이다. GDPR은 2018년 5월 25일부터 EU 회원국에서 시행된다. "
출구 필터링,egress filtering,,이그레스 필터링,"내부 통신망의 라우터나 방화벽에서 외부로 나가는 데이터의 속성을 검사하고 흐름을 제어하는 보안 방법.   조직 내부에 존재하는 공격의 위협이 밖으로 전파되지 않도록 한다. 
예를 들어, 내부 컴퓨터가 분산 서비스 거부 공격(DDoS attack)으로 좀비 PC가 된 경우 외부 컴퓨터를 감염시키지 못하게 차단하여 감염 피해를 최소화시킬 수 있다.
반대로 내부 통신망에 유입되는 외부 데이터를 검사하여 유해하다고 판단되면 차단하는 입구 필터링(ingress filtering) 방법이 있다."
양자 암호 키 분배,Quantum Key Distribution,QKD,,"양자 통신을 위해 비밀 키를 분배·관리하는 기술.  보안이 필요한 두 시스템에 양자 암호 키 분배(QKD) 시스템을 설치ㆍ운용함으로써, 두 시스템은 암호 알고리즘 동작에 필요한 비밀 키를 안전하게 공유할 수 있다. 양자 키 분배를 위해 얽힘 상태 광자 쌍을 이용하거나, 단일 광자를 이용하는 방법이 있다."
비대면 본인 인증,non-face-to-face identification,,,"고객이 금융 계좌 개설 또는 모바일 지급결제 시, 금융회사가 고객과 계좌의 명의인이 일치하는지 대면으로 확인하지 않고 본인임을 확인하는 방법.   비대면 인증 방법은 크게 4가지로 분류할 수 있다. 비밀번호·서명 이미지 등 지식 기반 인증 방법, SMS·이메일 등 소지 기반 인증 방법, 지문·얼굴·홍채·정맥 등 생체 인식 기반 인증 방법, 위치·접근 기록 등 질의 응답 방식의 특징 기반 인증 방법 등이 비대면 인증 방법으로 사용될 수 있다. 미국과 영국, 일본, 호주 등은 계좌 개설 시 금융회사가 고객을 확인할 수 있도록 ‘자금세탁·테러 방지 관련 법령’에서 규정한다. 그렇기 때문에 계좌를 개설할 때 꼭 대면으로 고객을 확인하지 않고도 비대면으로 계좌를 개설할 수 있다."
지능형 사이버 위협 대응,Cyber Threat Intelligence,CTI,사이버 위협 인텔리전스,"조직의 정보(information) 자산에 위협이 될 수 있는 취약 요소, 과거 공격 등 관련 정보를 기반으로 사이버 보안 위협에 효과적으로 대응하는 방법. 지능형 사이버 위협 대응(CTI)은 과거 조직 내부뿐만 아니라 여러 외부 조직에서 겪었던 많은 위협 정보를 수집·분석·활용하여, 지능형 지속 위협(APT)과 같은 공격을 사전에 방어한다."
래드섹 프로토콜,RadSec,,,"네트워크 이용자의 인증을 위해 전송 제어 프로토콜(TCP: Transmission Control Protocol)과 전송 계층 보안(TLS: Transport Layer Security)을 통해 레이디어스(RADIUS: Remote Authentication Dial In User Service) 데이터를 전송하기 위한 프로토콜.  래드섹(RadSec)은 ‘RADIUS over TLS(Transport Layer Security)’의 준말이다. RADIUS는 원격지 이용자의 접속 요구 시 이용자 아이디(ID)나 패스워드, IP 주소 등의 정보를 인증 서버에 보내어 인증, 권한 부여, 과금 등을 수행한다. 그러나 RADIUS는 신뢰성이 담보되지 않은 사용자 데이터그램 프로토콜(UDP: User Datagram Protocol) 전송으로 보안에 취약하다. 이러한 RADIUS 문제점을 보완한 프로토콜이 래드섹(RadSec)이다. RadSec은 신뢰성이 보장된 TCP 전송, TLS 암호화 통신 사용, 그리고 통신 주체 간 인증서 교환을 통한 상호 인증을 제공한다."
다이어 악성코드,Dyre malware,,,사용자 컴퓨터에 악성코드를 설치하는 트로이목마의 한 종류.  주로 윈도우(Windows) 운영 체제를 사용하는 금융 기관을 대상으로 전자우편(이메일) 첨부 파일을 통해 악성코드를 유포한다. 첨부 파일을 실행시키면 악성 프로그램이 설치되거나 가짜 웹사이트로 접속되어 금융 정보가 유출된다.
토큰화,tokenization,,,"모바일 결제 시스템에서, 신용카드와 같은 개인 정보를 보호하기 위해 관련 정보를 토큰으로 변환하여 사용하는 방식.  금융 보안 분야에서 개인 정보를 보호하기 위해 보호되어야 할 신용카드나 개인 정보를 토큰화 하여 결제 시 원본 데이터 대신 토큰 데이터를 사용한다. 토큰화 기술이 적용된 상점의 판매 시점 관리(POS) 결제 단말은 고객의 신용카드 정보 대신 정보를 변환한 토큰 데이터만 저장한다. 대신 토큰 서버(token server)가 신용카드 정보와 토큰 데이터를 저장하고 관리한다. 토큰화 기술은 토큰 데이터가 저장 장소나 전송 과정에서 유출되어도 원본 데이터가 아니기 때문에 도용될 가능성이 적다. 그러나 토큰의 생성 알고리즘이나 토큰 서버의 보안 강화가 요구된다. 토큰화 기술은 2014년 EMV 카드 표준으로 제정되었다"
양자 암호,quantum cryptography,,,"양자 역학적 특성을 이용한 암호 기술.  일반 채널로는 기존 일반 암호화 방식으로 생성된 암호문을 보내고, 양자 채널에서 양자 암호 키 분배(QKD: Quantum Key Distribution) 프로토콜을 이용하여 비밀 키를 공유한다."
자동 계정 생성 방지 기술,Completely Automated Public Turing test to tell Computers and Humans Apart,CAPTCHA,캡차 인증,"주로 웹사이트 회원 가입 절차에서 사용자가 사람인지 컴퓨터인지를 판별하기 위한 시도 응답 인증 방식(challenge-response authentication mechanism).  자동 계정 생성 방지 기술(캡차 인증)은 컴퓨터가 구별할 수 없는 찌그러진 문자나 단번에 인식하기 어려운 숫자 등을 문제로 내 사람만 캡차 시스템을 통과할 수 있게 만든다. 캡차는 초기부터 무료로 제공됐다. 캡차는 이용이 많아지며 모습도 진화했는데, 시각장애인을 위해 소리로 문자를 읽어주는 오디오 캡차도 있다. 소리에 임의의 문자 음과 잡음을 섞어 프로그램이 아닌 사람만이 테스트를 통과하도록 한다. 이 밖에도 간단한 계산식을 이용해 문제를 내거나 한글을 섞어 해외에서의 악성적인 이용을 막는 캡차도 있다."
용도 자유 대역,K-ICT Free Band,,프리 밴드,"기기 간 혼신 방지를 위한 최소한의 기술기준만 충족하면 허가·신고 없이 자유롭게 사용할 수 있는 주파수 대역.  전파의 창의적 이용을 확산시키고, 늘어나는 사물 인터넷(IoT) 서비스 수요나 새롭게 출현될 다양한 정보통신기술(ICT) 수요에 유연하게 대응하기 위하여 우리나라에서 지정한 대역이다. 원격검침이나 스마트 홈 등 장거리 사물 인터넷(IoT) 서비스 등에 쓸 수 있는 262 ∼ 264 MHz(2MHz 대역폭), 소출력 레이더 또는 5세대(5G) 이동통신용 모바일 백홀 등에 활용할 수 있는 24 ∼ 27 GHz(3 GHz 대역폭), 초고대역인 64 ∼ 66 GHz(2 GHz 대역폭), 122 ∼ 123 GHz(1 GHz 대역폭), 그리고 244 ∼ 246 GHz(2 GHz 대역폭) 대역이 용도 자유 대역으로 지정되어 있다."
인터넷 밈,Internet meme,,,"인터넷에서 이미지, 동영상, 해시태그, 유행어 등의 형태로 급속도로 확산되어 사회 문화의 일부로 자리 잡은 소셜 아이디어, 활동, 트렌드 등을 일컫는 말.  귀여운 아기나 동물의 영상에 재밌는 글을 넣거나, 드라마나 영화 등을 패러디하는 등 다른 사람에게 재미를 주기 위한 것이 대부분이지만, 기부를 활성화를 위해 페이스북(Facebook)에서 유행된 아이스 버킷 챌린지(Ice Bucket Challenge)처럼 사회 문화를 전파하기도 한다.  
인터넷 밈(Internet meme)은 리처드 도킨스(Richard Dawkins)의 이기적 유전자(The Selfish Gene)(1976) 책에서 제시된 학술 용어인 밈(meme)에서 파생된 말이다. 이 책에서 밈은 인간의 사고와 문화도 마치 유전자처럼 복제되고 전파되는 것이라고 한다.  우리나라의 대표적인 인터넷 밈으로 ‘짤방’(짤림방지의 준말)이 있다. 짤방은 인터넷에 올린 글이 삭제되는 것을 막기 위해 재미있고 웃긴 사진이나 영상 등을 글과 같이 올리는 것을 말한다. "
가짜 클릭 농장,click farm,,클릭 팜,"인터넷에서 특정 앱 다운로드 수, 상품 조회 수 등을 조작하기 위해 가짜 클릭을 대량으로 생산하는 곳.  클릭 사기(click fraud)의 한 형태다. 클릭 농장 업체들은 저임금 노동자와 수 만대의 스마트폰을 이용해 클릭 사기를 친다. 스마트폰으로 특정 앱을 계속 다운로드하거나, SNS와 메신저 앱을 통해 특정 웹사이트의 페이지뷰 수를 올리고 ‘좋아요’와 ‘공유’를 계속 클릭하여 순위를 올린다. 이로 인해, 이용자들은 제품 구매 시 피해를 보게 되며, 조회 수나 추천 수에 대한 신뢰도가 낮아진다. "
브레드크럼즈,breadcrumbs,,,"프로그램, 문서, 웹사이트 등에서 사용자의 탐색 경로를 시각적으로 제공해 주는 그래픽 사용자 인터페이스(GUI: Graphical User Interface).  사용자가 복잡하게 탐색하는 과정에서 자신의 위치를 파악할 수 있게 하고, 계층적 탐색 경로 등을 시각적으로 보여 주는 등 편의를 제공한다. 예로, 전자상거래 경우 로그인, 쇼핑, 주문, 배송 정보 입력, 결제 정보 입력, 결제 완료 과정에 유용하다. 브레드크럼즈(breadcrumbs)는 헨젤과 그레텔 동화에서 자취를 남기기 위해 떨어뜨린 빵부스러기에서 이름을 인용하였다. ※ 웹사이트 브레드크럼즈 예제 : Home &gt; 자료마당 &gt; 간행물 &gt; 연구보고서"
전자 개척자 재단,Electronic Frontier Foundation,EFF,,"인터넷에서 표현의 자유와 권리를 옹호하는 국제 비영리 단체. 표현의 자유, 개인정보 보호, 공정 이용, 저작권, 정보 공개 등을 위해 법률적 지원과 소프트웨어 개발, 언론 활동 등 다양한 방법으로 활동한다. 1990년 미국, 샌프란시스코에서 설립되었으며, 후원금으로 운영된다. 
전자 개척자 재단(EFF)은 2012년 모질라(Mozilla) 등 70여개 단체들과 함께 미국 의회에 제출된 온라인 저작권 침해 금지 법안(SOPA: Stop Online Piracy Act)과 지식재산권 보호 법안(PIPA)에 대하여 반대하는 공개서한을 의회로 보내는 등 법안 반대 운동을 펼쳤다.

※ 온라인 저작권 침해 금지 법안(SOPA: Stop Online Piracy Act): 인터넷상에서 저작권이 침해된 경우 법적 조치(웹사이트 차단 등)의 내용 포함
※ 지식재산권 보호 법안(PIPA: Preventing Real Online Threats to Economic Creativity and Theft of Intellectual Property Act of 2011, PROTECT IP Act):  경제적 창의성에 대한 실질적 온라인 위협 및 지식재산권 침해 방지 법안으로 저작권을 침해한 웹사이트로의 접속을 제한하게 하는 수단을 명시 "
웹 표준,Web standards,,,"월드 와이드 웹(WWW)을 구현하기 위해 따라야 할 표준 또는 규격.  다양한 웹 기술을 통해 수많은 콘텐츠가 공유되고 확산되면서, 웹 접근성, 사생활 보호, 보안, 국제화 등을 고려한 웹 기술의 표준화가 필요하게 되었다. 국제 표준화 기구로 월드 와이드 웹 컨소시엄(W3C)이 있으며, 대표적 웹 표준으로 하이퍼텍스트 생성 언어(HTML), 확장성 하이퍼텍스트 생성 언어(XHTML), 종속형 시트(CSS: Cascading Style Sheets), 자바스크립트(JavaScript), 웹 사용에 대한 웹 콘텐츠 접근성 지침 등이 있다."
시민 해킹,civic hacking,,시빅 해킹,"인터넷상에 ICT 개발자 등 다양한 시민들이 자발적으로 모여 사회 공공 문제를 ICT 기술을 활용하여 정보를 신속하게 취득해 창의적으로 해결하려는 활동.  시민 해킹은 크게 주로 정부가 공개하는 공공데이터를 활용하는 열린 정부 부문과 시민들이 직접 정보를 교류하는 공동체 활동 부문으로 나눌 수 있다. 시민 해킹을 통해 도시를 더 살기 좋은 곳으로 만들고 정부가 하는 일을 도울 수 있다. 시민 해킹 운동은 2009년 미국의 시민 단체인 코드 포 아메리카(Code for America)에서 시작되어 멕시코, 일본 등 세계적으로 확산되었다. 우리나라에서 활동하는 단체로 코드나무(codenamu.org), 코드포서울(codeforseoul.org) 등이 있다. 시민 해킹의 대표적인 사례로 2011년 미국 동부 폭설이 내렸을 때 구글 지도 위에 소화전 위치를 표시하여 시민이 소화기를 가져갈 수 있도록 만든 ‘소화전 입양하기’라는 서비스를 들 수 있다. "
동적 시분할 송수신,dynamic Time Division Duplexing,"dynamic TDD, D-TDD",,"시분할 송수신(TDD: Time Division Duplexing) 방식으로 운영되는 기지국에서 하향 링크(downlink)와 상향 링크(uplink)의 시간 비율을 트래픽 상황에 맞춰 할당하는 방식.  하향 링크 및 상향 링크의 순시적(instantaneous) 트래픽 부하(traffic load)와 주변 셀들의 간섭 상황을 고려하여 타임 슬롯(time slot)을 동적으로 할당한다. 단말기 수가 적은 소형셀(small cell)에서 사용자의 이용 서비스 종류에 따라 하향 링크 대 상향 링크의 시간 비율이 동적으로 조정되어 전송 효율이 높아진다.  
※ 동적 시분할 송수신(dynamic TDD)은 LTE에서 eIMTA(enhanced Interference Mitigation and Trafic Adaptation) 기술로 표준화되어 있다(3GPP TS 36.321 Release 12)."
접속 상태 불연속 수신,Connected mode Discontinuous Reception,C-DRX,,"엘티이(LTE) 망에서 스마트폰, 노트북 등이 모바일 데이터를 사용하지 않는 동안 일정 시간 RF 송수신 기능을 중지(OFF)시켜 단말의 배터리 소모를 줄이는 망 기술.  
C-DRX 기능이 없는 경우에는 스마트폰이 LTE망에 연결된 상태에서 데이터를 사용하지 않아도 RF 송수신은 계속 동작되기 때문에 배터리 소모가 많아진다. 
반면 C-DRX 기능이 제공되면, 스마트폰이 데이터를 사용하지 않을 때는 주기적으로 스마트폰과 기지국 간의 RF 송수신을 일정 시간 차단시켜 배터리 사용을 절감할 수 있다. 
C-DRX 기능은 LTE 기지국과 단말상의 무선 자원 제어(RRC: Radio Resource Control) 프로토콜을 통해 수행된다.  
C-DRX 기능은 3GPP 국제 표준(3GPP Release 8)에 정의되어 있다."
무선 프로그래밍 갱신,Over-The-Air programming,OTA,무선 프로그래밍 업데이트,"무선통신망에서 필요한 데이터를 무선 채널을 통해 해당 기기로 전송하여, 기기의 환경 설정, 소프트웨어 등을 갱신하는 방법. 
OTA는 원격의 한 송신기에서 해당되는 기기 전부에 데이터를 전송하면, 각 기기에서 수신된 데이터를 사용하여 필요한 과정을 수행한다. 
휴대폰, 셋톱박스, 와이파이(Wi-Fi) 기기, 기지국, 자동차 등 사용자 기기를 개별적으로 관리하지 않아도 된다. 거의 실시간으로 새로운 버전의 소프트웨어, 펌웨어 등을 갱신시켜 최신 상태로 유지할 수 있다. 
"
엔알,New Radio,NR,,"3GPP에서 만든 용어로 5세대(5G) 이동통신을 구현하기 위한 새로운 무선 접속 기술.  
5G NR 용어는 2016년 12월 비엔나에서 개최된 3GPP 제74차 기술총회(TSG: Technical. Specification Group)에서 정의되었다. LTE 무선 접속 기술은 E-UTRA(evolved UMTS Terrestrial Radio Access)라 한다(아래 표 참고).  
 4G(LTE-Advanced)보다 향상된 5G 서비스를 제공하기 위한 주요 요건(usage scenario)으로 높은 전송 속도와 대용량을 지원하는 초광대역 이동 통신(eMBB: enhaced Mobile Broadband), 종단 간 데이터 전송에 대한 높은 신뢰도와 짧은 전달 시간을 보장하는 URLLC(Ultra Reliable and Low Latency Communications), 대규모의 사물 통신을 지원하는 mMTC(massive Machine Type Communications) 등이 제시된다.  
 5G가 실현되면 달리는 고속 열차 안에서 많은 사람들이 동시에 360도 동영상, 스포츠 생중계 등 대용량의 콘텐츠를 끊김 없이 초고화질의 스트리밍 서비스를 받을 수 있다. 
국제 전기 통신 연합의 전파 통신국(ITU-R)에서는 IMT-2020을 5G 이동통신의 공식 명칭으로 사용하며, 3G는 IMT-2000, 4G는 IMT-Advanced 이다. ITU-R은 IMT-2020 실현을 위해 외부 표준화 기구에서 후보 기술을 제안받아 표준화하는데, 3GPP에서는 5G NR의 요구사항, 구현 방법 등을 2020년까지 표준화를 완료하여 LTE 기술과 함께 제출할 예정이다."
촉각 인터넷,Tactile Internet,,,"사람의 촉각(촉감)이 느낄 만큼 정보를 매우 빠른 속도로 전송하는 인터넷 서비스. 
사람의 오감 중 근육이 자극에 반응하는 시간은 약 1초, 귀가 느끼는 시간은 100ms, 눈이 반응하는 시간은 10ms, 그리고 촉각이 반응하는 시간은 1ms 정도이다. 
ITU에서는 촉각 인터넷을 1ms의  초저지연 (ultra-low latency)과 함께 인터넷의 이용 가용성, 신뢰성 그리고 보안 수준이 높은 서비스를 제공하는 인터넷으로 정의하였다(※  ITU-T Technology Watch Report (August 2014) - The Tactile Internet ).  
한편 IMT-2020(5G) 이동통신은 종단 간 1ms의 초저지연 시간에 정보 전달을 목표로 표준을 개발하고 있어 조만간 촉각 인터넷 서비스 시대가 도래할 것으로 예상된다. "
최고 전송 속도,Peak Data Rate,PDR,,"이동 통신 단말기가 데이터를 전송할 수 있는 최고 속도.  3G(WCDMA) 망에서 최고 전송 속도는 14.4Mbps, 4G(LTE-Advanced) 망에서는 최대 1Gbps이다. 
ITU-R의  IMT-2020 (5G) 성능 요구 사항 중 하나로 포함되었고, 최고 전송 속도(Peak Data Rate)는 하향 20Gbps, 상향 10 Gbps 수준으로 제시된다."
사용자 체감 전송 속도,user experienced data rate,,,"이동 통신망에서 사용자가 언제 어디서든 서비스 받을 수 있는 최소한의 데이터 전송 속도.  
ITU-R의 IMT-2020(5G) 성능 요구 사항 중 하나이며, 개별 사용자가  체감하는  전송 속도(user experienced data rate)이다."
대규모 사물 통신,massive Machine Type Communications,mMTC,,"IMT-2020(5G) 이동통신에서 다수의 기기가 서로 연결되어 정보를 주고받는 사물 통신을 일컫는 명칭.  IMT-2020(5G) 이동통신의 주요 서비스 요건(usage scenario) 중 하나이며,  비교적 저용량의 데이터를 저속으로 주고받는 사물 통신 기기를 대상으로 한다.  
mMTC 서비스를 위해 ITU-R은 사물 통신 기기의 수(connection density)를 단위 면적(1km<sup>2</sup>) 당 최대 100만개(10<sup>6</sup>) 가량 대규모로 늘리는 것 외에, 기기 비용 절감(예: 10달러 미만), 배터리 수명 대폭 연장(10년), 서비스 범위(coverage) 확장 등을 정의하고 있다.
대규모 사물 통신(mMTC)는 에너지 검침, 헬스/의료, 자동차, 공장 등 사회 전반에 활용될 수 있다.  
※ MTC는 3GPP에서 정한 용어로 M2M(Machine To Machine), 사물 인터넷(IoT: Internet of Things)과 동일한 의미이다. "
초광대역 이동 통신,enhanced Mobile BroadBand,eMBB,,"IMT-2020(5G) 이동통신에서 멀티미디어 콘텐츠 같은 고화질의 데이터 이용 시 사용자가 느끼는 초광대역 서비스.  
eMBB는 ITU-R에서 정한 IMT-2020 이동통신의 주요 서비스 요건(usage scenario) 중 하나이다.  
기존 광대역 이동 통신(mobile broadband)에 비해 데이터 최고 전송 속도(peak data rate)와 사용자가 체감하는 데이터 전송 속도(user experienced data rate)가 크게 개선된다. 
ITU-R에서는 데이터 다운로드 최고 전송 속도(peak data rate)로 10Gbps ~ 20Gbps, 사용자 체감 전송 속도(user experienced data rate)는 10Mbps ~ 100Mbps로 제시하고 있다(※ 참고 Rec. ITU-R M.2083-0). 또한, eMBB는 광역 커버리지(wide-area coverage)와 핫스폿(hotspot)과 같이 요구사항이 서로 다른 서비스도 대상으로 한다. 핫스폿의 경우, 사용자 밀도가 높고 대용량의 트래픽이 필요하지만, 이동성은 낮고 사용자 체감 전송 속도는 광역 커버리지에 비해 높게 필요하다. 광역 커버리지의 경우에는 이동성이 있어 끊김 없는 서비스가 필요하고 반면, 데이터 최고 전송 속도는 핫스팟에 비해 낮게 필요하다. "
초고신뢰 저지연 통신,Ultra-Reliable and Low Latency Communications,URLLC,,"IMT-2020(5G) 이동통신에서 신뢰도가 매우 높고 지연 시간이 매우 짧은 통신 서비스를 일컫는 명칭.  ITU-R에서 정한 IMT-2020(5G) 이동통신의 주요 서비스 요건으로 종단 간 전달 시간(latency)이 1ms, 데이터 전송 패킷 오류율이 10<sup>-5</sup> 이하로 정의되고 있다.  
URLLC 서비스는 산업 제조와 생산 공정의 무선 제어, 원격 의료 수술, 스마트 그리드의 자동 분산 제어, 안전한 교통 시스템 제어 등 신속하고 정확하게 처리되어야 하는 분야에 유용하다."
지시에스이,Group Communication System Enablers,GCSE,,"엘티이(LTE) 기반의 동시 멀티미디어 전송 기술(eMBMS: enhanced Multimedia Broadcast Multicast Service) 등을 이용하여 특정 지역 내 다수의 사람들에게 그룹 통신을 제공하는 기술.  하나의 공용 방송 채널을 통해 대규모 그룹 통신이 가능하여, 대형 재난 지역에 밀집된 수백 명의 구조 요원들이 재난 현장 상황을 실시간으로 공유할 수 있다. GCSE 기술은 2015년 3GPP 릴리즈 12에 처음으로 포함되어 표준화되었다."
미션 크리티컬 푸시투토크,Mission Critical Push To Talk,MCPTT,,"공공 안전을 위한 엘티이(LTE) 이동통신망 기반의 푸시투토크(PTT) 서비스.  MCPTT는 공공 안전을 위해 특화된 기능을 제공한다. 주요 기능으로 단말기 간 개별, 그룹 및 비상통화, 원격에 있는 특정 사용자 단말의 주변 소리를 임의로 청취, 긴급 상황 시 운영센터에서 강제적으로 통화를 재발신하는 기능 등이 있다. 2016년 3GPP 릴리즈 13에 처음으로 포함되어 표준화되었다.  "
전자식 매대 표시기,Electronic Shelf Label,ESL,,"매장 상품 진열대에서 무선 통신망을 통하여 각 상품별로 가격, 원산지 등 정보를 실시간으로 표시하는 전자 종이(e-paper) 단말.  전자식 매대 표시기(ESL) 시스템은 유무선 통신하는 게이트웨이(gateway)와 상품 정보를 표시하는 태그(tag) 기기로 구성된다. ESL 중앙 관리 서버에서 상품 정보를 게이트웨이로 전송하면, 게이트웨이가 무선 통신으로 수천수만 개의 ESL 태그로 전달한다. 태그에는 문자, 바코드, 사진 등이 표시된다. ESL을 이용하여 상품별 재고 현황, 가격 변경, 할인 기간 등을 자동으로 전 매장에 동시에 반영할 수 있어 매장 관리의 효율성을 높일 수 있다. "
네트워크 슬라이싱,network slicing,,,"하나의 물리적인 코어 네트워크 인프라(infrastructure)를 서비스 형태에 따라 다수의 독립적인 가상 네트워크로 분리하여 각각의 슬라이스를 통해 다양한 맞춤형 서비스를 제공하는 네트워크 기술.  네트워크 슬라이싱은 5G 네트워크의 새로운 기술이다.  
5G 망에서는 1인칭 미디어를 포함해 초고선명(UHD)의 동영상, 증강 현실(AR)·가상 현실(VR) 콘텐츠, 홀로그램, 자율주행 자동차, 로봇·드론 원격 조정 등 다양한 서비스가 제공된다. 
이처럼 대용량의 다양한 5G 서비스를 초고속으로 한 개의 코어 네트워크 인프라로 제공하는 대신, 각각 가상의 네트워크 슬라이스를 통해 사용자에게 주문형(on-demand), 즉 실시간 맞춤형의 서비스를 제공한다.  
네트워크 슬라이싱 기술은 가상화된 네트워크 환경에서만 구현될 수 있어 소프트웨어 정의 네트워킹(SDN: Software-Defined Networking)과 네트워크 기능 가상화(NFV: Network Functions Virtualization) 구현이 선행되어야 한다."
아이엠티-2020,International Mobile Telecommunications-2020,IMT-2020,5세대 이동통신,"국제 전기 통신 연합(ITU)에서 채택한 5세대 이동 통신의 공식 명칭. 2015년 ITU 전파 부문(ITU-R) 이동 통신 작업반(WP5D)에서 제안하여 전파통신총회(RA-15)에서 채택된 5G의 공식 명칭이다.  일반적으로 이동통신 시장에서 마케팅 용어로 3세대(3G), 4세대(4G), 5세대(5G)란 용어를 사용하지만, ITU에서는 3G, 4G, 5G 등 세대 구분 용어를 사용하지 않으며 IMT-2000, IMT-Advanced, IMT-2020의 용어를 사용한다.  
ITU-R은 IMT-2020의 최소 기술 성능 요구 사항으로 최대 20 Gbps의  최고 전송 속도 (PDR),  최대 500 km/h 이동 속도,  IMT-Advanced 대비 3배의 주파수 효율(spectrum efficiency), 종단간 1ms 이내의 전달 시간(latency), 1 km<sup>2</sup> 내 100만개의 사물인터넷(IoT) 기기 연결(connection density), 기지국 간 경계점 등 음영 지역에 관계없이 기지국 내 어디에서도 데이터를 주고 받을 수 있는 속도, 즉  사용자 체감 전송 속도 (user experienced data rate)로 100 Mbps 이상 등을 제시하고 있다(※ 참고 Rec. ITU-R M.2083-0).
 "
모바일 클라우드 컴퓨팅,Mobile Cloud Computing,MCC,모바일 클라우드,"클라우드 서비스 소비자와 파트너의 모바일 기기에 클라우드 서비스를 제공하고, 모바일 기기들로 클라우드 컴퓨팅 인프라를 구성하여 기기 간 정보와 자원을 공유하는 클라우드 컴퓨팅.
모바일 기기의 기종이나 운영 체제(OS)에 상관없이 기기 간 정보를 공유하고, 모바일 앱, 스토리지 등의 클라우드 ICT 자원을 제약 없이 이용할 수 있다. 클라우드 컴퓨팅의 경제성과 모바일의 이동성이 결합되어 비즈니스 시너지를 높일 수 있다."
인터넷 전문 은행,"internet-only bank, online-only bank, direct bank",,인터넷 전용 은행,"영업점을 소수로 운영하거나 영업점 없이 업무의 대부분을 현금 자동 입출금기(ATM), 인터넷 등 전자매체를 통해 운영하는 은행(※출처: 금융위원회)  인터넷 전문 은행은 온라인상에서 비대면 본인 인증 방식으로 기존 은행이 하는 금융 계좌 개설, 자금 대출, 신용카드 발급, 해외 송금 등 거의 모든 금융 업무가 수행된다.  인터넷 전문 은행은 은행을 직접 방문하지 않고서도 스마트 기기 등으로 온라인상에서 간편하게 계좌를 개설하고 송금할 수 있는 것이 큰 장점이다. 안전한 금융 거래를 위해 높은 수준의 보안이 필요하다.  
인터넷 전문 은행은 1995년 미국에서 처음 생겼으며(Security First Network Bank), 인터넷과 스마트 기기 사용이 증가되면서 세계 전역으로 확산되었다. 
우리나라는 2017년 케이뱅크(Kbank), 카카오뱅크(Kakao Bank)가 인터넷 전문 은행 영업을 시작하였다. "
가상 화폐,virtual currency,,virtual money,"온라인 네트워크상에서 발행되어 온라인과 오프라인에서 사용할 수 있는 디지털 화폐. 또는  
컴퓨터 등에 정보 형태로 남아 실물 없이 사이버상으로만 거래되는 전자 화폐의 일종.  
2012년 유럽 중앙은행(European Central Bank)은 가상 화폐를 ‘가상화폐 발행자가 발행·관리하고, 특정 가상 커뮤니티의 구성원들 사이에서 이용되며 대부분 법적 규제를 받지 않는 디지털 화폐’라고 정의하였다. 
가상 화폐는 중앙은행이나 금융기관 등 공인기관이 관여하지 않는다. 
인터넷 쿠폰, 모바일 쿠폰, 게임 머니 등과 암호 화폐인 비트코인이 가상 화폐에 해당된다.  "
무선 자기 통신 결제,payment based Wireless Magnetic Communication,WMC,무선 마그네틱 전송 결제,"모바일 기기를 마그네틱 카드 결제 단말기에 근접시키면 모바일 기기에서 자기장(마그네틱 신호)이 발생되어 지불 결제되는 방식.  
미국의 결제 솔루션 기업 다이내믹스(Dynamics Inc.)가 2007년 개발한 무선 자기 통신(WMC) 기술을 기반으로 한다. 모바일 기기에 자기 루프 안테나(magnetic loop antenna)가 탑재되어, 마그네틱 결제 단말기에 기기를 가까이 가져가면 일반 신용카드의 자기 띠(magnetic stripe)로 정보가 읽히는 것과 같이 기기에서 자기(마그네틱) 신호로 결제 정보가 전송된다.  
WMC 결제 방식은 LG 페이(LG Pay)에 적용되었다. 이와 유사한 마그네틱 통신 기반의 간편 결제 방식으로 삼성 페이(Samsung Pay)에 활용된 루프페이(LoopPay)사의 마그네틱 안전 전송(MST) 방식이 있다. 
"
소셜 로봇,Social Robot,,감성 로봇,"언어, 몸짓 등 사회적 행동으로 사람과 교감하고 상호 작용하는 자율 로봇. 산업용 로봇이나 서비스 로봇과 같이 사람을 위해 물리적인 일을 하는 대신 사람처럼 대화를 하고 감성적인 몸짓으로 사람과 정서적으로 소통한다. 인공지능(AI), 빅데이터, 사물인터넷(IoT), 클라우드 컴퓨팅(Cloud Computing) 등 기술이 융합되어 사람의 말을 이해하고 카메라를 통해 얼굴을 살펴보고 심리 상태를 분석하여 대화를 하고 감정 표현을 하는 등 적절한 대응을 한다.  
인간과 공생을 위해서는 윤리적 논의와 제도적 개선이 요구된다. 
상업용 소셜 로봇 예로, 개인 비서처럼 사람과 소통하는 지보(JIBO), 사람의 감정 상태를 파악하는 페퍼(Pepper) 등이 있다. "
로봇 3원칙,Three Laws of Robotics,,,"로봇은 인간에게 해를 끼치지 않아야 하고 인간의 명령에 복종해야 하면서 로봇 자신의 존재를 보호하는 로봇 안전 준칙. 
1942년 아이작 아시모프(Isaac Asimov)의 공상 과학 소설 '런어라운드(Runaround)'에서 처음 언급되었으며, 로봇이 따라야 할 세 가지 원칙은 다음과 같다.  
첫째, 로봇은 인간에게 해를 가하거나, 혹은 행동을 하지 않음으로써 인간에게 해를 끼치지 않는다. 
둘째, 로봇은 첫 번째 원칙에 위배되지 않는 한 인간이 내리는 명령에 복종해야 한다.  
셋째, 로봇은 첫 번째와 두 번째 원칙을 위배하지 않는 선에서 로봇 자신의 존재를 보호해야 한다.  
1985년에 아시모프는 위 3대 원칙에 인류 집단 안전을 위해 0 번째 법칙으로 ‘로봇은 인류에게 해를 가하거나, 해를 끼지는 행동을 하지 않음으로써 인류에게 해를 끼치지 않는다’를 추가하였다.  
※ 우리나라 ‘지능형 로봇 개발 및 보급 촉진법’에는 ‘지능형 로봇 윤리헌장’이 다음과 같이 정의되어 있다. ‘지능형 로봇의 기능과 지능이 발전함에 따라 발생할 수 있는 사회질서의 파괴 등 각종 폐해를 방지하여 지능형 로봇이 인간의 삶의 질 향상에 이바지할 수 있도록 지능형 로봇의 개발 · 제조 및 사용에 관계하는 자에 대한 행동지침을 정한 것을 말한다.’"
가상 발전소,Virtual Power Plant,VPP,,"가정용 태양광과 같이 분산되어 있는 소규모 에너지 발전, 축전지, 연료전지 등 발전 설비와 전력 수요를 클라우드 기반으로 소프트웨어적으로 통합 관리하는 가상의 발전소.  클라우드 컴퓨팅, 사물 인터넷(IoT) 등 정보통신기술(ICT)을 활용하여 소비자의 수요 자원 관리(Demand Response), 신재생 에너지원(Renewable Energy Source), 에너지 저장 장치(ESS: Energy Storage System) 등 다양한 유형의 분산형 에너지원(DES: Distributed Energy Source)을 한 곳으로 수집하여 관리한다. 즉, 태양광 설비가 설치된 가정이 에너지를 생산하는 하나의 발전소가 되어, 수천수만의 가정에서 수집된 전력이 VPP에서 통합 관리되며, 재공급된다.  VPP는 분산 에너지를 수집하고 분석하는 과정에서 전력 수급과 공급의 변수를 사전에 예측함으로써 에너지를 효율적으로 공급할 수 있다. 에너지 인터넷(Internet of Energy)이라고도 한다(※ 파이크 리서치(Pike Research) 수석 애널리스트 피터 아스무스(Peter Asmus))."
산업 인터넷,industrial internet,,,"제조 공장, 의료, 철도, 전력 등 산업 현장 전반에 사용되는 인터넷.   사이버 물리 시스템(CPS: Cyber Physical Systems), 사물 인터넷(IoT: Internet of Things), 빅데이터 솔루션 등 정보통신기술(ICT)을 적용함으로써 정확하고 빠른 의사 결정에 필요한 정보를 제공하고 시스템 운영 관리 최적화, 그리고 고객에게 가치 있는 정보를 제공하여 산업의 혁신 역량을 강화할 수 있다. 산업 인터넷(industrial internet) 용어는 제너럴 일렉트릭(GE)에서 만들었다."
스마트 도시,smart city,,스마트 시티,"사물 인터넷(IoT: Internet of Things), 사이버 물리 시스템(CPS: Cyber Physical Systems), 빅데이터 솔루션 등 최신 정보통신기술(ICT)을 적용한 스마트 플랫폼을 구축하여 도시의 자산을 효율적으로 운영하고 시민에게 안전하고 윤택한 삶을 제공하는 도시.  
도로, 항만, 수도, 전기, 학교 등 도시의 인프라를 효율적으로 관리하고 공공 데이터를 수집·활용하여 교통, 에너지 등 다양한 도시 문제를 해결하고 새로운 가치를 창출하는 데 목적이 있다. 스마트 시티는 기존 유-시티(u-city)와 유사하지만, 사물 인터넷(IoT)과 인공 지능(AI) 기술이 결합된 차세대 개념이다."
스마트 공장,Smart Factory,,"지능형 공장, 스마트 팩토리","설계·개발, 제조, 유통·물류 등 생산 전체 과정에 정보 통신 기술(ICT)를 적용하여 생산성, 품질, 고객만족도 등을 향상시킬 수 있는 지능형 공장.  사이버 물리 시스템(CPS: Cyber Physical Systems)를 이용하여 실제와 똑같이 제품 설계 및 개발을 모의 실험하여 자산을 최적화하고, 공장 내 설비와 기기 간에 사물 인터넷(IoT)을 설치하여 실시간 정보를 교환하게 하여 생산성을 증가시키고 돌발 사고를 최소화한다. 그리고 제품 위치, 재고량 등을 자동 감지하여 인적·물적 자원 절감 등 공장의 효율성을 향상시킨다."
제4차 산업혁명,The Fourth Industrial Revolution,,,"인공 지능, 사물 인터넷, 빅데이터, 모바일 등 첨단 정보통신기술이 경제·사회 전반에 융합되어 혁신적인 변화가 나타나는 차세대 산업혁명.  인공 지능(AI), 사물 인터넷(IoT), 클라우드 컴퓨팅, 빅데이터, 모바일 등  지능정보기술 이 기존 산업과 서비스에 융합되거나 3D 프린팅, 로봇공학, 생명공학, 나노기술 등 여러 분야의 신기술과 결합되어 실세계 모든 제품·서비스를 네트워크로 연결하고 사물을 지능화한다.  
제4차 산업혁명은 초연결(hyperconnectivity)과 초지능(superintelligence)을 특징으로 하기 때문에 기존 산업혁명에 비해 더 넓은 범위(scope)에 더 빠른 속도(velocity)로 크게 영향(impact)을 끼친다.  
‘제4차 산업혁명’ 용어는 2016년 세계 경제 포럼(WEF: World Economic Forum)에서 언급되었으며, ICT 기반의 새로운 산업 시대를 대표하는 용어가 되었다. 컴퓨터, 인터넷으로 대표되는 제3차 산업혁명(정보 혁명)에서 한 단계 더 진화한 혁명으로도 일컬어진다. "
개인 건강 기기,Personal Health Device,PHD,,"개인의 다양한 생체와 건강 상태를 측정하여 수집한 정보를 다른 건강 의료 기기와 상호 교환하는 건강 기기.  개인 건강 기기(PHD)는 혈압, 혈당, 심장 박동 수, 수면 등을 측정하는 저가의 소형 기기이다. 신체를 직접 측정하여 수집된 정보를 통신망을 통해 다른 PHD 또는 병원 의료 기기 등에 전달하여 개인 건강 기록(PHR: Personal Health Record) 또는 의료 기관의 전자 건강 기록(EHR: Electronic Health Record) 등에 활용되도록 한다. PHD에 대한 국제 표준으로는 ISO/IEEE 11073 표준이 제정되어 배포되고 있으며, 개인 건강 기기(PHD) 정보의 교환, 의료 정보의 교환, 사물 인터넷(IoT) 기기 정보의 교환 등의 내용을 포함한다."
차량 긴급구난체계 서비스,emergency road call service,e-call service,이콜(e-call) 서비스,"차량 사고 시 신속한 구난을 위한 서비스.  차량 긴급구난체계 서비스는 차량 운행 중 차량 충돌 및 심각한 사고 발생 시 자동으로 긴급 구조 기관에 사고 위치와 사고 정보 등을 전송하고 긴급 구난을 요청하거나, 차량 운행 중 위급 상황이 발생할 경우 탑승자가 수동으로 긴급구난을 요청하여 운전자와 동승자를 빠르게 구난할 수 있는 서비스를 의미한다. 차량 긴급구난체계 서비스를 위해 차량에는 사고 발생 시 사고 판단을 하고 정보를 수집하는 센서, GPS 위치와 사고 시간 수집, 구조 기관에 자동으로 이동 전화 연결 등의 기능이 지원되어야 한다. 그리고 구조 기관은 관제 센터간과 의료 기관, 경찰서 등 2차 이용 기관과의 네트워크 운용 기술이 구축되어 있어야 한다. 유럽과 러시아에서는 정부 주도로 각각 eCall 서비스, ERA-글로나스(Emergency Road Assistance GLONASS) 서비스를 시행하고 있다."
역순 학습,flipped learning,,"플립트 러닝, 거꾸로 학습","혼합형 학습(blended learning)의 한 형태로 학생이 수업 전에 온라인 영상을 통해 먼저 학습하고, 수업 시간에는 학습한 내용을 논의와 평가 등을 통해 확인·보완하는 학습 방식.  기존의 학생이 교실 수업에서 배우고 수업 후에 복습하는 방식과 반대되는 방식이다. 따라서 역순 학습(flipped learning)은 기존과 같이 교수자가 교실에서 강의하는 것이 아니기 때문에, 수업 전에 학생들이 해야 할 일과 교수자가 수업 시간에 할 일을 구별하고 그에 맞게 학습 계획을 세워야 한다."
적응형 학습,Adaptive Learning,,맞춤형 학습,"학습자의 수준과 학습 스타일에 맞게 학습 정보나 방법 등을 제공하는 전자 학습(이러닝).  예를 들어, 교사는 수업 시간에 학생 개개인 단말에서 학습 활동 데이터를 수집하여 학습 이해도를 조사하고, 학습에 흥미를 잃지 않도록 게임, 동영상, 음악 등을 적절히 사용하여 피드백을 보냄으로써 학습 성과를 올릴 수 있게 한다. 즉, 학생이 수업 내용을 얼마나 이해하는지, 무엇을 잘하는지 등을 파악하여 맞춤형 교육을 하는 것이다. 적응형 학습에는 클라우드 서비스, 빅데이터, 인공지능, 가상 현실 등의 ICT 기술이 활용된다."
먹거리테크,food technology,foodtech,푸드테크,"최신 정보기술(IT)을 활용한 음식 관련 서비스를 칭하는 신조어.  빅 데이터, 블루투스 비콘(beacon), 온오프라인 연결 비즈니스(O2O) 등과 같은 최신 IT를 활용하여 사용자에게 맛집 추천, 식당 예약, 음식 주문 등의 서비스를 편리하게 제공한다."
스마트 그리드,smart grid,,지능형 전력망,"정보통신기술(ICT)을 접목하여 전력망의 에너지 효율은 물론, 신뢰성(reliability), 안전성(security), 그리고 복원력(resiliency)이 향상된 지능형 전력망.  
중앙에서 일방적으로 전력을 공급하던 기존의 전력망과는 달리 에너지의 흐름을 모니터링(monitoring)하여 전력의 수요에 따라 공급을 조절하고, 규모에 따라 에너지원을 독립적으로 분산시킨다. 그리고 소비자와의 전력 수요 및 분배 정보를 주고받으면서 효율적으로 운영한다.  전력 전달의 에너지 이용 효율을 높이는 것은 물론 정전, 시스템 고장 등과 같은 사고를 실시간에 알 수 있기 때문에 빠르게 복원할 수 있고, 안전사고 예방에도 효과적이다. 스마트 미터링(smart metering) 시스템을 설치한 가정에서는 실시간으로 전력 사용량을 알 수 있다. 특히 전력 발전소가 분산된 경우에는 각 발전소 간의 전력 생산 및 분배를 효율적으로 관리할 수 있어 안전성과 신뢰성을 확보할 수 있다."
에너지 저장 시스템,Energy Storage System,ESS,에너지 비축 시스템,"에너지를 효율적으로 사용할 수 있도록 저장·관리하는 시스템.  ESS는 발전소, 송배전시설, 가정, 공장, 기업 등에서 활용된다.  
예로 가정에 주로 지붕에 설치되는 태양광 모듈, 데이터센터의 무정전 전원 장치(UPS)용 ESS는 쓰고 남은 전력을 저장해 두었다가 수요가 많은 시간대나 전기료가 비싼 시간대에 저장된 전력을 사용함으로써, 정전 피해를 최소화하고 전력요금을 절약할 수 있다. 또, 발전소에서는 태양광, 풍력, 수력 등과 같이 불규칙적으로 생산되는 신재생 에너지를 저장·관리하여 신재생 에너지의 이용 효율을 높인다.  ESS는 에너지를 저장 방법에 따라 리튬전지(LiB), 레독스 플로 전지(redox flow battery), 나트륨 유황 전지(NaS), 슈퍼 커패시터 등 이차전지를 이용하는 배터리 방식과 압축 공기 저장(CAES: Compressed Air Energy Storage), 플라이휠(flywheel) 등을 이용하는 비배터리 방식으로 구분된다. "
국제 해저 케이블 통합 관제 센터,Submarine Network Operation Center,SNOC,,"아시아와 태평양 지역의 해저 통신망을 통합 관제하는 곳.  KT에서 운용하며 2016년 6월 부산 송정에 개소되었다. 국제 해저 케이블 통합 관제 센터(SNOC)는 초고선명(UHD) 방송 데이터 로밍과 5G 망 계통의 대량의 데이터를 제어하는 핵심 역할을 한다. KT에서 기존 운용하는 국제 해저 케이블과 아시아와 태평양 지역을 연결하는 아시아 태평양 게이트웨이(APG: Asia Pacific Gateway) 해저 케이블과 태평양 횡단에 새로 구축되는 14,000 km의 태평양 횡단 새 해저 케이블(NCP: New Cross Pacific cable system)의 운용부터 위기 대응까지 컨트롤타워 역할을 한다. 아시아 태평양 게이트웨이(APG)의 초당 38.4 테라비트(Tbps)의 전송 용량과 태평양 횡단 새 해저 케이블(NCP)의 초당 80 테라비트(Tbps)의 전송 용량을 합한 초당 118.4 테라비트(Tbps)의 전송 용량을 관리 "
태평양 횡단 새 해저 케이블,New Cross Pacific cable system,NCP cable system,,"한국, 일본, 중국, 대만, 미국을 직접 연결하기 위해 태평양에 새로 포설되는 대용량의 해저 광케이블.  최신 광케이블 기술을 사용해 초당 80 테라비트(Tbps)의 전송 용량을 제공하며 총길이 1만4천여 킬로미터(km)이다. NCP 케이블 건설을 추진하는 NCP 컨소시엄은 각국의 통신사업자(한국 KT, 중국 차이나모바일, 차이나유니콤, 일본 소프트뱅크, 대만 청화텔레콤, 미국 마이크로소프트)가 참여하며 KT가 총괄 운영을 맡는다."
아시아 태평양 게이트웨이,Asia Pacific Gateway,APG,아시아 태평양 광케이블 관문,"한국, 일본, 중국, 홍콩, 대만, 베트남, 말레이시아, 싱가포르 등 아시아 태평양 지역을 연결하는 해저 광케이블.  아시아 태평양 게이트웨이(APG) 해저 광케이블은 총길이 1만4백 킬로미터(km)이며, 전송 용량이 초당 38.4 테라비트(Tbps)이다. 2009년 APG 컨소시엄이 발족되었으며, 8개국의 12개 통신사업자들(차이나 모바일, 페이스북, NTT 등)이 참여한다. 우리나라는 KT가 참여하고 APG 총괄 운영을 한다."
해저 통신 케이블,submarine communications cable,,,"육지와 도서 또는 국가 간 데이터 통신을 위해 해저에 설치하는 케이블.  해저 통신 케이블의 재질은 초기에는 구리 케이블이 사용되었으나 회선 용량 증대를 위해 동축 케이블과 광케이블이 사용되었고, 국제 통신량의 급증으로 광케이블이 주로 사용된다."
지상 기반 보정 시스템,Ground-Based Augmentation System,GBAS,위성 항법 지역 보정 시스템,"공항 인근과 같은 협역에서 세계 위성 항법 체계(GNSS)의 위치 오차를 보정한 정보를 지상국에서 직접 사용자에게 전송하는 위치 보정 시스템.  GNSS 위성은 지상으로부터 아주 높은 고도에 위치하여 지역에 따라 시간차가 발생하고, 위성 신호가 전리층을 통과할 때 신호가 지연되어 오차가 발생된다. 그래서 이를 수신한 지상국은 시차와 신호 지연차를 정밀하게 보정하여 VHF로 사용자에게 바로 전송한다. GBAS는 위성을 통하지 않기 때문에 협역 보정 시스템이며, 주로 공항에 접근, 착륙 이륙하는 항공기에 제공하여 정밀하고 안전한 공항 운용이 가능하게 한다. 지상국은 GPS 기준국 수신기와 안테나, 정보 처리 장치, VHF 데이터 방송 안테나로 구성된다. "
위성 기반 보정 시스템,Satellite-Based Augmentation System,SBAS,위성 항법 광역 보정 시스템(WADGPS:  Wide-Area DGPS),"GNSS의 위치 오차를 보정한 정보를 위성을 통해 사용자에게 전달하는 광역(wide-area)의 위성 항법 보정 시스템.  GNSS 위성은 지상으로부터 아주 높은 고도에 위치하여 지역에 따라 시간차가 발생하고, 위성 신호가 전리층을 통과할 때 신호가 지연되어 오차가 발생된다. 그래서 이를 수신한 지상국은 GNSS 지역에 따라 달라지는 시차와 신호 지연차의 오차를 정밀하게 보정하여 다시 위성에 보내고, 위성은 최종 사용자(end user)에게 보정된 정보를 전송한다. 따라서 SBAS는 정밀도(accuracy), 신뢰성(reliability), 가용성(availability), 무결성(integrity) 측면에서 정밀하다. 그리고 위성을 사용하기 때문에 광역 서비스를 할 수 있다. 국제민간항공기구(ICAO: International CivilAviation Organization)는 SBAS와 GBAS를 위성 보정 시스템의 국제 표준으로 지정하였으며, SBAS의 인증 권한은 해당 국가에 위임하였다. 우리나라는 2014년 10월 항공안전기술개발 사업의 일환으로 SBAS 구축 사업을 시작하였다."
작업 증명,Proof-Of-Work,POW,,"① 피투피(P2P: Peer-to-Peer) 네트워크에서 일정 시간 또는 비용을 들여 수행된 컴퓨터 연산 작업을 신뢰하기 위해 참여 당사자 간에 간단히 검증하는 방식.  네트워크에서는 참여자들이 대부분 서로 알지 못하기 때문에 POW 과정을 통해 작업 수행 과정이나 결과에 신뢰감을 느끼게 된다. 대표적인 응용 예로 이메일 스팸, 서비스 거부 공격(DoS) 등 네트워크 공격을 막기 위해 처리한 작업을 증명할 때 사용된다.  
② 블록체인(blockchain)에서 정보를 랜덤한 논스(nonce)값과 해시(hash) 알고리즘을 적용시켜 설정된 크기의 해시보다 작은 값을 도출하는 과정으로, 새로운 블록을 블록체인에 추가하는 작업을 완료했음을 증명하는 것.  P2P 네트워크로 거래하는 비트코인(Bitcoin) 채굴에서 사용하는 작업 증명(POW) 방식은 SHA-256을 기반으로 하여 해시캐시(Hashcash) 라고 한다. "
미션 크리티컬,Mission Critical,MC,,"업무 수행을 위하여 가장 중요한(필수 불가결한) 요소 .  미션 크리티컬 요소가 정상적으로 작동되지 않거나 파괴되면 업무수행 전체에 치명적인 영향을 미쳐, 조직이나 사회에 재앙을 가져올 수 있다. 예를 들어 온라인(online) 비즈니스 회사의 통신 시스템이나 재난 통신망, 항공기 운항의 관제 시스템, 그리고 IT 정보 제공 회사의 데이터베이스 시스템 등이 이에 해당된다. 미션 크리티컬 시스템은 완벽한 동작을 위하여 보안시스템도 철저하게 갖추어야 한다."
소프트웨어 정의 데이터 센터,Software-Defined Data Center,SDDC,,"데이터 센터의 모든 자원이 가상화되어 서비스되고, 사람의 개입 없이 소프트웨어 조작만으로 자동 제어 관리되는 데이터 센터.  SDDC는 데이터 센터를 효율적으로 운영하고 편리하게 관리하기 위해 대두되었다. 따라서 특정 하드웨어와 상관없이 독립적이고, 실제 물리적 환경과 동일하게 구성된다. 컴퓨팅, 네트워킹, 스토리지, 관리 등을 모두 소프트웨어로 정의하여 데이터 센터를 구성·관리한다. 즉, 소프트웨어 정의 컴퓨팅(SDC: Software-Defined Computing), 소프트웨어 정의 네트워킹(SDN: Software-Defined Networking), 소프트웨어 정의 스토리지(SDS: Software-Defined Storage), 소프트웨어 정의 시설 관리(SDF: Software Defined Facilities) 기술이 활용된다."
디지털 트윈,digital twin,,,"물리적인 사물과 컴퓨터에 동일하게 표현되는 가상 모델.  제너럴 일렉트릭(GE: General Electric)에서 만든 개념이다. 실제 물리적인 자산 대신 소프트웨어로 가상화한 자산의 디지털 트윈을 만들어 모의실험(시뮬레이션)함으로써 실제 자산의 특성(현재 상태, 생산성, 동작 시나리오, 등)에 대한 정확한 정보를 얻을 수 있다. 에너지, 항공, 헬스케어, 자동차, 국방 등 여러 산업 분야에서 디지털 트윈을 이용하여 자산 최적화, 돌발 사고 최소화, 생산성 증가 등 설계부터 제조, 서비스에 이르는 모든 과정의 효율성을 향상시킬 수 있다. "
소프트웨어 정의 기술,Software-Defined Everything,"SDE, SDx",,"다양한 소프트웨어 정의(Software-Defined) 관련 기술을 하나로 통칭하여 부르는 용어. 
소프트웨어 정의 기술(SDE)은 소프트웨어 정의 네트워킹(SDN: Software-Defined Networking)에서 시작되어 소프트웨어 정의 스토리지(SDS: Software-Defined Storage), 소프트웨어 정의 컴퓨팅(SDC: Software-Defined Computing), 소프트웨어 정의 데이터 센터(SDDC: Software-Defined Data Center) 등을 포함한다. 컴퓨터, 통신망, 데이터 센터 등이 소프트웨어 정의 기술을 통하여 가상화됨에 따라 지능화된 소프트웨어로 제어가 가능하고, 또한 서비스로서 제공된다. 소프트웨어 정의 기술을 사용하여 통신 설비, 네트워크 운용 등에 소요되는 비용을 절감하고, 프로그래밍을 할 수 있는 유연성(agility)과 상호 운용성(interoperability) 등 효율적인 운영 관리를 할 수 있다. 반면 높은 수준의 보안이 필요하다.
"
이중 정보기술,Bimodal IT,,바이모달 IT,"기업에서 제품 및 서비스 수요의 급격한 변화에 효율적으로 대응하기 위해 서로 다른 두 가지 정보기술(IT) 전략을 병행하여 운영하는 것을 일컫는 용어.  2014년 가트너(Gartner)에서 기업의 IT 조직 모델로 제시하였다. 바이모달 IT는 기존의 순차적이고 안정성과 정확성을 추구하는 IT 전략과 실험적이고 비선형이며 민첩하게 대응을 추구하는 신속 IT 전략으로 방향성이 다른 두 모드로 구성된다. 즉, 기존의 IT 모드로 내부 시스템에 안정성을 구축함과 동시에 신속 IT 모드로 빠르게 제품을 생산할 수 있도록 한다. 예를 들면 IT 부서에 안정적인 정보기술팀과 신속대응 정보기술팀으로 나누어 상황에 따라 팀을 운영하며 시장 대응할 수 있다. "
에이비 테스팅,A/B testing,,,"디지털 마케팅에서 두 가지 이상의 시안 중 최적안을 선정하기 위해 시험하는 방법. 일반적으로 웹페이지나 앱 개선 시 사용자 인터페이스(UI/UX)를 최적화하기 위해, 실사용자들을 두 집단으로 나누어 기존의 웹페이지 디자인 A안과 새로 개선된 B안을 각각 랜덤으로 보여준 후, A와 B중 선호도가 높게 나온 쪽으로 결정한다.  
A/B 테스팅은 단순히 선호도 조사이기 때문에 쉽고 직관적이지만, 사용자가 어떤 부분을 왜 선호하는지와 같은 심층 조사를 할 수 없다. "
다크 웹,dark web,,,"일반 인터넷 검색 엔진에서 검색되지 않고, 특정 환경의 인터넷 브라우저에서만 접속되는 웹사이트.  다크 웹은 심층 웹(deep web)보다 접근이 더 어렵다. 다크 웹에서는 비트코인 불법 거래, 랜섬웨어를 이용한 돈 요구 등 사이버 범죄가 발생되기도 한다."
애그노스틱 기술,agnostic technology,,,"작동 시스템에 대한 아무런 지식이 없더라도 기능을 수행할 수 있도록 하는 기술. 
예를 들어, 플랫폼 애그노스틱(platform-agnostic) 소프트웨어 기술은 어떠한 운영 체제나 프로세서의 조합인지에 대한 아무런 지식이 없더라도 상관없이 기능을 수행할 수 있는 소프트웨어 기술을 의미한다. 또한, 장치 애그노스틱(device-agnostic) 소프트웨어 기술은 데스크톱, 랩톱, 노트북, 태블릿PC, 스마트폰 등의 어떠한 장치인지에 대한 아무런 지식이 없더라도 상관없이 기능을 수행할 수 있는 소프트웨어 기술을 의미한다."
데이터베이스 분할,database partitioning,,,"대용량의 데이터를 효율적으로 처리하기 위하여 하나의 데이터베이스 테이블을 여러 개로 나누어 저장하는 것. 데이터가 분리·저장되어 데이터 조회 시간이 줄어들고 백업, 복구 등 데이터베이스 시스템 관리에 효율적이다. 데이터베이스 분할 방법으로 하나의 테이블을 행(rows) 단위로 나누어 두 개 이상의 테이블로 분할하는 수평 분할(horizontal partitioning)과 테이블을 열(column) 단위로 분리하여 작게 여러 테이블을 만드는 수직 분할(vertical partitioning)이 있다. 수평 분할은 하나의 테이블에 데이터가 너무 많아 특정 범위나 분류 등을 기준으로 분리하는 경우 사용한다. 그리고 수직 분할은 특정한 열의 크기가 크거나, 또는 특정 열이 자주 조회 또는 갱신되는 등의 경우 사용한다. "
소프트웨어 사용권,software license,,소프트웨어 라이선스,"소프트웨어 사용에 대한 권리.  소프트웨어의 저작권자가 사용을 허가하는 조건이다. 그리고 이때 저작권자는 계약의 형태로 그 사용을 허락하면서 사용의 범위와 방법을 지정하여 주게 되고, 사용자가 이 범위를 넘어서 사용하면 저작권 침해가 된다. 소프트웨어 사용권(라이선스)은 사용 기간, 사용 기준, 제공 형태, 공개 여부 등에 따라 여러 라이선스가 있다. 사용 기간에 따라 영구·기간·임시 라이선스가 있으며, 사용 기준에 따른 라이선스로는 사용자 단위 라이선스, 사이트 라이선스, CPU 라이선스 등이 있다. 그리고 패키지, 번들, 볼륨 등 제공 형태에 따른 라이선스와 소스코드의 배포 유무에 따라 오픈 소스 소프트웨어, 사유(독점) 소프트웨어 등이 있다"
경험 응용 프로그램 인터페이스,Experience Application Programming Interface,xAPI,Tin Can API,"스마트폰, 증강 현실, 게임 등 다양한 매체를 활용하는 전자 학습(이러닝) 환경에서 학습자 경험 데이터를 정의하고 서로 다른 학습 시스템 간에 데이터를 상호 교환하기 위한 응용 프로그램 인터페이스(API) 표준.  xAPI는 미국 전자 학습 표준 연구 개발 기관인 ADL(Advanced Distributed Learning)에서 제정한 스콤(SCORM) 표준의 후속이다. 스콤(SCORM)은 SCORM 표준을 적용한 시스템과 콘텐츠일 경우만 호환이 되었으나, xAPI는 xAPI 표준이 적용되지 않은 학습 관리 시스템(LMS)과 학습 도구 등과도 데이터를 주고받을 수 있어 다양한 학습 활동 데이터(학습 시간, 진도율 등)를 추적 관리할 수 있다. 
xAPI 학습자 경험 데이터는 LRS(Learning Record Store)에 저장되어, 타 시스템이 LRS에 접근해 저장된 데이터를 조회하여 학습 분석하고 활용할 수 있게 한다. 데이터 구조는 프로그래밍 전문 지식이 없어도 누구나 쉽게 해석할 수 있는 간단한 구조로 되어 있다. xAPI는 공개 소스 소프트웨어(OSS)이다."
몽고디비,MongoDB,,,"대표적인 노에스큐엘(NoSQL) 데이터베이스 시스템.  몽고디비(MongoDB)는 데이터 교환 시 비산(BSON: Binary JSON) 문서 형태로 저장하여 여러 서버에 분산 저장 및 확장이 용이하며, 방대한 데이터 처리가 빠르다는 장점이 있다. MongoDB는 C++ 언어로 작성되었으며, 윈도우(Windows), 리눅스(Linux), 맥OS 등 다양한 운영 체제(OS)를 지원한다. 아페로 공용 라이선스(AGPL: Affero General Public License)에 따라 배포되는 공개 소스 소프트웨어(open source software)이다."
스파클,Simple Protocol and RDF Query Language,SPARQL,,"자원 기술 프레임워크(RDF: Resource Description Framework) 기반의 데이터베이스에 사용되는 시맨틱 질의 언어(semantic query language).  스파클(SPARQL)은 2008년 웹 표준화 기구인 월드 와이드 웹 컨소시엄(W3C)에서 제정하였다. 관계형 데이터베이스(RDB)에서 데이터 검색·질의를 위해 구조화 질의 언어(SQL)가 사용되는 것과 같이, 웹 환경의 RDF 데이터베이스에서는 SPARQL이 사용된다. SPARQL의 질의 유형으로 ‘SELECT’, ‘CONSTRUCT’, ‘ASK’, ‘DESCRIBE’가 있다. SPARQL은 개방형 연결 데이터(LOD)를 활용하기 위해 사용"
전자 문서 중앙 관리 시스템,electronic document central management system,,문서 중앙화 솔루션,"사내 구성원이 개인용 컴퓨터(PC)나 모바일 기기에서 작업한 전자 문서를 개인용 기기가 아닌 중앙 서버에만 저장하도록 하여 개인용 기기의 고장이나 분실에 따른 문서 유실을 방지하고, 내부 구성원이나 외부 공격자에 의한 불법 유출 방지를 지원하는 시스템.  전자 문서를 비롯하여 조직에서 생산·관리되는 모든 콘텐츠를 조직 내 관리 서버에만 보관하여 관리하는 기업 콘텐츠 관리(ECM: Enterprise Content Management) 시스템의 일종으로, 기존의 전자 문서 관리 시스템(EDMS: Electronic Document Management System)과 비교된다."
로보어드바이저,robo-advisor,,,"로봇(robot)과 자문가(advisor)의 합성어로, 사람이 아닌 인공 지능 시스템이 개인의 자산 운용을 자문 및 관리하는 온라인 금융 서비스.  로보어드바이저는 인공 지능 알고리즘과 빅데이터 솔루션 등을 기반으로 금융 시장 현황과 고객의 재정 상황, 투자 성향 등의 정보를 수집하고 분석하여 고객에 맞는 자산 운용 방법 등을 자문해 준다. 사람의 개입을 최소화하기 때문에 자문 수수료가 저렴하다는 것이 장점이다. 로보어드바이저는 미국에서 2014년 처음 도입되었다. "
텐서플로,TensorFlow,,,"구글(Google)사에서 개발한 기계 학습(machine learning) 엔진. 검색, 음성 인식, 번역 등의 구글 앱에 사용되는 기계 학습용 엔진으로, 2015년에 공개 소스 소프트웨어(open source software)로 전환되었다. 텐서플로는 C++ 언어로 작성되었고, 파이선(Python) 응용 프로그래밍 인터페이스(API)를 제공한다.
 텐서플로는 빠르고 유연하여 한 대의 스마트폰에서도 운영될 수 있고, 데이터센터의 수천 대 컴퓨터에서도 동작될 수 있다."
자유·공개 소스 소프트웨어,Free and Open-Source Software,FOSS,"자유 오픈 소스 소프트웨어, 프리 오픈 소스 소프트웨어","소스 코드가 공개되며, 누구나 자유롭게 사용할 수 있는 소프트웨어.   FOSS는 자유 이용 소프트웨어(Free Software)이며, 공개 소스 소프트웨어(OSS: Open Source Software)다. 자유 이용 소프트웨어는 프로그램의 공유와 협업을 중시하고 이타주의 정신을 강조하는 반면에, 공개 소스 소프트웨어(OSS)는 산업계의 발전을 위한 프로그램의 확산과 보급에 중점을 두고 있다. 따라서 자유 이용 소프트웨어 진영에서는 일반 공용 사용권(GPL: General Public License)와 같이 소스 코드의 반환을 요구하는 라이선스를 선호하고 있지만, 공개 소스 소프트웨어 영역에서는 아파치 공용 사용권(APL: Apache Public License)와 같이 반환의 의무가 없는 라이선스를 장려하고 있다. 실제로 FOSS는 무료지만 FOSS 사용을 도와주는 서비스는 유료이기 때문에 사업화를 염두에 둔 공개 소스 소프트웨어(OSS) 진영은 무료를 뜻하는 프리(free)라는 용어를 삭제하였다. 이처럼 두 소프트웨어의 탄생 목적과 사용 성향은 조금 다르지만 모두 실행 코드뿐만 아니라 소스 코드도 제공하여 자유롭게 연구하고 복제하고 변경하고 배포하는 자유를 보장하겠다는 취지는 동일하다.  그래서 FOSS는 영어 ‘free’의 명확한 뜻을 전달하기 위해, 불어인 ‘libre’를 병기한 FLOSS(Free/Libre and Open Source Software)와 동일한 용어로 사용된다. FOSS는 상업용 소프트웨어와는 달리 참여가 자유로운 커뮤니티에 의해서 공동으로 개발되어 ‘무보증(no warranty)’ 조건으로 배포된다."
얼랭 프로그래밍 언어,Erlang programming language,,,"대규모의 확장 가능한 실시간 병행(real-time concurrent) 시스템에서 사용되는 함수형 프로그래밍 언어. 시스템 운영 중에도 프로그램을 변경할 수 있는 핫스왑 기능이 지원된다.
 얼랭(Erlang)은 에릭슨(Ericsson)사에서 전화교환기에 사용하기 위해 개발되었으나, 1998년에 아파치(Apache) 라이선스를 갖는 오픈 소스(open-source)로 공개되었다. 얼랭은 은행, 게임, 전자상거래, 모바일 메신저 등 대량의 데이터를 처리하는 서버 시스템 구축에 사용된다."
스위프트 프로그래밍 언어,Swift programming language,,,"애플(Apple inc.)사에서 아이폰, 아이패드, 맥북용 앱 개발을 위해 만든 프로그래밍 언어. 스위프트는 기존 사용하던 오브젝티브-시(Objective-C) 보다 쉽고 빠른 프로그램 개발 환경을 제공한다.
 2015년 오픈 소스(open-source)로 전환되어, 애플 운영 체제(iOS)뿐만 아니라, 리눅스(Linux)와 안드로이드(Android), 윈도우(Windows) 운영 체제에서도 스위프트를 이용할 수 있다."
데이터베이스 샤딩,database sharding,,,"대량의 데이터를 처리하기 위해 데이터베이스 테이블을 수평 분할(horizontal partitioning)하여 물리적으로 서로 다른 곳에 분산 저장 및 조회하는 것.  수평 분할된 1개의 테이블을 샤드(shard)라고 한다. 샤딩은 한 곳에 저장되어 있던 데이터를 여러 샤드에 중복 저장하거나, 하나에만 저장할 수도 있다. "
마이크로서비스 아키텍처,MicroService Architecture,MSA,,"대규모 소프트웨어 개발에 적용하기 위한 것으로 단독으로 실행 가능하고 독립적으로 배치될 수 있는 작은 단위(모듈)로 기능을 분해하여 서비스 하는 아키텍처.  작은 단위로 기능을 분할할 때 수평 방향의 계층별 절단이 아니라, 수직 방향의 기능별로 절단한다. 절단된 독립적인 작은 모듈을 마이크로서비스라 한다. 각 마이크로서비스는 공유나 프로세스 간 통신이 없이도 독립적으로 실행되며 운영 관리된다. 마이크로서비스 간 연결은 응용 프로그래밍 인터페이스(API: Application Programming Service)를 이용한다. 마이크로서비스는 자원 표현이나 데이터 관리 등에 있어서 기능적으로 완전해야 한다. 
마이크로서비스 아키텍처는 레고 블록을 조립하여 원하는 모양으로 만드는 것에 비유할 수 있다. 마이크로서비스 아키텍처 사용으로 개발자들이 클라우드 망을 통해 공유하고 협업하여 자유롭게 소프트웨어를 개발할 수 있으며, 개발 및 유지보수에 드는 시간과 비용이 절감할 수 있다. 단일 서비스로 개발하는 기존 모놀리식(monolithic) 방식과는 반대되며, 서비스 지향 아키텍처(SOA: Service-Oriented Architecture) 방식보다 더 세분화되어 있다."
공용 소프트웨어,Public Domain Software,PDS,,"저작권이나 기타 재산권을 소유자가 포기(relinquishment)하거나 일반 대중에게 기증(donation)하여 누구든지 자유로이 사용할 수 있게 공개되어 있는 소프트웨어. 
소유권이 없기 때문에 누구든 자유롭게 사용하고 변경하고 배포할 수 있을 뿐만 아니라 상업적 목적으로 판매도 가능하다. 공용 소프트웨어(PDS)는 저작권 보호 대상에 해당되지 않아 누구나 자유롭게 사용/배포할 수 있다. 그러나 소스 코드 공개가 필수조건은 아니다."
공개 소스 소프트웨어,Open Source Software,OSS,오픈 소스 소프트웨어,"소스 코드가 공개된 소프트웨어로 개작이나 재배포 등이 자유롭게 허용되면서 저작권자의 권익을 보호할 수 있도록 제도화된 소프트웨어.  비영리 단체인 오픈 소스 이니셔티브(OSI: Open Source Initiative)의 에릭 레이몬드(Eric Raymond)가 상업적 활용을 증대시키려는 목적으로 소스 코드의 공개를 강조하여 자유 이용 소프트웨어(free software) 대신에 사용한 용어다. 일반적으로 소프트웨어는 실행 파일만 제공되므로 타인에 의한 소프트웨어의 개선이나 개작이 불가능하여 소프트웨어 개선에 한계가 있다. 반면에 아무 제약 없이 소스 코드까지 공개한다면 그 소스를 이용한 상품은 범람하여도 본래의 의도인 소프트웨어 발전은 기대할 수 없다. 이러한 불합리한 문제점을 해결하기 위하여 OSI에서는 소스를 공개하여 자유로운 개선, 개작 및 재배포를 허용하되, 그 결과물은 OSI 규정(10개 조건)에 따르도록 규정하고 있다. 이 제도에 따라 기술 개발이 원활하고 경제성이 우수하며 호환성 확보가 쉬운 소프트웨어들이 개발되고 있다.   ※OSI(Open Source Initiative) 규정(10개) : ① 자유 재배포(Free Redistribution) ② 소스 코드(Source Code) 포함 ③ 2차적 저작물(Derived Works) ④ 소스 코드 수정 제한(Integrity of The Author’s Source Code) ⑤ 개인이나 단체 차별 금지(No Discrimination Against Persons or Groups) ⑥ 사용 분야 제한 금지(No Discrimination Against Fields of Endeavor) ⑦ 라이선스 배포(Distribution of License) ⑧ 라이선스 적용상의 동일성 유지(License Must Not Be Specific to a Product) ⑨ 다른 라이선스 포괄적 수용(License Must Not Contaminate Other Software) ⑩ 라이선스 기술 중립성(License Must be Technology-Neutral)"
공개 소스 사용권,open-source license,,"공개 소스 라이선스, 오픈 소스 라이선스","공개(오픈) 소스 소프트웨어 개발자와 이용자 간에 사용 방법 및 조건의 범위를 명시한 계약. (※ 출처: 한국저작권위원회)  공개 소스 소프트웨어를 이용하기 위해서는 개발자가 규정한 사용권(라이선스)을 지켜야 하며, 이를 위반할 경우에는 라이선스 위반 및 저작권 침해가 발생하고, 이에 대한 처벌을 받게 된다. 공개 소스 사용권은 기본적으로 사용자의 자유로운 사용, 수정, 배포를 보장하고 있다.   공개 소스 사용권은 오픈 소스 이니셔티브(OSI: Open Source Initiative)의 공개 소스 정의(OSD: Open Source Definition)에 따라 인증·관리된다. 또한 이 사용권은 수정된 결과물에 대해 공개 의무가 없는 방임적(Permissive) 사용권과 공개 의무가 있는 상호주의(Reciprocal) 사용권으로 구별된다. 대표적인 예로, 방임적(Permissive) 라이선스에는 아파치(Apache), BSD, MIT 라이선스가 있으며, 상호주의(Reciprocal) 라이선스에는 공용 사용권(GNU GPL(General Public License)) 계열의 아페로 GPL(AGPL: Affero GPL), GPL, LGPL(lesser GPL)과 EPL(Eclipse Public License), MPL(Mozilla Public License) 등이 있다. GNU GPL은 가장 많이 사용되는 카피레프트(copyleft) 라이선스로, 소스 코드를 사용·변경·배포 시 GPL 라이선스를 명시할 것을 조건으로 한다. AGPL은 웹상에서 수정한 공개 소스도 사용자에게 공개할 것을 더 요구하며, LGPL은 GPL 조건을 완화한 것으로 라이브러리 형태의 결합 방식에서는 소스 코드의 배포 의무가 없다. "
지능형 가상 비서,Intelligent Personal Assistant,IPA,,"개인 비서처럼 사용자가 요구하는 작업을 처리하고 사용자에게 특화된 서비스를 제공하는 소프트웨어 에이전트.  인공 지능(AI) 엔진과 음성 인식을 기반으로 사용자에게 맞춤 정보를 수집하여 제공하고, 사용자의 음성 명령에 따라 일정 관리, 이메일 전송, 식당 예약 등 여러 기능을 수행한다.
애플(Apple) 시리(siri), 구글의 구글나우(Google Now), 마이크로소프트의 코타나(cortana), 삼성의 S보이스 등이 있다."
자유 이용 소프트웨어,free software,,"프리 소프트웨어, 자유 소프트웨어","누구든지 자유로이 사용, 복사, 수정 및 재배포 등을 할 수 있도록 소스 코드와 함께 배포되는 소프트웨어. 자유 소프트웨어는 소프트웨어의 자유로운 개발과 공유를 촉진할 목적으로 프리 소프트웨어 재단(FSF: Free Software Foundation)을 설립한 리처드 스톨먼(Richard Stallman)이 주창한 개념이다. 자유 소프트웨어는 저작권에 관계없이 누구나 차별 없이 자유롭게 사용, 수정, 복사, 재배포 등을 할 수 있다. 단, 자유 소프트웨어를 수정하여 재배포하는 경우에는 수정된 모든 내용을 분명하게 표시해야 하고, 원저작자의 성명과 저작권 공고(copyright notice)를 삭제하거나 변경해서는 안 된다. 여기서 자유(free)는 무료의 의미가 아닌 사용의 자유(libre)를 의미한다."
마이크로 발광 다이오드,MicroLED,µLED,마이크로엘이디,"일반 발광 다이오드(LED) 칩 보다 길이가 10분의 1, 면적은 100분의 1 정도로 10 ~ 100 마이크로미터(µm) 크기의 초소형 LED.  마이크로엘이디(µLED)는 기존 LED에 비해 반응 속도가 빠르고, 낮은 전력, 높은 휘도를 지원하며, 디스플레이에 적용할 경우 휘어질 때 깨지지 않는 장점을 갖는다. 따라서 초경량 무게를 필요로 하는 스마트워치, 스마트 섬유, 머리 착용 디스플레이(HMD) 기기 등에 응용될 수 있다."
지상파 UHD 방송 표준,Terrestrial Ultra High Definition broadcasting standard,,,"국내 지상파 초고선명(UHD) 방송 표준 (TTAK.KO-07.0127 ).  한국정보통신기술협회(TTA) 에서 미국 ATSC 3.0 UHD 방송 표준을 기반으로 국내 방송 환경에 적합하게 제정하였다.  
초고해상도의 영상, 몰입형 오디오, IP 기반의 양방향 맞춤형 서비스, 재난 알림, 모바일 방송 서비스 등을 주요 특징으로 한다. 핵심 기술로 고효율 비디오 코딩(HEVC: High Efficiency Video Coding), MPEG-H 3D 오디오, 계층 분할 다중화(LDM: Layered Division Multiplexing) 기술, 그리고 IP 기반의 엠펙 미디어 전송(MMT: MPEG Media Transport)과 루트(ROUTE: Real-time Object delivery over Unidirectional Transport) 전송 방식이 채택되었다.  우리나라는 2017년 5월 세계 최초로 지상파 UHD 방송을 시작하였다.  "
10.2 채널 음향,10.2 channel audio,,,"청취자를 중심으로 독립된 스피커 10개와 저음을 전용으로 재생하는 서브우퍼(subwoofer) 2개로 구성된 음향 시스템.  독립된 스피커 10개는 각각 수평면으로 전방 중앙(C), 전방 좌측(L), 전방 우측(R), 후방 좌측(LB), 후방 우측(RB), 좌측(LS), 우측(RS), 그리고 수직면으로 후방 중앙(CH), 전방 좌측(LH), 전방 우측(RH)에 위치하며, 서브우퍼는 바닥면 좌측(LFE1)과 바닥면 우측(RFE2)에 위치한다. 이를 통해 기존 HDTV의 5.1 채널 음향보다 사실적이고 현장감 넘치는 입체 음향을 제공한다.  
10.2 채널 오디오 기술은 우리나라 ETRI와 삼성전자가 공동 개발하였으며, ITU 국제 표준(BS.2051)으로 채택되었다. "
컴패니언 스크린,companion screen,,,"TV 방송 시청에 동반되어 이용되는 보조 기기.  
이종 단말기에서 동일한 콘텐츠를 자유롭게 이용할 수 있는 엔스크린(N screen)의 한 종류이다. 스마트폰, 태블릿PC, PC가 대표적인 컴패니언 스크린 기기이다. TV와 IP망으로 연결하여 TV로 시청하는 방송을 컴패니언 스크린 기기와 공유하여 이용할 수 있다. 예를 들어, 시청자는 TV로 실시간 방송을 시청하면서 스마트폰으로는 컴패니언 스크린용 웹브라우저를 통해 방송 관련 정보, 방송에 나오는 가수의 영상(VOD), 음원(AOD) 등을 이용할 수 있다. 컴패니언 스크린 서비스는 UHD 방송 서비스 중 하나이다. 세컨드 스크린(second screen)이라고도 한다."
스마트 수어 방송,smart sign language broadcasting,,,"TV 시청자가 방송 수신기에서 장애인 방송 서비스인 수어(手語, 수화 언어) 영상의 표시, 크기, 위치 등을 조정할 수 있는 방송 서비스.  
시청자가 수어 영상 표시, 숨김, 크기, 위치 조정을 할 수 있어 청각장애인과 비장애인 모두에게 시청 편의를 제공한다. 
스마트 수어 방송에서는 방송 영상과 수어 영상이 함께 송신되는 것이 아니라, 방송 영상은 방송망으로 송신되고, 수어 영상은 인터넷으로 송신된다. 
수신기에서는 각기 수신된 방송 영상과 수어 영상을 타임라인 정보를 참조하여 동기화시킨 후 한 화면에 같이 재생한다.  

장애인 방송 서비스로 수어 외 자막, 화면 해설 서비스가 있다. 

※ 관련 국내 표준: 
 TTAK.KO-07.0125 스마트 수화방송서비스 송수신 정합"
에이티에스시 3.0,Advanced Television Systems Committee standard 3.0 version,ATSC 3.0,,"미국 디지털 TV 표준화 단체인  ATSC(Advanced Television Systems Committee) 에서 제정한 지상파  초고선명(UHD : Ultra High-Definition) 방송 기술 표준. 
고효율 코덱(CODEC), IP 기반의 방송 시스템, 유연하게 사용되는 RF 주파수 대역 등이 주요 특징이다. 
핵심 기술로 고효율 비디오 코딩(HEVC: High Efficiency Video Coding), 3차원 오디오(3D audio)/AC-4, 계층 분할 다중화(LDM: Layered Division Multiplexing) 기술, 그리고 IP 기반의 엠펙 미디어 전송(MMT: MPEG Media Transport)과  루트 ( ROUTE : Real-time Object delivery over Unidirectional Transport) 방식이 채택되었다. 
변조 방식은 다치 변조인 4096-QAM(Quadrature Amplitude Modulation)을, 채널 코딩은 효율이 좋은  저밀도 패리티 검사 부호 (LDPC: Low Density Parity Check code)를 채택하여 최대 57Mbps 까지 전송 용량을 제공한다. 

우리나라는 지상파 초고선명 텔레비전(UHDTV) 방송 표준으로 ATSC 3.0을 채택하여, 2017년부터 본 방송 서비스를 실시한다. 
※ 엠펙 미디어 전송(MMT): 기존 엠펙 전송 스트림(MPEG 2-TS)을 보완하여 인터넷에서도 사용이 가능한 전송 프로토콜. 
※ 루트(ROUTE): 방송망에서 IP 기반으로 실시간 방송 콘텐츠를 전송하기 위한 방송 전송 프로토콜."
전자 서비스 안내,Electronic Service Guide,ESG,방송 정보 안내," 초고선명(UHD)  방송에서 방송 프로그램 정보를 안내하는 부가 서비스. 
기존 디지털 텔레비전(DTV)의 전자 프로그램 안내(EPG: Electronic Program Guide)는 텍스트 기반의 간단한 방송 프로그램 정보만을 제공하지만, ESG는 텍스트 정보 외에 이미지, 동영상, 애플리케이션 등 다양한 서비스를 제공한다. 
UHD 방송이 방송망과 인터넷을 동시에 사용하여 다양한 형태의 방송 서비스가 가능해진 덕분이다. 
시청자는 현재 시청하는 채널의 방송 시간, 방송 프로그램의 상세 줄거리, 지난 회 방송이나 예고편 영상 등도 쉽게 찾아볼 수 있다.  
ESG는 지상파 UHD 방송 기술 표준인  ATSC 3.0 에 포함되어 있다.
"
루트,Real-time Object delivery over Unidirectional Transport,ROUTE,,"방송망을 통해 UHD 방송 콘텐츠를 전송하기 위한 프로토콜.  ROUTE는 엠펙 미디어 전송(MMT: MPEG Media Transport) 프로토콜과 함께 미국 지상파 UHD 방송 표준인  ATSC 3.0 의 핵심 전송 프로토콜 기술로 채택되었다.  
ROUTE 프로토콜은 IP 기반의 파일 또는 분할된 객체들을 실시간으로 전송할 수 있게 기존의 비실시간 파일 전송 프로토콜인 플루트(FLUTE: File Delivery over Unidirectional Transport)에서 확장되었다. 따라서 실시간 IP 기반 영상 콘텐츠뿐만 아니라 비실시간으로 전송되는 방송  전자 서비스 안내 (ESG: Electronic Service Guide)와 같은 부가 콘텐츠를 방송망으로 전송한다. 방송망으로 전송되는 영상 파일의 형식은 인터넷으로 전송되는 파일 형식과 동일하다. 영상 파일 정보를 담고 있는 메타데이터는 HTTP 동적 적응 스트리밍(MPEG DASH: MPEG Dynamic Adaptive Streaming over HTTP)에서 정의하는 MPD(Media Presentation Description)를 공통적으로 사용하기 때문에 방송망과 인터넷 간의 높은 호환성을 보여준다.  
"
방송·브로드밴드 융합 서비스,Integrated Broadcast Broadband,IBB,방송·통신 통합 서비스,"지상파 방송 서비스와 광대역 인터넷 서비스가 융합된 새로운 형태의 통합 방송 서비스.  
지상파 방송망과 광대역 통신망(broadband network)이 결합된 방송 통신 융합 환경에서 다양한 부가 방송 서비스를 제공한다. IBB는 HTML5 웹 표준을 기반으로 하기 때문에 시청자는 TV로 방송을 시청하면서 인터넷 기반의 방송 프로그램 정보, 쇼핑 구매, 주문형 비디오(VoD) 등 맞춤형의 양방향 서비스를 이용할 수 있다. 또한 TV 방송을 스마트폰, 태블릿PC 등의 컴패니언 스크린(companion screen) 기기에서도 동일하게 이용할 수 있다.  예를 들어, 시청자는 UHDTV로 시청하고 있는 고화질의 드라마를 스마트폰으로 실시간 공유하여 시청하면서 드라마 속 배우의 정보나 영상을 추가로 찾아볼 수 있고, 티-커머스(Television commerce)로 물품을 구매할 수 있다.  
IBB 서비스는 미국의 UHD 방송 표준인 ATSC(Advanced Television Systems Committee) 3.0과 유럽의 하이브리드 방송 표준 HbbTV(Hybrid Broadcast Broadband TeleVision) 2.0을 적용한 국내 정보통신단체표준(TTAK.KO-07.0128)을 기반으로 한다.
"
고프레임률,High Frame Rate,HFR,,"영화 또는 텔레비전 영상 등에서 화질 향상을 위해 초당 프레임 수를 증가시키는 기술.  영상 신호를 획득, 전송 또는 재생할 때 초당 프레임 수(fps)가 일반적인 프레임 수 보다 2배 또는 그 이상 높은 경우를 고프레임률이라 한다. 일반적으로 영화는 초당 24 프레임, 고선명 텔레비전(HDTV)은 30 프레임, 초고선명 텔레비전(UHDTV)은 60 프레임을 제공한다. 그러나 고화질을 위해서 풀 HDTV(full HDTV)는 60 프레임, UHDTV는 120 프레임의 고프레임률을 목표로 한다. "
건당 요금제 주문형 비디오,Transactional Video on Demand,TVoD,,"콘텐츠 1건당 이용 요금을 지불하는 주문형 비디오(VoD) 서비스.  구글플레이(Google Play), 아이튠즈(iTunes)에서 영화 1건당 구매해서 이용하는 서비스가 TVoD에 해당한다. 주문형 비디오(VoD) 서비스로, 건당 요금제의 TVoD 서비스 외 월 정액제로 서비스하는 가입형 주문형 비디오(SVoD: Subscription VoD) 서비스가 있다. SVoD 서비스로 아마존(Amazon), 넷플릭스(NetFlix) 등이 있다."
엠엔지(MNG),Mobile News Gathering,MNG,,"방송용 카메라 등으로 취재한 영상물을 엘티이(LTE)와 같은 무선 통신망으로 전송하는 방식.  방송용 카메라에 엘티이(LTE), 와이브로(WiBro), 와이파이(Wi-Fi) 등에 접속할 수 있는 장비가 부착되어 촬영한 영상을 무선 통신망으로 전송할 수 있다. 주로 중계차가 들어가지 못하는 곳에서 사용되며 재난 재해와 긴급 보도, 등 사건 현장에서 간이 시스템만으로도 고화질 생방송할 수 있다는 장점이 있다."
에스엔지(SNG),Satellite News Gathering,SNG,,"야외에서 획득한 취재물을 위성을 통해 전송하는 방식. 야외에서 취재한 영상물을 스튜디오로 전송하는 방식에는 광케이블을 이용하는 유선 방식과 위성이나 마이크로웨이브, 그리고 이동 통신을 이용하는 무선 방식이 있다. SNG는 위성을 이용하는 방식으로 전송 시스템을 주로 소형 차량에 탑재하여 시스템을 구성하기 때문에 이동 위성 지구국(earth station)이라고도 부른다. SNG 방식은 중계차보다 전송로 구성이 간편하고 산악, 도서 지역 등에서 기동성이 높아 뉴스 취재용으로 많이 활용된다."
의무 재송신,must-carry,,,"유료 방송 사업자가 지상파 방송 KBS1과 EBS1을 수신하여 그 방송 프로그램에 변경을 가하지 않고 그대로 동시에 송신하는 것.  
방송법(78조)에서는 공공성이 강한 KBS1과 EBS1은 모든 채널에서 동시에 재송신되어야 한다고 규정되어 있다. 다만, 나머지 지상파 방송의 의무 재송신은 법으로 규정되어 있지 않아 유료방송사와 방송 프로그램 사용료 때문에 분쟁으로 번지기도 한다.  
※지상파 방송사: KBS, MBC, SBS, EBS 
※유료 방송 사업자: CJ헬로비전, 현대HCN, Btv, KT스카이라이프 등"
이에프피(EFP),Electronic Field Production,EFP,야외 제작 카메라,"야외 스튜디오나 중계차에서 방송 프로그램 제작을 위해 개발된 카메라 시스템.  EFP가 이엔지(ENG: Electronic News Gathering)와 큰 차이가 없지만, 다른점은 ENG에는 카메라 제어 장치(CCU: Camera Control Unit)가 없고 EFP에는 CCU가 있다. 따라서 용도도 약간 다르다. ENG는 주로 뉴스 영상 취재용도로, EFP는 야외에서 촬영되는 드라마나 스포츠 이벤트 등에 사용된다."
이엔지(ENG),Electronic News Gathering,ENG,뉴스 취재 카메라,"녹화 기능이 탑재된 일체형 카메라 시스템.  기존의 필름 카메라 대신에 비디오 테이프를 사용하여 녹화 후 즉시 활용할 수 있기 때문에 뉴스 취재에서 기동성, 동시성, 경제성 등의 이점이 있다. 그동안 ENG 시스템은 기술 진화를 거듭하면서 카메라, VCR 일체형이 등장했고, 카세트테이프 대신 하드 디스크 드라이브(HDD)를 사용하고 있으며, 마이크로웨이브(M/W: Microwave) 등을 이용한 링크(link) 장비를 사용하여 생방송도 가능하다. 또한 진화된 이동통신 기술을 이용하여 스마트폰 등 모바일 기기로도 ENG 시스템을 대신할 수 있게 되었다."
가용 채널 평가,Clear Channel Assessment,CCA,채널 가용 평가,"무선랜인 와이파이(Wi-Fi) 주파수 채널의 가용 여부를 감지하는 방법.  
물리 계층상에서 와이파이 채널의 사용 가능 여부를 평가하기 위한 것으로  동종인 와이파이를 센싱하는 반송파 감지(CS: Carrier Sensing) 방법과 이종 장치의 채널을 센싱하는 에너지 검출(ED: Energy Detection) 방법으로 구분된다.  
반송파 감지(CS) 방법은 와이파이의 프리앰블(preamble)을 해독하고 헤더(header) 내의 길이 정보를 가지고 현재 사용되고 있는 프레임의 예상 점유 시간을 산출한다. 
에너지 검출(ED) 방식은 와이파이 이외의 다른 장치(non Wi-Fi)의 에너지 양을 검출하여 채널 상태를 판단한다. CS 방식이 한 번의 센싱으로 현재 사용하고 있는 이용자의 채널 점유 시간을 정확하게 예측할 수 있는 반면에 ED 방식은 매 시간(slot time) 채널을 센싱한다."
와이파이 대역 조정 기술,Wi-Fi band steering,,,"통신 환경에 따라 신호를 원활하게 제공하기 위해 2.4GHz와 5GHz 중 최적의 주파수를 자동으로 연결하는 기술.  
와이파이(Wi-Fi)는 2.4GHz ISM 대역과 5GHz 대역의 면허 불필요 국가 정보 기간망(UNII: Unlicensed National Information Infrastructure) 대역을 사용할 수 있다. 
2.4GHz ISM 대역은 80MHz 대역폭에서 블루투스(Bluetooth), 지그비(ZigBee), 전자레인지(microwave ovens), 무선 전화(Cordless Telephone) 등이 공동으로 사용하기 때문에 혼잡하다. 반면에 5GHz 대역은 최소 23개의 중첩되지 않는 채널이 있기 때문에 대역폭이 매우 넓어 채널 환경이 비교적 깨끗하다. 
와이파이 대역 조정 기술(Wi-Fi band steering)로 통신 환경에 따라 채널이 자동으로 연결되어 와이파이 단말이 효율적으로 사용될 수 있다.  
※ IEEE802.11n 와이파이 표준은 2.4GHz 대역과 5GHz 대역을 모두 지원한다."
무선 미터버스,Wireless Meter-bus,WM-bus,무선 M-bus,"전기, 가스, 수도 등의 원격 검침을 위한 스마트 미터링(smart metering) 또는 AMI(Advanced Metering Infrastructure)에 사용되는 무선 프로토콜.  WM-bus는 유럽 표준(EN 13757-4)에 정의되어 있다. 서브-기가헤르츠 대역(sub-GHz)(868MHz, 433MHz, 169MHz)을 사용하며, 데이터 통신의 오버헤드가 매우 적고 배터리 수명을 최장20년까지 지속시킨다."
클라우드 무선 접속망,Cloud Radio Access Network,"C-RAN, Cloud-RAN",,"기존 기지국의 디지털 장치(DU: Digital Unit)와 RF 장치를 분리하여 여러 기지국의 DU를 중앙에 모아서 처리하고, RF 장치는 서비스 지역에 분산시키는 무선 접속망.  기존의 기지국은 디지털 장치(DU)와 RF 장치를 한 곳에서 일체형으로 처리하였다. 이에 반하여 클라우드 무선 접속망(C-RAN)은 디지털 장치(DU)(또는 베이스밴드 장치(BBU: BaseBand Unit))와 RF 장치(또는 원격 무선 장비(RRH: Remote Radio Head)를 분리시키고, 이를 광케이블 또는 고속의 무선 전달 장치로 연결한 기지국 구조를 갖는다. 디지털 장치(DU)가 클라우드 데이터 센터 형태로 한 곳에 집중되어 있기 때문에 셀 간의 간섭 조정이 용이하고 협력 통신 등의 고품질 서비스가 가능하다. 또한 디지털 장치(DU)를 한곳에 모아 운용함으로써 망 운용에 있어 임대 비용과 전력 비용을 절감하고, 유지 보수가 용이한 장점을 가지게 된다. 유선 기반의 광케이블로 연결될 경우 데이터와 제어(컨트롤) 정보 교환을 위한 인터페이스 표준으로 CPRI(Common Public Radio Interface), ORI(Open Radio equipment Interface), OBSAI(Open Base Station Architecture Initiative)가 있다."
소물 인터넷,Internet of Small Things,IoST,,"저속, 저전력, 저성능의 특징을 갖는 사물들로 구성된 사물 인터넷.   사물 인터넷(IoT)을 구성하는 사물들 중에는 네트워크를 통해 교환해야 하는 데이터의 양이 많은 사물들과 그렇지 않은 사물들이 있다. 이 중에서 교환해야 하는 데이터의 양이 많지 않은 사물들을 소물(small thing)이라 하며, 소물들로 구성된 네트워크를 소물 인터넷이라고 한다. 
대표적인 소물로 월 1~2회 정도로 제한하여 데이터를 교환하는 수도·전기·가스 원격 검침용 기기, 오프라인 매장에서 사물 정보를 소비자 스마트폰에 전송하는 저전력 블루투스(BLE) 비컨 등이 있다. 소물들은 교환해야 하는 데이터의 양이 많지 않기 때문에 일반적으로 저성능 프로세서를 이용하며, 배터리 하나로 수년간 동작된다. 
소물들을 상호 연결하기 위해 주로 이용되는 기술에는 블루투스(Bluetooth), 지그비(Zigbee), 지웨이브(Z-Wave) 같은 저전력 단거리 무선망 IPv6( 6LoWPAN )과 로라(LoRaWAN), 시그폭스(SIGFOX),  협대역 사물 인터넷 (NB-IoT) 등과 같은 저전력 광역 통신망(LPWAN)이 있다. "
스레드 프로토콜,Thread protocol,Thread,스레드 통신 규약,"저전력 단거리 무선망 IPv6(6LoWPAN)을 기반으로 하여 댁내 도어록, 전구, 온도 조절기, 세탁기 등 스마트 홈 기기 간의 사물 인터넷을 제공하는 무선 프로토콜.   스레드 네트워크 프로토콜은 스레드 그룹(Thread Group)에서 개발되었다. 스레드 그룹은 구글(Google)사의 주도로 2014년 설립된 비영리 단체로 구글(Google)의 네스트랩스(Nest Labs), 프리스케일(Freescale) 반도체 제조사, 암 홀딩스(ARM Holdings), 퀄컴(Qualcomm), 삼성 등이 참여한다. 스레드의 주요 특징은 128 비트 주소 체계인 IP 버전 6(IPv6)를 기반으로 하며, 저전력 무선 통신 기술인 지그비(Zigbee)의 전력 기능과 고급 암호 표준(AES: Advanced Encryption Standard)를 적용하여 보안 기능을 강화한 것 등이다. 네스트랩스(Nest Labs)사의 도어록과 온도 조절기 제품 등에 스레드 네트워크 프로토콜이 사용되었다."
와이파이 헤일로,Wi-Fi HaLow,,,"와이파이 얼라이언스(Wi-Fi Alliance)에서 저전력 와이파이 표준(IEEE 802.11ah)을 탑재한 장치를 일컫는 명칭.  와이파이(Wi-Fi)는 대부분 2.4 GHz 또는 5 GHz 주파수 대역을 사용한다. 그러나 와이파이-헤일로(Wi-Fi HaLow) 표준은 1 GHz 이하 대역을 사용하므로 기존 와이파이보다 장거리 전송, 광대역 커버리지가 가능하고 또 문이나 벽과 같은 장애물 통과 특성도 우수하다. 또한 소비 전력이 매우 적다. 와이파이 헤일로의 최대 서비스 거리는 1 km 정도로 통상의 와이파이보다 약 2배 정도의 서비스 커버리지를 갖는다. 와이파이 헤일로는 스마트홈, 커넥티드 카, 웨어러블 기기 등 저전력이 필요한 사물 인터넷(IoT) 기기에 사용될 수 있다."
앤트플러스 프로토콜,Advanced and adaptive Network Technology plus protocol,ANT+ protocol,,"상호 운용성을 보장하는 초저전력 무선 센서 네트워크 프로토콜.  앤트플러스(ANT+) 프로토콜은 초저전력 무선 센서 네트워크 프로토콜인 앤트(ANT) 장치 간에 상호 운영성(interoperability)을 보장하는 프로토콜로 2,457 MHz 대역에서 동작한다. ANT+는 특히 소형 코인셀 배터리 하나로 수년간 동작 가능할 정도로 전력 소비가 적어, 주로 운동, 건강 관리를 위한 심박수 모니터, 자전거 전력미터기 등과 같은 소형 스마트 기기에 사용된다. 그리고 피투피(P2P), 스타형(star), 트리형(tree), 메시형(mesh) 망 형태(topology)를 지원한다. 캐나다 기업인 다이나스트림 이노베이션즈(Dynastream Innovations Inc)에서 개발되었고, 앤트플러스 협회(ANT+ Alliance)에서 관리한다(등록상표)."
머리 추적,head tracking,,,"가상 현실(VR) 머리 착용 디스플레이(HMD)에서 사용자 머리의 움직임을 추적하는 기술. 사용자의 머리 중심을 3차원 좌표계의 원점에 두고, 전후좌우상하 움직임을 추적하여 HMD 화면에 반영한다. 머리가 움직이는 대로 화면이 자동으로 바뀐다.  
머리 움직임에 따른 위치 값을 파악하기 위해 가속도 센서(accelerometer sensor), 자이로 센서(gyroscope sensor), 자기장 센서(magnetometer sensor) 등이 사용된다. 각 축(x, y, z)을 중심으로 한 회전각은 자이로 센서로 측정하고, 움직임 거리는 가속도 센서로 측정한다. 움직임 거리는 대부분 회전각의 보조 정보로 이용된다. 자기장 센서로 방향의 기준을 잡는 경우도 있으나 자성 물질에 의해 쉽게 교란될 수 있어 제한적으로 사용된다. 별도의 적외선 카메라를 이용한 위치 추적(positional tracking)이 사용되기도 한다. "
소프트 로봇,soft robot,,,"딱딱한 금속이 아닌 유연한 소재로 만든 로봇. 소프트 로봇은 로봇 전체 또는 일부에 폴리머, 고무 등과 같은 유연하고 신축성이 있는 소재를 활용하여 변형이 잘되고 움직임이 부드럽다.  
연성의 구조로 되어 있어 동력이 강하지 않고, 복잡한 기능보다는 비교적 단순한 기능을 수행한다. 
소프트 로봇은 바닷속이나 거친 지형과 같은 환경에서 유연하게 움직일 수 있어 의료, 탐사, 재난, 제조 등 여러 분야에서 활용될 수 있다.  

2016년 EU 주관으로 열린 세계 최초의 소프트 로봇 경진대회(RoboSoft Grand Challenge)에서 우승을 한 서울대학교의 스누맥스(SNUMAX) 로봇은 포유동물인 아르마딜을 본뜬 것으로 바퀴가 자유자재로 변형되어 계단을 오르거나 장애물을 피하는 등의 유연한 동작을 한다. 미국 하버드 대학교에서 만든 옥토봇(Octobot)은 문어를 본떠 만든 것으로 전기 에너지 없이 스스로 자유롭게 움직인다."
가상 망막 디스플레이,Virtual Retinal Display,VRD,망막 주사형 디스플레이(RSD: Retinal Scan Display),"영상 신호를 광 신호로 변환하여 빔을 눈의 망막에 직접 투사하는 디스플레이 방식.  텔레비전 래스터 주사 디스플레이 방식이 화면에 전자 빔을 주사(scan)하는 것인데 반해, 가상 망막 디스플레이(VRD)는 사람 눈의 망막에 직접 빔을 투사한다(projection).  가상 망막 디스플레이(VRD)는 실제 화면에 가상 정보를 덧붙여 보여주는 증강 현실(AR)용 머리 착용형 디스플레이(HMD)에 응용된다. 
대표적인 예로, 안경 형태의 구글 글라스(google glass)는 프리즘 프로젝터(prism projector)를 장착하여 사용자 눈에 AR 정보를 제공한다. 
"
스마트 홈 허브,smart home hub,,,"가정에서 사용자의 음성 인식을 기반으로 인공 지능 서비스를 제공하는 허브.  스피커, TV, 거울 등이 매개체가 되어 가정 자동화(home automation) 서비스를 실현한다. 허브 기기에는 음성 인식 기반의 인공 지능(AI) 소프트웨어와 사물 인터넷(IoT) 기능이 탑재되어 있어, 전원이 켜져 있는 동안 마이크를 통해 사용자의 말을 듣고 처리하거나, 음성 데이터를 클라우드 서버로 전송하여 결과를 받아 작업을 수행한다.  스마트 홈 허브는 가전제품, 조명, 보안시스템 등 가정 내 기기를 사물 인터넷(IoT)으로 연결·제어하는 홈 허브 역할과 사용자의 음성 명령에 따라 음악을 검색하여 틀고, 실시간 교통 상황을 안내하며, 배달 음식 주문도 하고, 실내 온도를 조절하는 등  지능형 가상 비서 ( IPA : Intelligent Personal Assistant) 역할을 한다.  
대표적인 스마트 홈 허브로 아마존 에코(Amazon echo), 구글 홈(Google Home), 애플 홈팟(Apple HomePod), SK텔레콤의 누구(NUGU) 스피커 등이 있다."
저속 촬영 영상,time-lapse video,,타임랩스 영상,"긴 시간 동안 변화하는 피사체의 모습을 짧은 시간 안에 보여주기 위해 일정 시간 간격으로 사진을 연속 촬영한 후 압축한 영상.  별밤, 일몰, 식물의 개화, 도시 풍경 등 천체나 자연생태와 같이 모습이 매우 느리게 변하는 피사체 촬영에 많이 사용된다.  
일반적으로 영화나 방송 영상은 초당 촬영 프레임 속도(frame rate)와 재생 속도가 동일하여 피사체의 움직임이 자연스럽게 보인다(영화 1초에 24장 또는 방송은 1초 30장). 반면 저속 촬영(타임랩스) 영상은 촬영 속도가 재생 속도보다 느려 재생 시 실제 움직임보다 빠르게 보인다. 예를 들어, 1시간 동안 피사체를 30초마다 1컷씩 촬영하여 120컷 정지 영상(still image)을 만들고, 120컷의 이미지들을 모아 압축하면 1시간 동안 촬영한 피사체 움직임이 4초간 초당 30 프레임의 고속 영상으로 재생된다. 촬영 시간 간격에 따라 영상의 느낌이 달라져 피사체나 촬영 목적에 따라 촬영 시간 간격 조절이 필요하다. 저속 촬영 영상은 방송 및 전문 영역에서 많이 사용되나 카메라와 스마트폰의 기술 발달로 비전문가도 쉽게 스마트폰으로 제작할 수 있게 되었다."
착용 무인기,wearable drone,,웨어러블 드론,"손목 등에 착용하는 무인 항공기(드론).  초소형 카메라가 장착된 드론을 팔찌처럼 손목에 착용하고 있다가 버튼을 눌러 공중으로 날려 촬영, 셀프카메라 등을 할 수 있다. 2014년 인텔(Intel)이 주최하는 웨어러블 기기 경연 대회에서 착용 무인기로 닉시(Nixie)가 최초 공개되었다."
착용 기술,wearable technology,,웨어러블,"정보통신(IT) 기기를 사용자 손목, 팔, 머리 등 몸에 지니고 다닐 수 있는 기기로 만드는 기술.  
초소형 부품과 초박막형의 휘는(플렉서블) 디스플레이, 스마트 센서, 저전력 무선 통신, 모바일 운영 체제 등 IT 기술이 일상생활에서 사용되는 시계, 안경, 옷, 헬멧 등에 접목되어 사용자에게 언제 어디서나 컴퓨팅 환경을 제공한다. 착용(웨어러블) 기술은 스마트워치와 같은 착용 컴퓨터(wearable computer), 스마트 의류(smart clothes), 머리 착용 디스플레이(HMD: Head-mounted display)와 같은 가상 현실(혼합 현실) 체험 기기, 피부에 이식하는 임플란트 등으로 응용되어 개인용뿐만 아니라 산업, 의료, 군사 등 모든 분야에 활용된다."
착용 컴퓨터,wearable computer,,"웨어러블 기기, 착용 기기","일상생활에서 사용하기 편리하고 휴대 또는 착용 가능한 형태의 컴퓨터.  착용 컴퓨터는 언제 어디서나 사용자의 요구에 응할 수 있는 유비쿼터스 컴퓨팅 환경을 제공한다. 안경, 시계, 반지 등과 같은 액세서리, 의복, 또는 신체 이식 형태가 있다. 착용 컴퓨터는 단순 착용 기기보다 좀 더 복잡한 컴퓨터 기능이 지원된다. 주요 장점으로는 주변 환경에 대한 상세 정보나 개인의 신체 변화를 실시간으로 수집하여 제공하는 것이다. 예를 들어, 스마트안경(smartglasses)의 경우 주변의 정보를 실시간으로 기록하고 보여주며, 스마트 속옷은 체온, 심장박동과 같은 생체 신호를 수시로 수집하여 건강 관리에 도움을 준다."
머리 착용 디스플레이,Head Mounted Display,HMD,"헤드 마운티드 디스플레이, 헬멧형 디스플레이, 두부 장착형 디스플레이, 머리 장착형 영상장치","머리에 착용하는 형태의 디스플레이.  HMD 장치를 머리에 쓰면 양쪽 눈의 근접한 위치에 소형 디스플레이가 있어 시차를 이용한 삼차원(3D) 영상이 투영된다.  사용자의 움직임을 트래킹하는 자이로 센서, 움직임에 따라 영상을 만드는 렌더링 기능 등으로 사용자는 3D 공간에 있는 것 같은 가상 현실(VR) 또는 증강 현실(AR)을 실감할 수 있다. HMD는 게임뿐만 아니라 산업, 우주 개발, 원자로, 군사 기관 및 의료 기관 등 다양한 분야에 활용된다.  최초의 HMD는 1968년 컴퓨터 그래픽스 창시자인 이반 서덜랜드(Ivan Sutherland) 교수가 만든 것으로 알려져 있다.  
HMD 기기는 구글 카드보드(Google cardboard), 삼성 기어 VR(GearVR) 등과 같은 스마트폰 장착형 HMD와 오큘러스 리프트(Oculus Rift), HTC VIVE 등과 같이 PC와 연결되는 데스크톱형 HMD, 소니 PSVR과 같이 게임 콘솔 연결형 HMD, 각종 센서들을 HMD에 부착한 혼합 현실형(MR) HMD 등이 있다.
"
객체 추적,object tracking,,비디오 트래킹(video tracking),"카메라로 촬영되는 영상에서 사람, 동물, 차량 등 특정 객체(object)의 위치 변화를 찾는  컴퓨터 비전 (computer vision) 기술.   이미지나 영상에서 객체를 찾아내는 것은 객체 탐지(object detection) 기술이다. 객체 추적(object tracking)은 일련의 영상 프레임 내 객체의 크기, 색, 모양, 윤곽선 등 특징적인 정보 간의 유사도를 이용하여 객체의 변화를 추적한다.  
객체 추적 기술은 실시간 영상 보안, 영상 통화, 교통 통제, 증강 현실 등 여러 분야에서 활용된다.
"
객체 탐지,object detection,,객체 검출,"이미지나 동영상에서 사람, 동물, 차량 등 의미 있는 객체(object)의 종류와 그 위치(bounding box)를 정확하게 찾기 위한  컴퓨터 비전 (computer vision) 기술.  
영상에서 관심 대상을 인식하기 위해 일반적으로 검출 대상에 대한 후보 영역을 찾고 그 후보 영역에 대한 객체의 종류와 위치를 학습된 모델을 통해 예측한다. 이 과정을 위해서 영상 및 영상 내의 객체 종류(class)와 객체 위치(bounding box) 정보가 필요하다.  얼굴, 도로상의 보행자 및 차량 등의 인식에 딥 러닝(deep learning) 기반의 객체 탐지 기술이 많이 이용된다.
"
에이피티엑스(aptX) 코덱,aptX codec,,,"고효율 저전력  오디오 코덱.  에이피티엑스(aptX) 코덱은 MP3보다 연산량이 매우 적어 전력이 적게 소비되며, 압축 효율이 대단히 높아 CD와 같은 음질을 제공한다. 또한 기존 블루투스 전송 방식인 부대역 부호화 방식(SBC: Subband Coding) 코덱에 비해서도 압축 효율이 높고 향상된 음질을 제공한다. 따라서 스마트폰, 무선 헤드폰, 무선 스피커와 같은 블루투스 기기 등에 사용된다. aptX 코덱은 영국 오디오 프로세싱 테크놀로지(Audio Processing Technology)사에서 개발하였고, 2010년 CSR사에 인수되었다."
테크노포비아,technophobia,,기술 공포증,"정보통신기술(ICT) 기기와 인공 지능(AI) 같은 첨단 기술에 대한 공포감이나 적대감을 느끼는 것.  
기능이 점점 복잡해지고 고도화되는 기기에 대해 스트레스를 받거나 거부감을 느낀다. 그리고 인공 지능(AI) 같은 첨단 과학 기술이 인간의 일자리를 뺏고 결국은 인간을 지배할 것이라는 막연한 두려움과 불안감 등 비관적 견해에 치우친다. 특히, 구글의 AI 컴퓨터 프로그램인 알파고(AlphaGo)가 세계 바둑 챔피언인 이세돌, 커제(Ke Jie) 등과의 대국(2016-2017)에서 승리를 거두면서 인공 지능에 대한 공포(AI 포비아)가 증폭되었다.  테크노포비아와 정반대로, 첨단 과학 기술은 인간이 필요에 의해 만든 것으로 제어가 가능하며, AI로 인해 새로운 일자리가 생기고, 삶이 윤택해질 수 있다라는 낙관적인 견해도 있다. 첨단 기술에 지나치게 예찬과 낙관만 하는 것을 테크노필리아(technophilia)라고 한다."
지능정보기술,,,,"인간의 인지, 학습, 추론 등 고차원적 정보 처리 활동을 ICT 기반으로 구현하는 기술.  
인공 지능(AI)에 데이터 활용 기술인 사물 인터넷(IoT), 빅데이터(Big data), 클라우드(Cloud), 모바일(Mobile)이 결합되어 AI+IBCM으로 표현된다. 
사물 인터넷과 모바일로 각종 정보를 수집하고 실시간으로 전달하며, 빅데이터와 클라우드를 통해 정보를 효율적으로 분석·처리하고 저장한다. 
지능정보기술은 다양한 제품과 서비스를 지능화하여(예: 자율 주행 자동차, 지능형 로봇 등) 제4차 산업혁명의 원동력이 된다.   
"
스마트폰 좀비,smartphone zombie,,스몸비,"스마트폰 화면을 들여다보느라 길거리에서 고개를 숙이고 걷는 사람을 넋 빠진 시체 걸음걸이에 빗대어 일컫는 말.  스마트폰(smartphone)’과 ‘좀비(zombie)’를 합성하여 ‘스몸비(smombie)’라고도 한다. 스마트폰 좀비(또는 스몸비)는 2015년 독일에서 처음 사용되었으며, 스마트폰에 지나치게 매인 세태를 풍자했다.  
특히 스마트폰 화면에 눈길을 빼앗긴 탓에 자동차에 치이는 사고가 잦아 문제가 됐다. 서울시와 경찰청이 2016년 6월 시민이 많이 오가는 시청, 연세대, 홍익대, 강남역, 잠실역 길바닥에 걸어가며 스마트폰을 보면 위험하다는 내용을 담은 교통안전표지를 설치해 눈길을 모았다. "
데이터 최고 책임자,Chief Data Officer,CDO,,"기업에서 가치를 창출할 수 있는 양질의 데이터를 발굴하여 기업 자산으로 관리하고 활용할 수 있도록 데이터 통합 관리(data governance)를 총괄 담당하는 최고 임원. 
기존 최고 정보 책임자(CIO: Chief Information Officer)와의 차이점은 CIO는 정보 시스템을 중심으로 정보 자원을 관리하고 비즈니스 활동을 하는 반면, 데이터 최고 책임자(CDO)는 방대한 빅데이터를 분석하고 비즈니스 전략에 맞는 데이터를 설계하는 등 데이터를 중심으로 비즈니스 활동을 한다. 또한 최신 정보통신기술(ICT) 기반으로 데이터를 전략적으로 활용할 수 있는 비즈니스 모델을 개발하여 이익 창출에 기여한다. 
CDO 직책은 2000년대 초반 비자(Visa), 캐피털원(Capital One)  미국 금융기관 등에서 생기기 시작했다. 이후 데이터양이 급격히 많아지고 중요성이 부각되면서 은행, 보험 회사, 공공기관 등에서 고객 정보, 기업 위기 관리 등을 위해 CDO를 임명하여 활용하고 있다. CDO는 조직에 따라 최고 경영 책임자(CEO) 직속 또는 최고 정보 책임자(CIO), 재무 담당 최고 책임자(CFO) 등의 직속으로 배정되어 있다. 
"
데이터 통합 관리,Data Governance,,데이터 거버넌스,"기업에서 가치 있는 양질의 데이터를 지속적으로 발굴·관리하여 비즈니스 자산으로 활용하기 위한 데이터 통합 관리 체계. 
ICT 발전에 따라 기업 내 데이터양이 급증하고 정보 시스템도 분산되면서 데이터가 효과적으로 통합 관리되지 않아 사용되지 않는 다크 데이터가 많아졌다. 
데이터 관리 소홀로 인한 정보 노출과 관리 비용을 줄이고, 고품질의 데이터를 발굴하여 기업의 가치 창출에 기여하기 위해서는 전사적으로 데이터를 관리하고 통제할 거버넌스가 필요하다.  
데이터 웨어하우스(data warehouse)와 같은 중앙 집중식의 시스템을 활용하여 분산된 데이터 및 정보 시스템을 연결하고 통합하여 데이터의 중복을 제거하고 양질의 데이터로 유지 관리가 수행될 수 있다. 이 외에, 기준 정보 관리(MDM: Master Data Management), 빅데이터, 클라우드 컴퓨팅 솔루션 등이 사용된다. "
디지털 전환,Digital Transformation,DX,디지털 트랜스포메이션,"디지털 기술을 사회 전반에 적용하여 전통적인 사회 구조를 혁신시키는 것.  
일반적으로 기업에서 사물 인터넷(IoT), 클라우드 컴퓨팅, 인공지능(AI), 빅데이터 솔루션 등 정보통신기술(ICT)을 플랫폼으로 구축·활용하여 기존 전통적인 운영 방식과 서비스 등을 혁신하는 것을 의미한다.  
IBM 기업가치연구소의 보고서(2011)는 ‘기업이 디지털과 물리적인 요소들을 통합하여 비즈니스 모델을 변화시키고, 산업에 새로운 방향을 정립하는 전략’이라고 정의하고 있다.  
디지털 전환(digital transformation)을 위해서는 아날로그 형태를 디지털 형태로 변환하는 ‘전산화(digitization)’ 단계와 산업에 정보통신기술을 활용하는 ‘디지털화(digitalization)’ 단계를 거쳐야 한다. 
디지털 전환을 추진한 사례로, 제너럴 일렉트릭(GE)의 산업 인터넷용 소프트웨어 플랫폼 프레딕스(Predix™), 모바일앱으로 매장 주문과 결제를 할 수 있는 스타벅스의 ‘사이렌오더 서비스’ 등이 있다. 성공적인 디지털 전환을 통해 제4차 산업혁명이 실현된다."
위치 측정 및 동시 지도화,Simultaneous Localization And Mapping,SLAM,,"로봇이 임의 공간을 이동하면서 주변을 탐색하고 자신의 위치를 측정하여 동시에 지도를 작성하는 것.  주로 카메라와 레이저 센서를 이용하여 주변 환경과의 거리를 측정한다. 자율 주행 자동차, 무인 항공기(드론), 무인 청소기 등에서 SLAM을 활용할 수 있다."
지능형,intelligent,,,"정보를 습득하여 상황을 인지하고 예측해 나가는 것을 의미하는 형용사. 컴퓨터, 자동차, CCTV, 애플리케이션 등에 인공 지능(AI) 기술이 적용되어 ‘지능형(intelligent)’ 수식어가 붙는다. 예로 지능형 자동차(intelligent vehicle), 지능망(intelligent network), 지능형 교통 체계(ITS: intelligent Transport Systems), 지능형 가상 비서(IPA: intelligent Personal Assistant) 등이 있다."
,,,,
활성레코드,Activeation Record,,,"1. 프로그램을 수행할 때 프로그램 내의 부프로그램이 실행되는 동안에 필요로 하는 수행환경에 대한 정보.
2. 단위 프로그램이 활성화될 때마다 스택 메모리에 새로 생성되며 실행에 필요한 정보들을 가지고 있다.
3. 활성 레코드 안에 들어가는 정보
  : 지역변수, 매개변수, 복귀주소"
데이터 스크래핑,,,,"고객이 자신의 인증 정보를 한 번만 제공해도 컴퓨터가 금융기관, 대법원 등 시스템에 접속해 여러 곳에 흩어져 있는 고객의 정보를 모아 가공하거나 제공하는 기술"
Remote Direct Memory Access,Remote Direct Memory Access,RDMA,,"물리적으로 다른 여러대 서버의 메모리를 가상화시켜 하나의 거대한 메모리 풀로 만들어주는 기술. 
메모리와 서버 사이의 여러 중간 홉을 없애 직접 통신하기 때문에 데이터베이스, 데이터웨어하우징, 분석 등의 성능을 대폭 향상."
서비스형운송,Transport as a Service,TaaS,,"자동차를 개인이 소유하는 것이 아니라 빌려 탄 만큼 돈을 내는 비즈니스 모델
-Taas 시장 개화의 첫 단계로는 카셰어링 서비스가 대표적"
서피스 허브,,,,마이크로소프트가 최초 공개한 벽걸이형 대형 태블릿이다. 개인용이 아닌 협업용으로 설계됐다.회의실이나 컨퍼런스 룸을 겨냥한 기기로 손가락이나 스타일러스 펜을 이용해 회의 내용을 기록·공유할 수 있다. 여기에 음성인식을 지원하고 동작인식 센서가 탑재된 카메라를 달아 오디오·비디오 컨퍼런스를 효과적으로 진행하게 돕는다.
침입 방지 시스템,,,,"IPS는 외부 네트워크로부터 내부 네트워크로 침입하는 네트워크 패킷을 찾아 제어하는 기능을 가진 소프트웨어 또는 하드웨어이다. 일반적으로 내부 네트워크로 들어오는 모든 패킷이 지나가는 경로에 설치되며, 호스트의 IP주소, TCP/UDP의 포트번호, 사용자 인증에 기반을 두고 외부 침입을 차단하는 역할을 한다. 허용되지 않는 사용자나 서비스에 대해 사용을 거부하여 내부 자원을 보호한다."
,,,,
이상거래탐지시스템,,FDS,,"금융 거래에서 부정 결제나 사기 등 이상 거래 징후를 사전에 탐지해서 차단하는 보안 방식
- 빅데이터 분석 기술 등을 바탕으로 결제 관련 다양한 정보를 수집해 패턴화하고, 평소 정상 패턴과 다른 이상 징후를 발견하면 거래를 중단시킴
- FDS는 정보수집/분석·탐지/대응/모니터링·감사 등 네 가지가 기본 기능으로 구성됨
- 위치뿐만 아니라 평소 소비 패턴이나 사용자 환경, 서비스 유형, 거래 시간, 대상 등 다양한 요소를 빅데이터 분석해 이상 거래 탐지 기준을 마련함"
디지털 포렌식 ,,,,"범죄수사에서 적용되고 있는 과학적 증거 수집 및 분석기법으로 각종 디지털 데이터 및 통화기록 이메일 등을 수집,분석하여 증거를 확보하는 수사기법"
,,,,
O2O,online to offline,O2O,,"흔히 오투오라고 부른다.
유통 관점 개념으로는 온라인 플랫폼을 통해 실제 오프라인에서 일어나는 활동(액티비티)을 일으키는 일종의 비즈니스를 일컫는다."
분산형 클라우드,,,,"분산형 클라우드(Distributed Cloud)는 퍼블릭 클라우드 서비스를 다양한 장소에 배치할 수 있는 것입니다. 이를 통해 대기 시간 문제나 데이터 주권 등의 문제를 해결할 수 있고, 프라이빗 클라우드의 장점과 퍼블릭 클라우드의 장점을 모두 제공"
`